/* automatically generated by rust-bindgen */

#[repr(C)]
#[derive(Copy, Clone, Debug, Default, Eq, Hash, Ord, PartialEq, PartialOrd)]
pub struct __BindgenBitfieldUnit<Storage, Align>
where
    Storage: AsRef<[u8]> + AsMut<[u8]>,
{
    storage: Storage,
    align: [Align; 0],
}

impl<Storage, Align> __BindgenBitfieldUnit<Storage, Align>
where
    Storage: AsRef<[u8]> + AsMut<[u8]>,
{
    #[inline]
    pub fn new(storage: Storage) -> Self {
        Self { storage, align: [] }
    }

    #[inline]
    pub fn get_bit(&self, index: usize) -> bool {
        debug_assert!(index / 8 < self.storage.as_ref().len());

        let byte_index = index / 8;
        let byte = self.storage.as_ref()[byte_index];

        let bit_index = if cfg!(target_endian = "big") {
            7 - (index % 8)
        } else {
            index % 8
        };

        let mask = 1 << bit_index;

        byte & mask == mask
    }

    #[inline]
    pub fn set_bit(&mut self, index: usize, val: bool) {
        debug_assert!(index / 8 < self.storage.as_ref().len());

        let byte_index = index / 8;
        let byte = &mut self.storage.as_mut()[byte_index];

        let bit_index = if cfg!(target_endian = "big") {
            7 - (index % 8)
        } else {
            index % 8
        };

        let mask = 1 << bit_index;
        if val {
            *byte |= mask;
        } else {
            *byte &= !mask;
        }
    }

    #[inline]

        debug_assert!((bit_offset + (bit_width as usize)) / 8 <= self.storage.as_ref().len());

        let mut val = 0;

        for i in 0..(bit_width as usize) {
            if self.get_bit(i + bit_offset) {
                let index = if cfg!(target_endian = "big") {
                    bit_width as usize - 1 - i
                } else {
                    i
                };
                val |= 1 << index;
            }
        }

        val
    }

    #[inline]
    pub fn set(&mut self, bit_offset: usize, bit_width: u8, val: u64) {
        debug_assert!(bit_width <= 64);
        debug_assert!(bit_offset / 8 < self.storage.as_ref().len());
        debug_assert!((bit_offset + (bit_width as usize)) / 8 <= self.storage.as_ref().len());

        for i in 0..(bit_width as usize) {
            let mask = 1 << i;
            let val_bit_is_set = val & mask == mask;
            let index = if cfg!(target_endian = "big") {
                bit_width as usize - 1 - i
            } else {
                i
            };
            self.set_bit(index + bit_offset, val_bit_is_set);
        }
    }
}
#[repr(C)]
#[derive(Default)]
pub struct __IncompleteArrayField<T>(::std::marker::PhantomData<T>);
impl<T> __IncompleteArrayField<T> {
    #[inline]
    pub fn new() -> Self {
        __IncompleteArrayField(::std::marker::PhantomData)
    }
    #[inline]
    pub unsafe fn as_ptr(&self) -> *const T {
        ::std::mem::transmute(self)
    }
    #[inline]
    pub unsafe fn as_mut_ptr(&mut self) -> *mut T {
        ::std::mem::transmute(self)
    }
    #[inline]
    pub unsafe fn as_slice(&self, len: usize) -> &[T] {
        ::std::slice::from_raw_parts(self.as_ptr(), len)
    }
    #[inline]
    pub unsafe fn as_mut_slice(&mut self, len: usize) -> &mut [T] {
        ::std::slice::from_raw_parts_mut(self.as_mut_ptr(), len)
    }
}
impl<T> ::std::fmt::Debug for __IncompleteArrayField<T> {
    fn fmt(&self, fmt: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        fmt.write_str("__IncompleteArrayField")
    }
}
impl<T> ::std::clone::Clone for __IncompleteArrayField<T> {
    #[inline]
    fn clone(&self) -> Self {
        Self::new()
    }
}
impl<T> ::std::marker::Copy for __IncompleteArrayField<T> {}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct spdk_pci_device {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct spdk_env_opts {
    pub name: *const ::std::os::raw::c_char,
    pub core_mask: *const ::std::os::raw::c_char,
    pub shm_id: ::std::os::raw::c_int,
    pub mem_channel: ::std::os::raw::c_int,
    pub master_core: ::std::os::raw::c_int,
    pub mem_size: ::std::os::raw::c_int,
    pub no_pci: bool,
    pub hugepage_single_segments: bool,
    pub unlink_hugepage: bool,
    pub num_pci_addr: usize,
    pub pci_blacklist: *mut spdk_pci_addr,
    pub pci_whitelist: *mut spdk_pci_addr,
    pub env_context: *mut ::std::os::raw::c_void,
}
#[test]
fn bindgen_test_layout_spdk_env_opts() {
    assert_eq!(
        ::std::mem::size_of::<spdk_env_opts>(),
        72usize,
        concat!("Size of: ", stringify!(spdk_env_opts))
    );
    assert_eq!(
        ::std::mem::align_of::<spdk_env_opts>(),
        8usize,
        concat!("Alignment of ", stringify!(spdk_env_opts))
    );
}
impl Default for spdk_env_opts {
    fn default() -> Self {
        unsafe { ::std::mem::zeroed() }
    }
}
extern "C" {
    pub fn spdk_env_opts_init(opts: *mut spdk_env_opts);
}
extern "C" {
    pub fn spdk_env_init(opts: *const spdk_env_opts) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn spdk_dma_malloc(
        size: usize,
        align: usize,
        phys_addr: *mut u64,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn spdk_dma_malloc_socket(
        size: usize,
        align: usize,
        phys_addr: *mut u64,
        socket_id: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn spdk_dma_zmalloc(
        size: usize,
        align: usize,
        phys_addr: *mut u64,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn spdk_dma_zmalloc_socket(
        size: usize,
        align: usize,
        phys_addr: *mut u64,
        socket_id: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn spdk_dma_realloc(
        buf: *mut ::std::os::raw::c_void,
        size: usize,
        align: usize,
        phys_addr: *mut u64,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn spdk_dma_free(buf: *mut ::std::os::raw::c_void);
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct spdk_mempool {
    _unused: [u8; 0],
}
extern "C" {
    pub fn spdk_mempool_create(
        name: *const ::std::os::raw::c_char,
        count: usize,
        ele_size: usize,
        cache_size: usize,
        socket_id: ::std::os::raw::c_int,
    ) -> *mut spdk_mempool;
}
pub type spdk_mempool_obj_cb_t = ::std::option::Option<
    unsafe extern "C" fn(
        mp: *mut spdk_mempool,
        opaque: *mut ::std::os::raw::c_void,
        obj: *mut ::std::os::raw::c_void,
        obj_idx: ::std::os::raw::c_uint,
    ),
>;
extern "C" {
    pub fn spdk_mempool_create_ctor(
        name: *const ::std::os::raw::c_char,
        count: usize,
        ele_size: usize,
        cache_size: usize,
        socket_id: ::std::os::raw::c_int,
        obj_init: spdk_mempool_obj_cb_t,
        obj_init_arg: *mut ::std::os::raw::c_void,
    ) -> *mut spdk_mempool;
}
extern "C" {
    pub fn spdk_mempool_get_name(mp: *mut spdk_mempool) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn spdk_mempool_free(mp: *mut spdk_mempool);
}
extern "C" {
    pub fn spdk_mempool_get(mp: *mut spdk_mempool) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn spdk_mempool_get_bulk(
        mp: *mut spdk_mempool,
        ele_arr: *mut *mut ::std::os::raw::c_void,
        count: usize,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn spdk_mempool_put(mp: *mut spdk_mempool, ele: *mut ::std::os::raw::c_void);
}
extern "C" {
    pub fn spdk_mempool_put_bulk(
        mp: *mut spdk_mempool,
        ele_arr: *mut *mut ::std::os::raw::c_void,
        count: usize,
    );
}
extern "C" {
    pub fn spdk_mempool_count(pool: *const spdk_mempool) -> usize;
}
extern "C" {
    pub fn spdk_env_get_core_count() -> u32;
}
extern "C" {
    pub fn spdk_env_get_current_core() -> u32;
}
extern "C" {
    pub fn spdk_env_get_first_core() -> u32;
}
extern "C" {
    pub fn spdk_env_get_last_core() -> u32;
}
extern "C" {
    pub fn spdk_env_get_next_core(prev_core: u32) -> u32;
}
extern "C" {
    pub fn spdk_env_get_socket_id(core: u32) -> u32;
}
pub type thread_start_fn = ::std::option::Option<
    unsafe extern "C" fn(arg1: *mut ::std::os::raw::c_void) -> ::std::os::raw::c_int,
>;
extern "C" {
    pub fn spdk_env_thread_launch_pinned(
        core: u32,
        fn_: thread_start_fn,
        arg: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn spdk_env_thread_wait_all();
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct spdk_pci_addr {
    pub domain: u32,
    pub bus: u8,
    pub dev: u8,
    pub func: u8,
}
#[test]
fn bindgen_test_layout_spdk_pci_addr() {
    assert_eq!(
        ::std::mem::size_of::<spdk_pci_addr>(),
        8usize,
        concat!("Size of: ", stringify!(spdk_pci_addr))
    );
    assert_eq!(
        ::std::mem::align_of::<spdk_pci_addr>(),
        4usize,
        concat!("Alignment of ", stringify!(spdk_pci_addr))
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union spdk_nvme_cap_register {
    pub raw: u64,
    pub bits: spdk_nvme_cap_register__bindgen_ty_1,
    _bindgen_union_align: u64,
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct spdk_nvme_cap_register__bindgen_ty_1 {
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 8usize], u16>,
    pub __bindgen_align: [u32; 0usize],
}
#[test]
fn bindgen_test_layout_spdk_nvme_cap_register__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<spdk_nvme_cap_register__bindgen_ty_1>(),
        8usize,
        concat!(
            "Size of: ",
            stringify!(spdk_nvme_cap_register__bindgen_ty_1)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<spdk_nvme_cap_register__bindgen_ty_1>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(spdk_nvme_cap_register__bindgen_ty_1)
        )
    );
}
impl spdk_nvme_cap_register__bindgen_ty_1 {
    #[inline]
    pub fn mqes(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 16u8) as u32) }
    }
    #[inline]
    pub fn set_mqes(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 16u8, val as u64)
        }
    }
    #[inline]
    pub fn cqr(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(16usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_cqr(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(16usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn ams(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(17usize, 2u8) as u32) }
    }
    #[inline]
    pub fn set_ams(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(17usize, 2u8, val as u64)
        }
    }
    #[inline]
    pub fn reserved1(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(19usize, 5u8) as u32) }
    }
    #[inline]
    pub fn set_reserved1(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(19usize, 5u8, val as u64)
        }
    }
    #[inline]
    pub fn to(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(24usize, 8u8) as u32) }
    }
    #[inline]
    pub fn set_to(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(24usize, 8u8, val as u64)
        }
    }
    #[inline]
    pub fn dstrd(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(32usize, 4u8) as u32) }
    }
    #[inline]
    pub fn set_dstrd(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(32usize, 4u8, val as u64)
        }
    }
    #[inline]
    pub fn nssrs(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(36usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_nssrs(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(36usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn css(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(37usize, 8u8) as u32) }
    }
    #[inline]
    pub fn set_css(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(37usize, 8u8, val as u64)
        }
    }
    #[inline]
    pub fn bps(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(45usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_bps(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(45usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn reserved2(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(46usize, 2u8) as u32) }
    }
    #[inline]
    pub fn set_reserved2(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(46usize, 2u8, val as u64)
        }
    }
    #[inline]
    pub fn mpsmin(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(48usize, 4u8) as u32) }
    }
    #[inline]
    pub fn set_mpsmin(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(48usize, 4u8, val as u64)
        }
    }
    #[inline]
    pub fn mpsmax(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(52usize, 4u8) as u32) }
    }
    #[inline]
    pub fn set_mpsmax(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(52usize, 4u8, val as u64)
        }
    }
    #[inline]
    pub fn reserved3(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(56usize, 8u8) as u32) }
    }
    #[inline]
    pub fn set_reserved3(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(56usize, 8u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        mqes: u32,
        cqr: u32,
        ams: u32,
        reserved1: u32,
        to: u32,
        dstrd: u32,
        nssrs: u32,
        css: u32,
        bps: u32,
        reserved2: u32,
        mpsmin: u32,
        mpsmax: u32,
        reserved3: u32,
    ) -> __BindgenBitfieldUnit<[u8; 8usize], u16> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 8usize], u16> =
            Default::default();
        __bindgen_bitfield_unit.set(0usize, 16u8, {
            let mqes: u32 = unsafe { ::std::mem::transmute(mqes) };
            mqes as u64
        });
        __bindgen_bitfield_unit.set(16usize, 1u8, {
            let cqr: u32 = unsafe { ::std::mem::transmute(cqr) };
            cqr as u64
        });
        __bindgen_bitfield_unit.set(17usize, 2u8, {
            let ams: u32 = unsafe { ::std::mem::transmute(ams) };
            ams as u64
        });
        __bindgen_bitfield_unit.set(19usize, 5u8, {
            let reserved1: u32 = unsafe { ::std::mem::transmute(reserved1) };
            reserved1 as u64
        });
        __bindgen_bitfield_unit.set(24usize, 8u8, {
            let to: u32 = unsafe { ::std::mem::transmute(to) };
            to as u64
        });
        __bindgen_bitfield_unit.set(32usize, 4u8, {
            let dstrd: u32 = unsafe { ::std::mem::transmute(dstrd) };
            dstrd as u64
        });
        __bindgen_bitfield_unit.set(36usize, 1u8, {
            let nssrs: u32 = unsafe { ::std::mem::transmute(nssrs) };
            nssrs as u64
        });
        __bindgen_bitfield_unit.set(37usize, 8u8, {
            let css: u32 = unsafe { ::std::mem::transmute(css) };
            css as u64
        });
        __bindgen_bitfield_unit.set(45usize, 1u8, {
            let bps: u32 = unsafe { ::std::mem::transmute(bps) };
            bps as u64
        });
        __bindgen_bitfield_unit.set(46usize, 2u8, {
            let reserved2: u32 = unsafe { ::std::mem::transmute(reserved2) };
            reserved2 as u64
        });
        __bindgen_bitfield_unit.set(48usize, 4u8, {
            let mpsmin: u32 = unsafe { ::std::mem::transmute(mpsmin) };
            mpsmin as u64
        });
        __bindgen_bitfield_unit.set(52usize, 4u8, {
            let mpsmax: u32 = unsafe { ::std::mem::transmute(mpsmax) };
            mpsmax as u64
        });
        __bindgen_bitfield_unit.set(56usize, 8u8, {
            let reserved3: u32 = unsafe { ::std::mem::transmute(reserved3) };
            reserved3 as u64
        });
        __bindgen_bitfield_unit
    }
}
#[test]
fn bindgen_test_layout_spdk_nvme_cap_register() {
    assert_eq!(
        ::std::mem::size_of::<spdk_nvme_cap_register>(),
        8usize,
        concat!("Size of: ", stringify!(spdk_nvme_cap_register))
    );
    assert_eq!(
        ::std::mem::align_of::<spdk_nvme_cap_register>(),
        8usize,
        concat!("Alignment of ", stringify!(spdk_nvme_cap_register))
    );
}
impl Default for spdk_nvme_cap_register {
    fn default() -> Self {
        unsafe { ::std::mem::zeroed() }
    }
}
pub const spdk_nvme_cc_css_SPDK_NVME_CC_CSS_NVM: spdk_nvme_cc_css = 0;
pub type spdk_nvme_cc_css = u32;
#[repr(C)]
#[derive(Copy, Clone)]
pub union spdk_nvme_cc_register {
    pub raw: u32,
    pub bits: spdk_nvme_cc_register__bindgen_ty_1,
    _bindgen_union_align: u32,
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct spdk_nvme_cc_register__bindgen_ty_1 {
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 4usize], u8>,
    pub __bindgen_align: [u32; 0usize],
}
#[test]
fn bindgen_test_layout_spdk_nvme_cc_register__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<spdk_nvme_cc_register__bindgen_ty_1>(),
        4usize,
        concat!("Size of: ", stringify!(spdk_nvme_cc_register__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<spdk_nvme_cc_register__bindgen_ty_1>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(spdk_nvme_cc_register__bindgen_ty_1)
        )
    );
}
impl spdk_nvme_cc_register__bindgen_ty_1 {
    #[inline]
    pub fn en(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_en(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn reserved1(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(1usize, 3u8) as u32) }
    }
    #[inline]
    pub fn set_reserved1(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(1usize, 3u8, val as u64)
        }
    }
    #[inline]
    pub fn css(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(4usize, 3u8) as u32) }
    }
    #[inline]
    pub fn set_css(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(4usize, 3u8, val as u64)
        }
    }
    #[inline]
    pub fn mps(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(7usize, 4u8) as u32) }
    }
    #[inline]
    pub fn set_mps(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(7usize, 4u8, val as u64)
        }
    }
    #[inline]
    pub fn ams(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(11usize, 3u8) as u32) }
    }
    #[inline]
    pub fn set_ams(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(11usize, 3u8, val as u64)
        }
    }
    #[inline]
    pub fn shn(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(14usize, 2u8) as u32) }
    }
    #[inline]
    pub fn set_shn(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(14usize, 2u8, val as u64)
        }
    }
    #[inline]
    pub fn iosqes(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(16usize, 4u8) as u32) }
    }
    #[inline]
    pub fn set_iosqes(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(16usize, 4u8, val as u64)
        }
    }
    #[inline]
    pub fn iocqes(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(20usize, 4u8) as u32) }
    }
    #[inline]
    pub fn set_iocqes(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(20usize, 4u8, val as u64)
        }
    }
    #[inline]
    pub fn reserved2(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(24usize, 8u8) as u32) }
    }
    #[inline]
    pub fn set_reserved2(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(24usize, 8u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        en: u32,
        reserved1: u32,
        css: u32,
        mps: u32,
        ams: u32,
        shn: u32,
        iosqes: u32,
        iocqes: u32,
        reserved2: u32,
    ) -> __BindgenBitfieldUnit<[u8; 4usize], u8> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 4usize], u8> =
            Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let en: u32 = unsafe { ::std::mem::transmute(en) };
            en as u64
        });
        __bindgen_bitfield_unit.set(1usize, 3u8, {
            let reserved1: u32 = unsafe { ::std::mem::transmute(reserved1) };
            reserved1 as u64
        });
        __bindgen_bitfield_unit.set(4usize, 3u8, {
            let css: u32 = unsafe { ::std::mem::transmute(css) };
            css as u64
        });
        __bindgen_bitfield_unit.set(7usize, 4u8, {
            let mps: u32 = unsafe { ::std::mem::transmute(mps) };
            mps as u64
        });
        __bindgen_bitfield_unit.set(11usize, 3u8, {
            let ams: u32 = unsafe { ::std::mem::transmute(ams) };
            ams as u64
        });
        __bindgen_bitfield_unit.set(14usize, 2u8, {
            let shn: u32 = unsafe { ::std::mem::transmute(shn) };
            shn as u64
        });
        __bindgen_bitfield_unit.set(16usize, 4u8, {
            let iosqes: u32 = unsafe { ::std::mem::transmute(iosqes) };
            iosqes as u64
        });
        __bindgen_bitfield_unit.set(20usize, 4u8, {
            let iocqes: u32 = unsafe { ::std::mem::transmute(iocqes) };
            iocqes as u64
        });
        __bindgen_bitfield_unit.set(24usize, 8u8, {
            let reserved2: u32 = unsafe { ::std::mem::transmute(reserved2) };
            reserved2 as u64
        });
        __bindgen_bitfield_unit
    }
}
#[test]
fn bindgen_test_layout_spdk_nvme_cc_register() {
    assert_eq!(
        ::std::mem::size_of::<spdk_nvme_cc_register>(),
        4usize,
        concat!("Size of: ", stringify!(spdk_nvme_cc_register))
    );
    assert_eq!(
        ::std::mem::align_of::<spdk_nvme_cc_register>(),
        4usize,
        concat!("Alignment of ", stringify!(spdk_nvme_cc_register))
    );
}
impl Default for spdk_nvme_cc_register {
    fn default() -> Self {
        unsafe { ::std::mem::zeroed() }
    }
}
pub const spdk_nvme_shn_value_SPDK_NVME_SHN_NORMAL: spdk_nvme_shn_value = 1;
pub const spdk_nvme_shn_value_SPDK_NVME_SHN_ABRUPT: spdk_nvme_shn_value = 2;
pub type spdk_nvme_shn_value = u32;
#[repr(C)]
#[derive(Copy, Clone)]
pub union spdk_nvme_csts_register {
    pub raw: u32,
    pub bits: spdk_nvme_csts_register__bindgen_ty_1,
    _bindgen_union_align: u32,
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct spdk_nvme_csts_register__bindgen_ty_1 {
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 4usize], u32>,
    pub __bindgen_align: [u32; 0usize],
}
#[test]
fn bindgen_test_layout_spdk_nvme_csts_register__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<spdk_nvme_csts_register__bindgen_ty_1>(),
        4usize,
        concat!(
            "Size of: ",
            stringify!(spdk_nvme_csts_register__bindgen_ty_1)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<spdk_nvme_csts_register__bindgen_ty_1>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(spdk_nvme_csts_register__bindgen_ty_1)
        )
    );
}
impl spdk_nvme_csts_register__bindgen_ty_1 {
    #[inline]
    pub fn rdy(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_rdy(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn cfs(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(1usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_cfs(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(1usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn shst(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(2usize, 2u8) as u32) }
    }
    #[inline]
    pub fn set_shst(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(2usize, 2u8, val as u64)
        }
    }
    #[inline]
    pub fn nssro(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(4usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_nssro(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(4usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn pp(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(5usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_pp(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(5usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn reserved1(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(6usize, 26u8) as u32) }
    }
    #[inline]
    pub fn set_reserved1(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(6usize, 26u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        rdy: u32,
        cfs: u32,
        shst: u32,
        nssro: u32,
        pp: u32,
        reserved1: u32,
    ) -> __BindgenBitfieldUnit<[u8; 4usize], u32> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 4usize], u32> =
            Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let rdy: u32 = unsafe { ::std::mem::transmute(rdy) };
            rdy as u64
        });
        __bindgen_bitfield_unit.set(1usize, 1u8, {
            let cfs: u32 = unsafe { ::std::mem::transmute(cfs) };
            cfs as u64
        });
        __bindgen_bitfield_unit.set(2usize, 2u8, {
            let shst: u32 = unsafe { ::std::mem::transmute(shst) };
            shst as u64
        });
        __bindgen_bitfield_unit.set(4usize, 1u8, {
            let nssro: u32 = unsafe { ::std::mem::transmute(nssro) };
            nssro as u64
        });
        __bindgen_bitfield_unit.set(5usize, 1u8, {
            let pp: u32 = unsafe { ::std::mem::transmute(pp) };
            pp as u64
        });
        __bindgen_bitfield_unit.set(6usize, 26u8, {
            let reserved1: u32 = unsafe { ::std::mem::transmute(reserved1) };
            reserved1 as u64
        });
        __bindgen_bitfield_unit
    }
}
#[test]
fn bindgen_test_layout_spdk_nvme_csts_register() {
    assert_eq!(
        ::std::mem::size_of::<spdk_nvme_csts_register>(),
        4usize,
        concat!("Size of: ", stringify!(spdk_nvme_csts_register))
    );
    assert_eq!(
        ::std::mem::align_of::<spdk_nvme_csts_register>(),
        4usize,
        concat!("Alignment of ", stringify!(spdk_nvme_csts_register))
    );
}
impl Default for spdk_nvme_csts_register {
    fn default() -> Self {
        unsafe { ::std::mem::zeroed() }
    }
}
pub const spdk_nvme_shst_value_SPDK_NVME_SHST_NORMAL: spdk_nvme_shst_value = 0;
pub const spdk_nvme_shst_value_SPDK_NVME_SHST_OCCURRING: spdk_nvme_shst_value = 1;
pub const spdk_nvme_shst_value_SPDK_NVME_SHST_COMPLETE: spdk_nvme_shst_value = 2;
pub type spdk_nvme_shst_value = u32;
#[repr(C)]
#[derive(Copy, Clone)]
pub union spdk_nvme_aqa_register {
    pub raw: u32,
    pub bits: spdk_nvme_aqa_register__bindgen_ty_1,
    _bindgen_union_align: u32,
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct spdk_nvme_aqa_register__bindgen_ty_1 {
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 4usize], u16>,
    pub __bindgen_align: [u32; 0usize],
}
#[test]
fn bindgen_test_layout_spdk_nvme_aqa_register__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<spdk_nvme_aqa_register__bindgen_ty_1>(),
        4usize,
        concat!(
            "Size of: ",
            stringify!(spdk_nvme_aqa_register__bindgen_ty_1)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<spdk_nvme_aqa_register__bindgen_ty_1>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(spdk_nvme_aqa_register__bindgen_ty_1)
        )
    );
}
impl spdk_nvme_aqa_register__bindgen_ty_1 {
    #[inline]
    pub fn asqs(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 12u8) as u32) }
    }
    #[inline]
    pub fn set_asqs(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 12u8, val as u64)
        }
    }
    #[inline]
    pub fn reserved1(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(12usize, 4u8) as u32) }
    }
    #[inline]
    pub fn set_reserved1(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(12usize, 4u8, val as u64)
        }
    }
    #[inline]
    pub fn acqs(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(16usize, 12u8) as u32) }
    }
    #[inline]
    pub fn set_acqs(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(16usize, 12u8, val as u64)
        }
    }
    #[inline]
    pub fn reserved2(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(28usize, 4u8) as u32) }
    }
    #[inline]
    pub fn set_reserved2(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(28usize, 4u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        asqs: u32,
        reserved1: u32,
        acqs: u32,
        reserved2: u32,
    ) -> __BindgenBitfieldUnit<[u8; 4usize], u16> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 4usize], u16> =
            Default::default();
        __bindgen_bitfield_unit.set(0usize, 12u8, {
            let asqs: u32 = unsafe { ::std::mem::transmute(asqs) };
            asqs as u64
        });
        __bindgen_bitfield_unit.set(12usize, 4u8, {
            let reserved1: u32 = unsafe { ::std::mem::transmute(reserved1) };
            reserved1 as u64
        });
        __bindgen_bitfield_unit.set(16usize, 12u8, {
            let acqs: u32 = unsafe { ::std::mem::transmute(acqs) };
            acqs as u64
        });
        __bindgen_bitfield_unit.set(28usize, 4u8, {
            let reserved2: u32 = unsafe { ::std::mem::transmute(reserved2) };
            reserved2 as u64
        });
        __bindgen_bitfield_unit
    }
}
#[test]
fn bindgen_test_layout_spdk_nvme_aqa_register() {
    assert_eq!(
        ::std::mem::size_of::<spdk_nvme_aqa_register>(),
        4usize,
        concat!("Size of: ", stringify!(spdk_nvme_aqa_register))
    );
    assert_eq!(
        ::std::mem::align_of::<spdk_nvme_aqa_register>(),
        4usize,
        concat!("Alignment of ", stringify!(spdk_nvme_aqa_register))
    );
}
impl Default for spdk_nvme_aqa_register {
    fn default() -> Self {
        unsafe { ::std::mem::zeroed() }
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union spdk_nvme_vs_register {
    pub raw: u32,
    pub bits: spdk_nvme_vs_register__bindgen_ty_1,
    _bindgen_union_align: u32,
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct spdk_nvme_vs_register__bindgen_ty_1 {
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 4usize], u16>,
    pub __bindgen_align: [u32; 0usize],
}
#[test]
fn bindgen_test_layout_spdk_nvme_vs_register__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<spdk_nvme_vs_register__bindgen_ty_1>(),
        4usize,
        concat!("Size of: ", stringify!(spdk_nvme_vs_register__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<spdk_nvme_vs_register__bindgen_ty_1>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(spdk_nvme_vs_register__bindgen_ty_1)
        )
    );
}
impl spdk_nvme_vs_register__bindgen_ty_1 {
    #[inline]
    pub fn ter(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 8u8) as u32) }
    }
    #[inline]
    pub fn set_ter(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 8u8, val as u64)
        }
    }
    #[inline]
    pub fn mnr(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(8usize, 8u8) as u32) }
    }
    #[inline]
    pub fn set_mnr(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(8usize, 8u8, val as u64)
        }
    }
    #[inline]
    pub fn mjr(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(16usize, 16u8) as u32) }
    }
    #[inline]
    pub fn set_mjr(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(16usize, 16u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        ter: u32,
        mnr: u32,
        mjr: u32,
    ) -> __BindgenBitfieldUnit<[u8; 4usize], u16> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 4usize], u16> =
            Default::default();
        __bindgen_bitfield_unit.set(0usize, 8u8, {
            let ter: u32 = unsafe { ::std::mem::transmute(ter) };
            ter as u64
        });
        __bindgen_bitfield_unit.set(8usize, 8u8, {
            let mnr: u32 = unsafe { ::std::mem::transmute(mnr) };
            mnr as u64
        });
        __bindgen_bitfield_unit.set(16usize, 16u8, {
            let mjr: u32 = unsafe { ::std::mem::transmute(mjr) };
            mjr as u64
        });
        __bindgen_bitfield_unit
    }
}
#[test]
fn bindgen_test_layout_spdk_nvme_vs_register() {
    assert_eq!(
        ::std::mem::size_of::<spdk_nvme_vs_register>(),
        4usize,
        concat!("Size of: ", stringify!(spdk_nvme_vs_register))
    );
    assert_eq!(
        ::std::mem::align_of::<spdk_nvme_vs_register>(),
        4usize,
        concat!("Alignment of ", stringify!(spdk_nvme_vs_register))
    );
}
impl Default for spdk_nvme_vs_register {
    fn default() -> Self {
        unsafe { ::std::mem::zeroed() }
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union spdk_nvme_cmbloc_register {
    pub raw: u32,
    pub bits: spdk_nvme_cmbloc_register__bindgen_ty_1,
    _bindgen_union_align: u32,
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct spdk_nvme_cmbloc_register__bindgen_ty_1 {
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 4usize], u32>,
    pub __bindgen_align: [u32; 0usize],
}
#[test]
fn bindgen_test_layout_spdk_nvme_cmbloc_register__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<spdk_nvme_cmbloc_register__bindgen_ty_1>(),
        4usize,
        concat!(
            "Size of: ",
            stringify!(spdk_nvme_cmbloc_register__bindgen_ty_1)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<spdk_nvme_cmbloc_register__bindgen_ty_1>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(spdk_nvme_cmbloc_register__bindgen_ty_1)
        )
    );
}
impl spdk_nvme_cmbloc_register__bindgen_ty_1 {
    #[inline]
    pub fn bir(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 3u8) as u32) }
    }
    #[inline]
    pub fn set_bir(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 3u8, val as u64)
        }
    }
    #[inline]
    pub fn reserved1(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(3usize, 9u8) as u32) }
    }
    #[inline]
    pub fn set_reserved1(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(3usize, 9u8, val as u64)
        }
    }
    #[inline]
    pub fn ofst(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(12usize, 20u8) as u32) }
    }
    #[inline]
    pub fn set_ofst(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(12usize, 20u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        bir: u32,
        reserved1: u32,
        ofst: u32,
    ) -> __BindgenBitfieldUnit<[u8; 4usize], u32> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 4usize], u32> =
            Default::default();
        __bindgen_bitfield_unit.set(0usize, 3u8, {
            let bir: u32 = unsafe { ::std::mem::transmute(bir) };
            bir as u64
        });
        __bindgen_bitfield_unit.set(3usize, 9u8, {
            let reserved1: u32 = unsafe { ::std::mem::transmute(reserved1) };
            reserved1 as u64
        });
        __bindgen_bitfield_unit.set(12usize, 20u8, {
            let ofst: u32 = unsafe { ::std::mem::transmute(ofst) };
            ofst as u64
        });
        __bindgen_bitfield_unit
    }
}
#[test]
fn bindgen_test_layout_spdk_nvme_cmbloc_register() {
    assert_eq!(
        ::std::mem::size_of::<spdk_nvme_cmbloc_register>(),
        4usize,
        concat!("Size of: ", stringify!(spdk_nvme_cmbloc_register))
    );
    assert_eq!(
        ::std::mem::align_of::<spdk_nvme_cmbloc_register>(),
        4usize,
        concat!("Alignment of ", stringify!(spdk_nvme_cmbloc_register))
    );
}
impl Default for spdk_nvme_cmbloc_register {
    fn default() -> Self {
        unsafe { ::std::mem::zeroed() }
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union spdk_nvme_cmbsz_register {
    pub raw: u32,
    pub bits: spdk_nvme_cmbsz_register__bindgen_ty_1,
    _bindgen_union_align: u32,
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct spdk_nvme_cmbsz_register__bindgen_ty_1 {
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 4usize], u32>,
    pub __bindgen_align: [u32; 0usize],
}
#[test]
fn bindgen_test_layout_spdk_nvme_cmbsz_register__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<spdk_nvme_cmbsz_register__bindgen_ty_1>(),
        4usize,
        concat!(
            "Size of: ",
            stringify!(spdk_nvme_cmbsz_register__bindgen_ty_1)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<spdk_nvme_cmbsz_register__bindgen_ty_1>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(spdk_nvme_cmbsz_register__bindgen_ty_1)
        )
    );
}
impl spdk_nvme_cmbsz_register__bindgen_ty_1 {
    #[inline]
    pub fn sqs(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_sqs(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn cqs(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(1usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_cqs(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(1usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn lists(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(2usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_lists(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(2usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn rds(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(3usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_rds(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(3usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn wds(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(4usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_wds(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(4usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn reserved1(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(5usize, 3u8) as u32) }
    }
    #[inline]
    pub fn set_reserved1(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(5usize, 3u8, val as u64)
        }
    }
    #[inline]
    pub fn szu(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(8usize, 4u8) as u32) }
    }
    #[inline]
    pub fn set_szu(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(8usize, 4u8, val as u64)
        }
    }
    #[inline]
    pub fn sz(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(12usize, 20u8) as u32) }
    }
    #[inline]
    pub fn set_sz(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(12usize, 20u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        sqs: u32,
        cqs: u32,
        lists: u32,
        rds: u32,
        wds: u32,
        reserved1: u32,
        szu: u32,
        sz: u32,
    ) -> __BindgenBitfieldUnit<[u8; 4usize], u32> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 4usize], u32> =
            Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let sqs: u32 = unsafe { ::std::mem::transmute(sqs) };
            sqs as u64
        });
        __bindgen_bitfield_unit.set(1usize, 1u8, {
            let cqs: u32 = unsafe { ::std::mem::transmute(cqs) };
            cqs as u64
        });
        __bindgen_bitfield_unit.set(2usize, 1u8, {
            let lists: u32 = unsafe { ::std::mem::transmute(lists) };
            lists as u64
        });
        __bindgen_bitfield_unit.set(3usize, 1u8, {
            let rds: u32 = unsafe { ::std::mem::transmute(rds) };
            rds as u64
        });
        __bindgen_bitfield_unit.set(4usize, 1u8, {
            let wds: u32 = unsafe { ::std::mem::transmute(wds) };
            wds as u64
        });
        __bindgen_bitfield_unit.set(5usize, 3u8, {
            let reserved1: u32 = unsafe { ::std::mem::transmute(reserved1) };
            reserved1 as u64
        });
        __bindgen_bitfield_unit.set(8usize, 4u8, {
            let szu: u32 = unsafe { ::std::mem::transmute(szu) };
            szu as u64
        });
        __bindgen_bitfield_unit.set(12usize, 20u8, {
            let sz: u32 = unsafe { ::std::mem::transmute(sz) };
            sz as u64
        });
        __bindgen_bitfield_unit
    }
}
#[test]
fn bindgen_test_layout_spdk_nvme_cmbsz_register() {
    assert_eq!(
        ::std::mem::size_of::<spdk_nvme_cmbsz_register>(),
        4usize,
        concat!("Size of: ", stringify!(spdk_nvme_cmbsz_register))
    );
    assert_eq!(
        ::std::mem::align_of::<spdk_nvme_cmbsz_register>(),
        4usize,
        concat!("Alignment of ", stringify!(spdk_nvme_cmbsz_register))
    );
}
impl Default for spdk_nvme_cmbsz_register {
    fn default() -> Self {
        unsafe { ::std::mem::zeroed() }
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union spdk_nvme_bpinfo_register {
    pub raw: u32,
    pub bits: spdk_nvme_bpinfo_register__bindgen_ty_1,
    _bindgen_union_align: u32,
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct spdk_nvme_bpinfo_register__bindgen_ty_1 {
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 4usize], u16>,
    pub __bindgen_align: [u32; 0usize],
}
#[test]
fn bindgen_test_layout_spdk_nvme_bpinfo_register__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<spdk_nvme_bpinfo_register__bindgen_ty_1>(),
        4usize,
        concat!(
            "Size of: ",
            stringify!(spdk_nvme_bpinfo_register__bindgen_ty_1)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<spdk_nvme_bpinfo_register__bindgen_ty_1>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(spdk_nvme_bpinfo_register__bindgen_ty_1)
        )
    );
}
impl spdk_nvme_bpinfo_register__bindgen_ty_1 {
    #[inline]
    pub fn bpsz(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 15u8) as u32) }
    }
    #[inline]
    pub fn set_bpsz(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 15u8, val as u64)
        }
    }
    #[inline]
    pub fn reserved1(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(15usize, 9u8) as u32) }
    }
    #[inline]
    pub fn set_reserved1(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(15usize, 9u8, val as u64)
        }
    }
    #[inline]
    pub fn brs(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(24usize, 2u8) as u32) }
    }
    #[inline]
    pub fn set_brs(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(24usize, 2u8, val as u64)
        }
    }
    #[inline]
    pub fn reserved2(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(26usize, 5u8) as u32) }
    }
    #[inline]
    pub fn set_reserved2(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(26usize, 5u8, val as u64)
        }
    }
    #[inline]
    pub fn abpid(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(31usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_abpid(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(31usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        bpsz: u32,
        reserved1: u32,
        brs: u32,
        reserved2: u32,
        abpid: u32,
    ) -> __BindgenBitfieldUnit<[u8; 4usize], u16> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 4usize], u16> =
            Default::default();
        __bindgen_bitfield_unit.set(0usize, 15u8, {
            let bpsz: u32 = unsafe { ::std::mem::transmute(bpsz) };
            bpsz as u64
        });
        __bindgen_bitfield_unit.set(15usize, 9u8, {
            let reserved1: u32 = unsafe { ::std::mem::transmute(reserved1) };
            reserved1 as u64
        });
        __bindgen_bitfield_unit.set(24usize, 2u8, {
            let brs: u32 = unsafe { ::std::mem::transmute(brs) };
            brs as u64
        });
        __bindgen_bitfield_unit.set(26usize, 5u8, {
            let reserved2: u32 = unsafe { ::std::mem::transmute(reserved2) };
            reserved2 as u64
        });
        __bindgen_bitfield_unit.set(31usize, 1u8, {
            let abpid: u32 = unsafe { ::std::mem::transmute(abpid) };
            abpid as u64
        });
        __bindgen_bitfield_unit
    }
}
#[test]
fn bindgen_test_layout_spdk_nvme_bpinfo_register() {
    assert_eq!(
        ::std::mem::size_of::<spdk_nvme_bpinfo_register>(),
        4usize,
        concat!("Size of: ", stringify!(spdk_nvme_bpinfo_register))
    );
    assert_eq!(
        ::std::mem::align_of::<spdk_nvme_bpinfo_register>(),
        4usize,
        concat!("Alignment of ", stringify!(spdk_nvme_bpinfo_register))
    );
}
impl Default for spdk_nvme_bpinfo_register {
    fn default() -> Self {
        unsafe { ::std::mem::zeroed() }
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union spdk_nvme_bprsel_register {
    pub raw: u32,
    pub bits: spdk_nvme_bprsel_register__bindgen_ty_1,
    _bindgen_union_align: u32,
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct spdk_nvme_bprsel_register__bindgen_ty_1 {
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 4usize], u32>,
    pub __bindgen_align: [u32; 0usize],
}
#[test]
fn bindgen_test_layout_spdk_nvme_bprsel_register__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<spdk_nvme_bprsel_register__bindgen_ty_1>(),
        4usize,
        concat!(
            "Size of: ",
            stringify!(spdk_nvme_bprsel_register__bindgen_ty_1)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<spdk_nvme_bprsel_register__bindgen_ty_1>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(spdk_nvme_bprsel_register__bindgen_ty_1)
        )
    );
}
impl spdk_nvme_bprsel_register__bindgen_ty_1 {
    #[inline]
    pub fn bprsz(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 10u8) as u32) }
    }
    #[inline]
    pub fn set_bprsz(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 10u8, val as u64)
        }
    }
    #[inline]
    pub fn bprof(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(10usize, 20u8) as u32) }
    }
    #[inline]
    pub fn set_bprof(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(10usize, 20u8, val as u64)
        }
    }
    #[inline]
    pub fn reserved(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(30usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_reserved(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(30usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bpid(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(31usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_bpid(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(31usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        bprsz: u32,
        bprof: u32,
        reserved: u32,
        bpid: u32,
    ) -> __BindgenBitfieldUnit<[u8; 4usize], u32> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 4usize], u32> =
            Default::default();
        __bindgen_bitfield_unit.set(0usize, 10u8, {
            let bprsz: u32 = unsafe { ::std::mem::transmute(bprsz) };
            bprsz as u64
        });
        __bindgen_bitfield_unit.set(10usize, 20u8, {
            let bprof: u32 = unsafe { ::std::mem::transmute(bprof) };
            bprof as u64
        });
        __bindgen_bitfield_unit.set(30usize, 1u8, {
            let reserved: u32 = unsafe { ::std::mem::transmute(reserved) };
            reserved as u64
        });
        __bindgen_bitfield_unit.set(31usize, 1u8, {
            let bpid: u32 = unsafe { ::std::mem::transmute(bpid) };
            bpid as u64
        });
        __bindgen_bitfield_unit
    }
}
#[test]
fn bindgen_test_layout_spdk_nvme_bprsel_register() {
    assert_eq!(
        ::std::mem::size_of::<spdk_nvme_bprsel_register>(),
        4usize,
        concat!("Size of: ", stringify!(spdk_nvme_bprsel_register))
    );
    assert_eq!(
        ::std::mem::align_of::<spdk_nvme_bprsel_register>(),
        4usize,
        concat!("Alignment of ", stringify!(spdk_nvme_bprsel_register))
    );
}
impl Default for spdk_nvme_bprsel_register {
    fn default() -> Self {
        unsafe { ::std::mem::zeroed() }
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct spdk_nvme_registers {
    pub cap: spdk_nvme_cap_register,
    pub vs: spdk_nvme_vs_register,
    pub intms: u32,
    pub intmc: u32,
    pub cc: spdk_nvme_cc_register,
    pub reserved1: u32,
    pub csts: spdk_nvme_csts_register,
    pub nssr: u32,
    pub aqa: spdk_nvme_aqa_register,
    pub asq: u64,
    pub acq: u64,
    pub cmbloc: spdk_nvme_cmbloc_register,
    pub cmbsz: spdk_nvme_cmbsz_register,
    pub bpinfo: spdk_nvme_bpinfo_register,
    pub bprsel: spdk_nvme_bprsel_register,
    pub bpmbl: u64,
    pub reserved3: [u32; 1004usize],
    pub doorbell: [spdk_nvme_registers__bindgen_ty_1; 1usize],
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct spdk_nvme_registers__bindgen_ty_1 {
    pub sq_tdbl: u32,
    pub cq_hdbl: u32,
}
#[test]
fn bindgen_test_layout_spdk_nvme_registers__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<spdk_nvme_registers__bindgen_ty_1>(),
        8usize,
        concat!("Size of: ", stringify!(spdk_nvme_registers__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<spdk_nvme_registers__bindgen_ty_1>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(spdk_nvme_registers__bindgen_ty_1)
        )
    );
}
#[test]
fn bindgen_test_layout_spdk_nvme_registers() {
    assert_eq!(
        ::std::mem::size_of::<spdk_nvme_registers>(),
        4104usize,
        concat!("Size of: ", stringify!(spdk_nvme_registers))
    );
    assert_eq!(
        ::std::mem::align_of::<spdk_nvme_registers>(),
        8usize,
        concat!("Alignment of ", stringify!(spdk_nvme_registers))
    );
}
impl Default for spdk_nvme_registers {
    fn default() -> Self {
        unsafe { ::std::mem::zeroed() }
    }
}
pub const spdk_nvme_sgl_descriptor_type_SPDK_NVME_SGL_TYPE_DATA_BLOCK:
    spdk_nvme_sgl_descriptor_type = 0;
pub const spdk_nvme_sgl_descriptor_type_SPDK_NVME_SGL_TYPE_BIT_BUCKET:
    spdk_nvme_sgl_descriptor_type = 1;
pub const spdk_nvme_sgl_descriptor_type_SPDK_NVME_SGL_TYPE_SEGMENT: spdk_nvme_sgl_descriptor_type =
    2;
pub const spdk_nvme_sgl_descriptor_type_SPDK_NVME_SGL_TYPE_LAST_SEGMENT:
    spdk_nvme_sgl_descriptor_type = 3;
pub const spdk_nvme_sgl_descriptor_type_SPDK_NVME_SGL_TYPE_KEYED_DATA_BLOCK:
    spdk_nvme_sgl_descriptor_type = 4;
pub const spdk_nvme_sgl_descriptor_type_SPDK_NVME_SGL_TYPE_TRANSPORT_DATA_BLOCK:
    spdk_nvme_sgl_descriptor_type = 5;
pub const spdk_nvme_sgl_descriptor_type_SPDK_NVME_SGL_TYPE_VENDOR_SPECIFIC:
    spdk_nvme_sgl_descriptor_type = 15;
pub type spdk_nvme_sgl_descriptor_type = u32;
pub const spdk_nvme_sgl_descriptor_subtype_SPDK_NVME_SGL_SUBTYPE_ADDRESS:
    spdk_nvme_sgl_descriptor_subtype = 0;
pub const spdk_nvme_sgl_descriptor_subtype_SPDK_NVME_SGL_SUBTYPE_OFFSET:
    spdk_nvme_sgl_descriptor_subtype = 1;
pub type spdk_nvme_sgl_descriptor_subtype = u32;
#[repr(C, packed)]
#[derive(Copy, Clone)]
pub struct spdk_nvme_sgl_descriptor {
    pub address: u64,
    pub __bindgen_anon_1: spdk_nvme_sgl_descriptor__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union spdk_nvme_sgl_descriptor__bindgen_ty_1 {
    pub generic: spdk_nvme_sgl_descriptor__bindgen_ty_1__bindgen_ty_1,
    pub unkeyed: spdk_nvme_sgl_descriptor__bindgen_ty_1__bindgen_ty_2,
    pub keyed: spdk_nvme_sgl_descriptor__bindgen_ty_1__bindgen_ty_3,
    _bindgen_union_align: u64,
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct spdk_nvme_sgl_descriptor__bindgen_ty_1__bindgen_ty_1 {
    pub reserved: [u8; 7usize],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 1usize], u8>,
}
#[test]
fn bindgen_test_layout_spdk_nvme_sgl_descriptor__bindgen_ty_1__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<spdk_nvme_sgl_descriptor__bindgen_ty_1__bindgen_ty_1>(),
        8usize,
        concat!(
            "Size of: ",
            stringify!(spdk_nvme_sgl_descriptor__bindgen_ty_1__bindgen_ty_1)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<spdk_nvme_sgl_descriptor__bindgen_ty_1__bindgen_ty_1>(),
        1usize,
        concat!(
            "Alignment of ",
            stringify!(spdk_nvme_sgl_descriptor__bindgen_ty_1__bindgen_ty_1)
        )
    );
}
impl spdk_nvme_sgl_descriptor__bindgen_ty_1__bindgen_ty_1 {
    #[inline]
    pub fn subtype(&self) -> u8 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 4u8) as u8) }
    }
    #[inline]
    pub fn set_subtype(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 4u8, val as u64)
        }
    }
    #[inline]
    pub fn type_(&self) -> u8 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(4usize, 4u8) as u8) }
    }
    #[inline]
    pub fn set_type(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::std::mem::transmute(val);
            self._bitfield_1.set(4usize, 4u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(subtype: u8, type_: u8) -> __BindgenBitfieldUnit<[u8; 1usize], u8> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize], u8> =
            Default::default();
        __bindgen_bitfield_unit.set(0usize, 4u8, {
            let subtype: u8 = unsafe { ::std::mem::transmute(subtype) };
            subtype as u64
        });
        __bindgen_bitfield_unit.set(4usize, 4u8, {
            let type_: u8 = unsafe { ::std::mem::transmute(type_) };
            type_ as u64
        });
        __bindgen_bitfield_unit
    }
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct spdk_nvme_sgl_descriptor__bindgen_ty_1__bindgen_ty_2 {
    pub length: u32,
    pub reserved: [u8; 3usize],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 1usize], u8>,
}
#[test]
fn bindgen_test_layout_spdk_nvme_sgl_descriptor__bindgen_ty_1__bindgen_ty_2() {
    assert_eq!(
        ::std::mem::size_of::<spdk_nvme_sgl_descriptor__bindgen_ty_1__bindgen_ty_2>(),
        8usize,
        concat!(
            "Size of: ",
            stringify!(spdk_nvme_sgl_descriptor__bindgen_ty_1__bindgen_ty_2)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<spdk_nvme_sgl_descriptor__bindgen_ty_1__bindgen_ty_2>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(spdk_nvme_sgl_descriptor__bindgen_ty_1__bindgen_ty_2)
        )
    );
}
impl spdk_nvme_sgl_descriptor__bindgen_ty_1__bindgen_ty_2 {
    #[inline]
    pub fn subtype(&self) -> u8 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 4u8) as u8) }
    }
    #[inline]
    pub fn set_subtype(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 4u8, val as u64)
        }
    }
    #[inline]
    pub fn type_(&self) -> u8 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(4usize, 4u8) as u8) }
    }
    #[inline]
    pub fn set_type(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::std::mem::transmute(val);
            self._bitfield_1.set(4usize, 4u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(subtype: u8, type_: u8) -> __BindgenBitfieldUnit<[u8; 1usize], u8> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize], u8> =
            Default::default();
        __bindgen_bitfield_unit.set(0usize, 4u8, {
            let subtype: u8 = unsafe { ::std::mem::transmute(subtype) };
            subtype as u64
        });
        __bindgen_bitfield_unit.set(4usize, 4u8, {
            let type_: u8 = unsafe { ::std::mem::transmute(type_) };
            type_ as u64
        });
        __bindgen_bitfield_unit
    }
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct spdk_nvme_sgl_descriptor__bindgen_ty_1__bindgen_ty_3 {
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 8usize], u32>,
    pub __bindgen_align: [u64; 0usize],
}
#[test]
fn bindgen_test_layout_spdk_nvme_sgl_descriptor__bindgen_ty_1__bindgen_ty_3() {
    assert_eq!(
        ::std::mem::size_of::<spdk_nvme_sgl_descriptor__bindgen_ty_1__bindgen_ty_3>(),
        8usize,
        concat!(
            "Size of: ",
            stringify!(spdk_nvme_sgl_descriptor__bindgen_ty_1__bindgen_ty_3)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<spdk_nvme_sgl_descriptor__bindgen_ty_1__bindgen_ty_3>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(spdk_nvme_sgl_descriptor__bindgen_ty_1__bindgen_ty_3)
        )
    );
}
impl spdk_nvme_sgl_descriptor__bindgen_ty_1__bindgen_ty_3 {
    #[inline]
    pub fn length(&self) -> u64 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 24u8) as u64) }
    }
    #[inline]
    pub fn set_length(&mut self, val: u64) {
        unsafe {
            let val: u64 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 24u8, val as u64)
        }
    }
    #[inline]
    pub fn key(&self) -> u64 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(24usize, 32u8) as u64) }
    }
    #[inline]
    pub fn set_key(&mut self, val: u64) {
        unsafe {
            let val: u64 = ::std::mem::transmute(val);
            self._bitfield_1.set(24usize, 32u8, val as u64)
        }
    }
    #[inline]
    pub fn subtype(&self) -> u64 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(56usize, 4u8) as u64) }
    }
    #[inline]
    pub fn set_subtype(&mut self, val: u64) {
        unsafe {
            let val: u64 = ::std::mem::transmute(val);
            self._bitfield_1.set(56usize, 4u8, val as u64)
        }
    }
    #[inline]
    pub fn type_(&self) -> u64 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(60usize, 4u8) as u64) }
    }
    #[inline]
    pub fn set_type(&mut self, val: u64) {
        unsafe {
            let val: u64 = ::std::mem::transmute(val);
            self._bitfield_1.set(60usize, 4u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        length: u64,
        key: u64,
        subtype: u64,
        type_: u64,
    ) -> __BindgenBitfieldUnit<[u8; 8usize], u32> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 8usize], u32> =
            Default::default();
        __bindgen_bitfield_unit.set(0usize, 24u8, {
            let length: u64 = unsafe { ::std::mem::transmute(length) };
            length as u64
        });
        __bindgen_bitfield_unit.set(24usize, 32u8, {
            let key: u64 = unsafe { ::std::mem::transmute(key) };
            key as u64
        });
        __bindgen_bitfield_unit.set(56usize, 4u8, {
            let subtype: u64 = unsafe { ::std::mem::transmute(subtype) };
            subtype as u64
        });
        __bindgen_bitfield_unit.set(60usize, 4u8, {
            let type_: u64 = unsafe { ::std::mem::transmute(type_) };
            type_ as u64
        });
        __bindgen_bitfield_unit
    }
}
#[test]
fn bindgen_test_layout_spdk_nvme_sgl_descriptor__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<spdk_nvme_sgl_descriptor__bindgen_ty_1>(),
        8usize,
        concat!(
            "Size of: ",
            stringify!(spdk_nvme_sgl_descriptor__bindgen_ty_1)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<spdk_nvme_sgl_descriptor__bindgen_ty_1>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(spdk_nvme_sgl_descriptor__bindgen_ty_1)
        )
    );
}
impl Default for spdk_nvme_sgl_descriptor__bindgen_ty_1 {
    fn default() -> Self {
        unsafe { ::std::mem::zeroed() }
    }
}
#[test]
fn bindgen_test_layout_spdk_nvme_sgl_descriptor() {
    assert_eq!(
        ::std::mem::size_of::<spdk_nvme_sgl_descriptor>(),
        16usize,
        concat!("Size of: ", stringify!(spdk_nvme_sgl_descriptor))
    );
    assert_eq!(
        ::std::mem::align_of::<spdk_nvme_sgl_descriptor>(),
        1usize,
        concat!("Alignment of ", stringify!(spdk_nvme_sgl_descriptor))
    );
}
impl Default for spdk_nvme_sgl_descriptor {
    fn default() -> Self {
        unsafe { ::std::mem::zeroed() }
    }
}
pub const spdk_nvme_psdt_value_SPDK_NVME_PSDT_PRP: spdk_nvme_psdt_value = 0;
pub const spdk_nvme_psdt_value_SPDK_NVME_PSDT_SGL_MPTR_CONTIG: spdk_nvme_psdt_value = 1;
pub const spdk_nvme_psdt_value_SPDK_NVME_PSDT_SGL_MPTR_SGL: spdk_nvme_psdt_value = 2;
pub const spdk_nvme_psdt_value_SPDK_NVME_PSDT_RESERVED: spdk_nvme_psdt_value = 3;
pub type spdk_nvme_psdt_value = u32;
pub const spdk_nvme_qprio_SPDK_NVME_QPRIO_URGENT: spdk_nvme_qprio = 0;
pub const spdk_nvme_qprio_SPDK_NVME_QPRIO_HIGH: spdk_nvme_qprio = 1;
pub const spdk_nvme_qprio_SPDK_NVME_QPRIO_MEDIUM: spdk_nvme_qprio = 2;
pub const spdk_nvme_qprio_SPDK_NVME_QPRIO_LOW: spdk_nvme_qprio = 3;
pub type spdk_nvme_qprio = u32;
pub const spdk_nvme_cap_ams_SPDK_NVME_CAP_AMS_WRR: spdk_nvme_cap_ams = 1;
pub const spdk_nvme_cap_ams_SPDK_NVME_CAP_AMS_VS: spdk_nvme_cap_ams = 2;
pub type spdk_nvme_cap_ams = u32;
pub const spdk_nvme_cc_ams_SPDK_NVME_CC_AMS_RR: spdk_nvme_cc_ams = 0;
pub const spdk_nvme_cc_ams_SPDK_NVME_CC_AMS_WRR: spdk_nvme_cc_ams = 1;
pub const spdk_nvme_cc_ams_SPDK_NVME_CC_AMS_VS: spdk_nvme_cc_ams = 7;
pub type spdk_nvme_cc_ams = u32;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct spdk_nvme_cmd {
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 2usize], u8>,
    pub cid: u16,
    pub nsid: u32,
    pub rsvd2: u32,
    pub rsvd3: u32,
    pub mptr: u64,
    pub dptr: spdk_nvme_cmd__bindgen_ty_1,
    pub cdw10: u32,
    pub cdw11: u32,
    pub cdw12: u32,
    pub cdw13: u32,
    pub cdw14: u32,
    pub cdw15: u32,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union spdk_nvme_cmd__bindgen_ty_1 {
    pub prp: spdk_nvme_cmd__bindgen_ty_1__bindgen_ty_1,
    pub sgl1: spdk_nvme_sgl_descriptor,
    _bindgen_union_align: [u64; 2usize],
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct spdk_nvme_cmd__bindgen_ty_1__bindgen_ty_1 {
    pub prp1: u64,
    pub prp2: u64,
}
#[test]
fn bindgen_test_layout_spdk_nvme_cmd__bindgen_ty_1__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<spdk_nvme_cmd__bindgen_ty_1__bindgen_ty_1>(),
        16usize,
        concat!(
            "Size of: ",
            stringify!(spdk_nvme_cmd__bindgen_ty_1__bindgen_ty_1)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<spdk_nvme_cmd__bindgen_ty_1__bindgen_ty_1>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(spdk_nvme_cmd__bindgen_ty_1__bindgen_ty_1)
        )
    );
}
#[test]
fn bindgen_test_layout_spdk_nvme_cmd__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<spdk_nvme_cmd__bindgen_ty_1>(),
        16usize,
        concat!("Size of: ", stringify!(spdk_nvme_cmd__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<spdk_nvme_cmd__bindgen_ty_1>(),
        8usize,
        concat!("Alignment of ", stringify!(spdk_nvme_cmd__bindgen_ty_1))
    );
}
impl Default for spdk_nvme_cmd__bindgen_ty_1 {
    fn default() -> Self {
        unsafe { ::std::mem::zeroed() }
    }
}
#[test]
fn bindgen_test_layout_spdk_nvme_cmd() {
    assert_eq!(
        ::std::mem::size_of::<spdk_nvme_cmd>(),
        64usize,
        concat!("Size of: ", stringify!(spdk_nvme_cmd))
    );
    assert_eq!(
        ::std::mem::align_of::<spdk_nvme_cmd>(),
        8usize,
        concat!("Alignment of ", stringify!(spdk_nvme_cmd))
    );
}
impl Default for spdk_nvme_cmd {
    fn default() -> Self {
        unsafe { ::std::mem::zeroed() }
    }
}
impl spdk_nvme_cmd {
    #[inline]
    pub fn opc(&self) -> u16 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 8u8) as u16) }
    }
    #[inline]
    pub fn set_opc(&mut self, val: u16) {
        unsafe {
            let val: u16 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 8u8, val as u64)
        }
    }
    #[inline]
    pub fn fuse(&self) -> u16 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(8usize, 2u8) as u16) }
    }
    #[inline]
    pub fn set_fuse(&mut self, val: u16) {
        unsafe {
            let val: u16 = ::std::mem::transmute(val);
            self._bitfield_1.set(8usize, 2u8, val as u64)
        }
    }
    #[inline]
    pub fn rsvd1(&self) -> u16 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(10usize, 4u8) as u16) }
    }
    #[inline]
    pub fn set_rsvd1(&mut self, val: u16) {
        unsafe {
            let val: u16 = ::std::mem::transmute(val);
            self._bitfield_1.set(10usize, 4u8, val as u64)
        }
    }
    #[inline]
    pub fn psdt(&self) -> u16 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(14usize, 2u8) as u16) }
    }
    #[inline]
    pub fn set_psdt(&mut self, val: u16) {
        unsafe {
            let val: u16 = ::std::mem::transmute(val);
            self._bitfield_1.set(14usize, 2u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        opc: u16,
        fuse: u16,
        rsvd1: u16,
        psdt: u16,
    ) -> __BindgenBitfieldUnit<[u8; 2usize], u8> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 2usize], u8> =
            Default::default();
        __bindgen_bitfield_unit.set(0usize, 8u8, {
            let opc: u16 = unsafe { ::std::mem::transmute(opc) };
            opc as u64
        });
        __bindgen_bitfield_unit.set(8usize, 2u8, {
            let fuse: u16 = unsafe { ::std::mem::transmute(fuse) };
            fuse as u64
        });
        __bindgen_bitfield_unit.set(10usize, 4u8, {
            let rsvd1: u16 = unsafe { ::std::mem::transmute(rsvd1) };
            rsvd1 as u64
        });
        __bindgen_bitfield_unit.set(14usize, 2u8, {
            let psdt: u16 = unsafe { ::std::mem::transmute(psdt) };
            psdt as u64
        });
        __bindgen_bitfield_unit
    }
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct spdk_nvme_status {
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 2usize], u8>,
    pub __bindgen_align: [u16; 0usize],
}
#[test]
fn bindgen_test_layout_spdk_nvme_status() {
    assert_eq!(
        ::std::mem::size_of::<spdk_nvme_status>(),
        2usize,
        concat!("Size of: ", stringify!(spdk_nvme_status))
    );
    assert_eq!(
        ::std::mem::align_of::<spdk_nvme_status>(),
        2usize,
        concat!("Alignment of ", stringify!(spdk_nvme_status))
    );
}
impl spdk_nvme_status {
    #[inline]
    pub fn p(&self) -> u16 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set_p(&mut self, val: u16) {
        unsafe {
            let val: u16 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn sc(&self) -> u16 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(1usize, 8u8) as u16) }
    }
    #[inline]
    pub fn set_sc(&mut self, val: u16) {
        unsafe {
            let val: u16 = ::std::mem::transmute(val);
            self._bitfield_1.set(1usize, 8u8, val as u64)
        }
    }
    #[inline]
    pub fn sct(&self) -> u16 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(9usize, 3u8) as u16) }
    }
    #[inline]
    pub fn set_sct(&mut self, val: u16) {
        unsafe {
            let val: u16 = ::std::mem::transmute(val);
            self._bitfield_1.set(9usize, 3u8, val as u64)
        }
    }
    #[inline]
    pub fn rsvd2(&self) -> u16 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(12usize, 2u8) as u16) }
    }
    #[inline]
    pub fn set_rsvd2(&mut self, val: u16) {
        unsafe {
            let val: u16 = ::std::mem::transmute(val);
            self._bitfield_1.set(12usize, 2u8, val as u64)
        }
    }
    #[inline]
    pub fn m(&self) -> u16 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(14usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set_m(&mut self, val: u16) {
        unsafe {
            let val: u16 = ::std::mem::transmute(val);
            self._bitfield_1.set(14usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn dnr(&self) -> u16 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(15usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set_dnr(&mut self, val: u16) {
        unsafe {
            let val: u16 = ::std::mem::transmute(val);
            self._bitfield_1.set(15usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        p: u16,
        sc: u16,
        sct: u16,
        rsvd2: u16,
        m: u16,
        dnr: u16,
    ) -> __BindgenBitfieldUnit<[u8; 2usize], u8> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 2usize], u8> =
            Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let p: u16 = unsafe { ::std::mem::transmute(p) };
            p as u64
        });
        __bindgen_bitfield_unit.set(1usize, 8u8, {
            let sc: u16 = unsafe { ::std::mem::transmute(sc) };
            sc as u64
        });
        __bindgen_bitfield_unit.set(9usize, 3u8, {
            let sct: u16 = unsafe { ::std::mem::transmute(sct) };
            sct as u64
        });
        __bindgen_bitfield_unit.set(12usize, 2u8, {
            let rsvd2: u16 = unsafe { ::std::mem::transmute(rsvd2) };
            rsvd2 as u64
        });
        __bindgen_bitfield_unit.set(14usize, 1u8, {
            let m: u16 = unsafe { ::std::mem::transmute(m) };
            m as u64
        });
        __bindgen_bitfield_unit.set(15usize, 1u8, {
            let dnr: u16 = unsafe { ::std::mem::transmute(dnr) };
            dnr as u64
        });
        __bindgen_bitfield_unit
    }
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct spdk_nvme_cpl {
    pub cdw0: u32,
    pub rsvd1: u32,
    pub sqhd: u16,
    pub sqid: u16,
    pub cid: u16,
    pub status: spdk_nvme_status,
}
#[test]
fn bindgen_test_layout_spdk_nvme_cpl() {
    assert_eq!(
        ::std::mem::size_of::<spdk_nvme_cpl>(),
        16usize,
        concat!("Size of: ", stringify!(spdk_nvme_cpl))
    );
    assert_eq!(
        ::std::mem::align_of::<spdk_nvme_cpl>(),
        4usize,
        concat!("Alignment of ", stringify!(spdk_nvme_cpl))
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct spdk_nvme_dsm_range {
    pub attributes: spdk_nvme_dsm_range__bindgen_ty_1,
    pub length: u32,
    pub starting_lba: u64,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union spdk_nvme_dsm_range__bindgen_ty_1 {
    pub bits: spdk_nvme_dsm_range__bindgen_ty_1__bindgen_ty_1,
    pub raw: u32,
    _bindgen_union_align: u32,
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct spdk_nvme_dsm_range__bindgen_ty_1__bindgen_ty_1 {
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 4usize], u16>,
    pub __bindgen_align: [u32; 0usize],
}
#[test]
fn bindgen_test_layout_spdk_nvme_dsm_range__bindgen_ty_1__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<spdk_nvme_dsm_range__bindgen_ty_1__bindgen_ty_1>(),
        4usize,
        concat!(
            "Size of: ",
            stringify!(spdk_nvme_dsm_range__bindgen_ty_1__bindgen_ty_1)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<spdk_nvme_dsm_range__bindgen_ty_1__bindgen_ty_1>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(spdk_nvme_dsm_range__bindgen_ty_1__bindgen_ty_1)
        )
    );
}
impl spdk_nvme_dsm_range__bindgen_ty_1__bindgen_ty_1 {
    #[inline]
    pub fn af(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 4u8) as u32) }
    }
    #[inline]
    pub fn set_af(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 4u8, val as u64)
        }
    }
    #[inline]
    pub fn al(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(4usize, 2u8) as u32) }
    }
    #[inline]
    pub fn set_al(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(4usize, 2u8, val as u64)
        }
    }
    #[inline]
    pub fn reserved0(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(6usize, 2u8) as u32) }
    }
    #[inline]
    pub fn set_reserved0(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(6usize, 2u8, val as u64)
        }
    }
    #[inline]
    pub fn sr(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(8usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_sr(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(8usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn sw(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(9usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_sw(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(9usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn wp(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(10usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_wp(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(10usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn reserved1(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(11usize, 13u8) as u32) }
    }
    #[inline]
    pub fn set_reserved1(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(11usize, 13u8, val as u64)
        }
    }
    #[inline]
    pub fn access_size(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(24usize, 8u8) as u32) }
    }
    #[inline]
    pub fn set_access_size(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(24usize, 8u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        af: u32,
        al: u32,
        reserved0: u32,
        sr: u32,
        sw: u32,
        wp: u32,
        reserved1: u32,
        access_size: u32,
    ) -> __BindgenBitfieldUnit<[u8; 4usize], u16> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 4usize], u16> =
            Default::default();
        __bindgen_bitfield_unit.set(0usize, 4u8, {
            let af: u32 = unsafe { ::std::mem::transmute(af) };
            af as u64
        });
        __bindgen_bitfield_unit.set(4usize, 2u8, {
            let al: u32 = unsafe { ::std::mem::transmute(al) };
            al as u64
        });
        __bindgen_bitfield_unit.set(6usize, 2u8, {
            let reserved0: u32 = unsafe { ::std::mem::transmute(reserved0) };
            reserved0 as u64
        });
        __bindgen_bitfield_unit.set(8usize, 1u8, {
            let sr: u32 = unsafe { ::std::mem::transmute(sr) };
            sr as u64
        });
        __bindgen_bitfield_unit.set(9usize, 1u8, {
            let sw: u32 = unsafe { ::std::mem::transmute(sw) };
            sw as u64
        });
        __bindgen_bitfield_unit.set(10usize, 1u8, {
            let wp: u32 = unsafe { ::std::mem::transmute(wp) };
            wp as u64
        });
        __bindgen_bitfield_unit.set(11usize, 13u8, {
            let reserved1: u32 = unsafe { ::std::mem::transmute(reserved1) };
            reserved1 as u64
        });
        __bindgen_bitfield_unit.set(24usize, 8u8, {
            let access_size: u32 = unsafe { ::std::mem::transmute(access_size) };
            access_size as u64
        });
        __bindgen_bitfield_unit
    }
}
#[test]
fn bindgen_test_layout_spdk_nvme_dsm_range__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<spdk_nvme_dsm_range__bindgen_ty_1>(),
        4usize,
        concat!("Size of: ", stringify!(spdk_nvme_dsm_range__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<spdk_nvme_dsm_range__bindgen_ty_1>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(spdk_nvme_dsm_range__bindgen_ty_1)
        )
    );
}
impl Default for spdk_nvme_dsm_range__bindgen_ty_1 {
    fn default() -> Self {
        unsafe { ::std::mem::zeroed() }
    }
}
#[test]
fn bindgen_test_layout_spdk_nvme_dsm_range() {
    assert_eq!(
        ::std::mem::size_of::<spdk_nvme_dsm_range>(),
        16usize,
        concat!("Size of: ", stringify!(spdk_nvme_dsm_range))
    );
    assert_eq!(
        ::std::mem::align_of::<spdk_nvme_dsm_range>(),
        8usize,
        concat!("Alignment of ", stringify!(spdk_nvme_dsm_range))
    );
}
impl Default for spdk_nvme_dsm_range {
    fn default() -> Self {
        unsafe { ::std::mem::zeroed() }
    }
}
pub const spdk_nvme_status_code_type_SPDK_NVME_SCT_GENERIC: spdk_nvme_status_code_type = 0;
pub const spdk_nvme_status_code_type_SPDK_NVME_SCT_COMMAND_SPECIFIC: spdk_nvme_status_code_type = 1;
pub const spdk_nvme_status_code_type_SPDK_NVME_SCT_MEDIA_ERROR: spdk_nvme_status_code_type = 2;
pub const spdk_nvme_status_code_type_SPDK_NVME_SCT_PATH: spdk_nvme_status_code_type = 3;
pub const spdk_nvme_status_code_type_SPDK_NVME_SCT_VENDOR_SPECIFIC: spdk_nvme_status_code_type = 7;
pub type spdk_nvme_status_code_type = u32;
pub const spdk_nvme_generic_command_status_code_SPDK_NVME_SC_SUCCESS:
    spdk_nvme_generic_command_status_code = 0;
pub const spdk_nvme_generic_command_status_code_SPDK_NVME_SC_INVALID_OPCODE:
    spdk_nvme_generic_command_status_code = 1;
pub const spdk_nvme_generic_command_status_code_SPDK_NVME_SC_INVALID_FIELD:
    spdk_nvme_generic_command_status_code = 2;
pub const spdk_nvme_generic_command_status_code_SPDK_NVME_SC_COMMAND_ID_CONFLICT:
    spdk_nvme_generic_command_status_code = 3;
pub const spdk_nvme_generic_command_status_code_SPDK_NVME_SC_DATA_TRANSFER_ERROR:
    spdk_nvme_generic_command_status_code = 4;
pub const spdk_nvme_generic_command_status_code_SPDK_NVME_SC_ABORTED_POWER_LOSS:
    spdk_nvme_generic_command_status_code = 5;
pub const spdk_nvme_generic_command_status_code_SPDK_NVME_SC_INTERNAL_DEVICE_ERROR:
    spdk_nvme_generic_command_status_code = 6;
pub const spdk_nvme_generic_command_status_code_SPDK_NVME_SC_ABORTED_BY_REQUEST:
    spdk_nvme_generic_command_status_code = 7;
pub const spdk_nvme_generic_command_status_code_SPDK_NVME_SC_ABORTED_SQ_DELETION:
    spdk_nvme_generic_command_status_code = 8;
pub const spdk_nvme_generic_command_status_code_SPDK_NVME_SC_ABORTED_FAILED_FUSED:
    spdk_nvme_generic_command_status_code = 9;
pub const spdk_nvme_generic_command_status_code_SPDK_NVME_SC_ABORTED_MISSING_FUSED:
    spdk_nvme_generic_command_status_code = 10;
pub const spdk_nvme_generic_command_status_code_SPDK_NVME_SC_INVALID_NAMESPACE_OR_FORMAT:
    spdk_nvme_generic_command_status_code = 11;
pub const spdk_nvme_generic_command_status_code_SPDK_NVME_SC_COMMAND_SEQUENCE_ERROR:
    spdk_nvme_generic_command_status_code = 12;
pub const spdk_nvme_generic_command_status_code_SPDK_NVME_SC_INVALID_SGL_SEG_DESCRIPTOR:
    spdk_nvme_generic_command_status_code = 13;
pub const spdk_nvme_generic_command_status_code_SPDK_NVME_SC_INVALID_NUM_SGL_DESCIRPTORS:
    spdk_nvme_generic_command_status_code = 14;
pub const spdk_nvme_generic_command_status_code_SPDK_NVME_SC_DATA_SGL_LENGTH_INVALID:
    spdk_nvme_generic_command_status_code = 15;
pub const spdk_nvme_generic_command_status_code_SPDK_NVME_SC_METADATA_SGL_LENGTH_INVALID:
    spdk_nvme_generic_command_status_code = 16;
pub const spdk_nvme_generic_command_status_code_SPDK_NVME_SC_SGL_DESCRIPTOR_TYPE_INVALID:
    spdk_nvme_generic_command_status_code = 17;
pub const spdk_nvme_generic_command_status_code_SPDK_NVME_SC_INVALID_CONTROLLER_MEM_BUF:
    spdk_nvme_generic_command_status_code = 18;
pub const spdk_nvme_generic_command_status_code_SPDK_NVME_SC_INVALID_PRP_OFFSET:
    spdk_nvme_generic_command_status_code = 19;
pub const spdk_nvme_generic_command_status_code_SPDK_NVME_SC_ATOMIC_WRITE_UNIT_EXCEEDED:
    spdk_nvme_generic_command_status_code = 20;
pub const spdk_nvme_generic_command_status_code_SPDK_NVME_SC_OPERATION_DENIED:
    spdk_nvme_generic_command_status_code = 21;
pub const spdk_nvme_generic_command_status_code_SPDK_NVME_SC_INVALID_SGL_OFFSET:
    spdk_nvme_generic_command_status_code = 22;
pub const spdk_nvme_generic_command_status_code_SPDK_NVME_SC_HOSTID_INCONSISTENT_FORMAT:
    spdk_nvme_generic_command_status_code = 24;
pub const spdk_nvme_generic_command_status_code_SPDK_NVME_SC_KEEP_ALIVE_EXPIRED:
    spdk_nvme_generic_command_status_code = 25;
pub const spdk_nvme_generic_command_status_code_SPDK_NVME_SC_KEEP_ALIVE_INVALID:
    spdk_nvme_generic_command_status_code = 26;
pub const spdk_nvme_generic_command_status_code_SPDK_NVME_SC_ABORTED_PREEMPT:
    spdk_nvme_generic_command_status_code = 27;
pub const spdk_nvme_generic_command_status_code_SPDK_NVME_SC_SANITIZE_FAILED:
    spdk_nvme_generic_command_status_code = 28;
pub const spdk_nvme_generic_command_status_code_SPDK_NVME_SC_SANITIZE_IN_PROGRESS:
    spdk_nvme_generic_command_status_code = 29;
pub const spdk_nvme_generic_command_status_code_SPDK_NVME_SC_SGL_DATA_BLOCK_GRANULARITY_INVALID:
    spdk_nvme_generic_command_status_code = 30;
pub const spdk_nvme_generic_command_status_code_SPDK_NVME_SC_COMMAND_INVALID_IN_CMB:
    spdk_nvme_generic_command_status_code = 31;
pub const spdk_nvme_generic_command_status_code_SPDK_NVME_SC_LBA_OUT_OF_RANGE:
    spdk_nvme_generic_command_status_code = 128;
pub const spdk_nvme_generic_command_status_code_SPDK_NVME_SC_CAPACITY_EXCEEDED:
    spdk_nvme_generic_command_status_code = 129;
pub const spdk_nvme_generic_command_status_code_SPDK_NVME_SC_NAMESPACE_NOT_READY:
    spdk_nvme_generic_command_status_code = 130;
pub const spdk_nvme_generic_command_status_code_SPDK_NVME_SC_RESERVATION_CONFLICT:
    spdk_nvme_generic_command_status_code = 131;
pub const spdk_nvme_generic_command_status_code_SPDK_NVME_SC_FORMAT_IN_PROGRESS:
    spdk_nvme_generic_command_status_code = 132;
pub type spdk_nvme_generic_command_status_code = u32;
pub const spdk_nvme_command_specific_status_code_SPDK_NVME_SC_COMPLETION_QUEUE_INVALID:
    spdk_nvme_command_specific_status_code = 0;
pub const spdk_nvme_command_specific_status_code_SPDK_NVME_SC_INVALID_QUEUE_IDENTIFIER:
    spdk_nvme_command_specific_status_code = 1;
pub const spdk_nvme_command_specific_status_code_SPDK_NVME_SC_MAXIMUM_QUEUE_SIZE_EXCEEDED:
    spdk_nvme_command_specific_status_code = 2;
pub const spdk_nvme_command_specific_status_code_SPDK_NVME_SC_ABORT_COMMAND_LIMIT_EXCEEDED:
    spdk_nvme_command_specific_status_code = 3;
pub const spdk_nvme_command_specific_status_code_SPDK_NVME_SC_ASYNC_EVENT_REQUEST_LIMIT_EXCEEDED:
    spdk_nvme_command_specific_status_code = 5;
pub const spdk_nvme_command_specific_status_code_SPDK_NVME_SC_INVALID_FIRMWARE_SLOT:
    spdk_nvme_command_specific_status_code = 6;
pub const spdk_nvme_command_specific_status_code_SPDK_NVME_SC_INVALID_FIRMWARE_IMAGE:
    spdk_nvme_command_specific_status_code = 7;
pub const spdk_nvme_command_specific_status_code_SPDK_NVME_SC_INVALID_INTERRUPT_VECTOR:
    spdk_nvme_command_specific_status_code = 8;
pub const spdk_nvme_command_specific_status_code_SPDK_NVME_SC_INVALID_LOG_PAGE:
    spdk_nvme_command_specific_status_code = 9;
pub const spdk_nvme_command_specific_status_code_SPDK_NVME_SC_INVALID_FORMAT:
    spdk_nvme_command_specific_status_code = 10;
pub const spdk_nvme_command_specific_status_code_SPDK_NVME_SC_FIRMWARE_REQ_CONVENTIONAL_RESET:
    spdk_nvme_command_specific_status_code = 11;
pub const spdk_nvme_command_specific_status_code_SPDK_NVME_SC_INVALID_QUEUE_DELETION:
    spdk_nvme_command_specific_status_code = 12;
pub const spdk_nvme_command_specific_status_code_SPDK_NVME_SC_FEATURE_ID_NOT_SAVEABLE:
    spdk_nvme_command_specific_status_code = 13;
pub const spdk_nvme_command_specific_status_code_SPDK_NVME_SC_FEATURE_NOT_CHANGEABLE:
    spdk_nvme_command_specific_status_code = 14;
pub const spdk_nvme_command_specific_status_code_SPDK_NVME_SC_FEATURE_NOT_NAMESPACE_SPECIFIC:
    spdk_nvme_command_specific_status_code = 15;
pub const spdk_nvme_command_specific_status_code_SPDK_NVME_SC_FIRMWARE_REQ_NVM_RESET:
    spdk_nvme_command_specific_status_code = 16;
pub const spdk_nvme_command_specific_status_code_SPDK_NVME_SC_FIRMWARE_REQ_RESET:
    spdk_nvme_command_specific_status_code = 17;
pub const spdk_nvme_command_specific_status_code_SPDK_NVME_SC_FIRMWARE_REQ_MAX_TIME_VIOLATION:
    spdk_nvme_command_specific_status_code = 18;
pub const spdk_nvme_command_specific_status_code_SPDK_NVME_SC_FIRMWARE_ACTIVATION_PROHIBITED:
    spdk_nvme_command_specific_status_code = 19;
pub const spdk_nvme_command_specific_status_code_SPDK_NVME_SC_OVERLAPPING_RANGE:
    spdk_nvme_command_specific_status_code = 20;
pub const spdk_nvme_command_specific_status_code_SPDK_NVME_SC_NAMESPACE_INSUFFICIENT_CAPACITY:
    spdk_nvme_command_specific_status_code = 21;
pub const spdk_nvme_command_specific_status_code_SPDK_NVME_SC_NAMESPACE_ID_UNAVAILABLE:
    spdk_nvme_command_specific_status_code = 22;
pub const spdk_nvme_command_specific_status_code_SPDK_NVME_SC_NAMESPACE_ALREADY_ATTACHED:
    spdk_nvme_command_specific_status_code = 24;
pub const spdk_nvme_command_specific_status_code_SPDK_NVME_SC_NAMESPACE_IS_PRIVATE:
    spdk_nvme_command_specific_status_code = 25;
pub const spdk_nvme_command_specific_status_code_SPDK_NVME_SC_NAMESPACE_NOT_ATTACHED:
    spdk_nvme_command_specific_status_code = 26;
pub const spdk_nvme_command_specific_status_code_SPDK_NVME_SC_THINPROVISIONING_NOT_SUPPORTED:
    spdk_nvme_command_specific_status_code = 27;
pub const spdk_nvme_command_specific_status_code_SPDK_NVME_SC_CONTROLLER_LIST_INVALID:
    spdk_nvme_command_specific_status_code = 28;
pub const spdk_nvme_command_specific_status_code_SPDK_NVME_SC_DEVICE_SELF_TEST_IN_PROGRESS:
    spdk_nvme_command_specific_status_code = 29;
pub const spdk_nvme_command_specific_status_code_SPDK_NVME_SC_BOOT_PARTITION_WRITE_PROHIBITED:
    spdk_nvme_command_specific_status_code = 30;
pub const spdk_nvme_command_specific_status_code_SPDK_NVME_SC_INVALID_CTRLR_ID:
    spdk_nvme_command_specific_status_code = 31;
pub const spdk_nvme_command_specific_status_code_SPDK_NVME_SC_INVALID_SECONDARY_CTRLR_STATE:
    spdk_nvme_command_specific_status_code = 32;
pub const spdk_nvme_command_specific_status_code_SPDK_NVME_SC_INVALID_NUM_CTRLR_RESOURCES:
    spdk_nvme_command_specific_status_code = 33;
pub const spdk_nvme_command_specific_status_code_SPDK_NVME_SC_INVALID_RESOURCE_ID:
    spdk_nvme_command_specific_status_code = 34;
pub const spdk_nvme_command_specific_status_code_SPDK_NVME_SC_CONFLICTING_ATTRIBUTES:
    spdk_nvme_command_specific_status_code = 128;
pub const spdk_nvme_command_specific_status_code_SPDK_NVME_SC_INVALID_PROTECTION_INFO:
    spdk_nvme_command_specific_status_code = 129;
pub const spdk_nvme_command_specific_status_code_SPDK_NVME_SC_ATTEMPTED_WRITE_TO_RO_PAGE:
    spdk_nvme_command_specific_status_code = 130;
pub type spdk_nvme_command_specific_status_code = u32;
pub const spdk_nvme_media_error_status_code_SPDK_NVME_SC_WRITE_FAULTS:
    spdk_nvme_media_error_status_code = 128;
pub const spdk_nvme_media_error_status_code_SPDK_NVME_SC_UNRECOVERED_READ_ERROR:
    spdk_nvme_media_error_status_code = 129;
pub const spdk_nvme_media_error_status_code_SPDK_NVME_SC_GUARD_CHECK_ERROR:
    spdk_nvme_media_error_status_code = 130;
pub const spdk_nvme_media_error_status_code_SPDK_NVME_SC_APPLICATION_TAG_CHECK_ERROR:
    spdk_nvme_media_error_status_code = 131;
pub const spdk_nvme_media_error_status_code_SPDK_NVME_SC_REFERENCE_TAG_CHECK_ERROR:
    spdk_nvme_media_error_status_code = 132;
pub const spdk_nvme_media_error_status_code_SPDK_NVME_SC_COMPARE_FAILURE:
    spdk_nvme_media_error_status_code = 133;
pub const spdk_nvme_media_error_status_code_SPDK_NVME_SC_ACCESS_DENIED:
    spdk_nvme_media_error_status_code = 134;
pub const spdk_nvme_media_error_status_code_SPDK_NVME_SC_DEALLOCATED_OR_UNWRITTEN_BLOCK:
    spdk_nvme_media_error_status_code = 135;
pub type spdk_nvme_media_error_status_code = u32;
pub const spdk_nvme_path_status_code_SPDK_NVME_SC_INTERNAL_PATH_ERROR: spdk_nvme_path_status_code =
    0;
pub const spdk_nvme_path_status_code_SPDK_NVME_SC_CONTROLLER_PATH_ERROR:
    spdk_nvme_path_status_code = 96;
pub const spdk_nvme_path_status_code_SPDK_NVME_SC_HOST_PATH_ERROR: spdk_nvme_path_status_code = 112;
pub const spdk_nvme_path_status_code_SPDK_NVME_SC_ABORTED_BY_HOST: spdk_nvme_path_status_code = 113;
pub type spdk_nvme_path_status_code = u32;
pub const spdk_nvme_admin_opcode_SPDK_NVME_OPC_DELETE_IO_SQ: spdk_nvme_admin_opcode = 0;
pub const spdk_nvme_admin_opcode_SPDK_NVME_OPC_CREATE_IO_SQ: spdk_nvme_admin_opcode = 1;
pub const spdk_nvme_admin_opcode_SPDK_NVME_OPC_GET_LOG_PAGE: spdk_nvme_admin_opcode = 2;
pub const spdk_nvme_admin_opcode_SPDK_NVME_OPC_DELETE_IO_CQ: spdk_nvme_admin_opcode = 4;
pub const spdk_nvme_admin_opcode_SPDK_NVME_OPC_CREATE_IO_CQ: spdk_nvme_admin_opcode = 5;
pub const spdk_nvme_admin_opcode_SPDK_NVME_OPC_IDENTIFY: spdk_nvme_admin_opcode = 6;
pub const spdk_nvme_admin_opcode_SPDK_NVME_OPC_ABORT: spdk_nvme_admin_opcode = 8;
pub const spdk_nvme_admin_opcode_SPDK_NVME_OPC_SET_FEATURES: spdk_nvme_admin_opcode = 9;
pub const spdk_nvme_admin_opcode_SPDK_NVME_OPC_GET_FEATURES: spdk_nvme_admin_opcode = 10;
pub const spdk_nvme_admin_opcode_SPDK_NVME_OPC_ASYNC_EVENT_REQUEST: spdk_nvme_admin_opcode = 12;
pub const spdk_nvme_admin_opcode_SPDK_NVME_OPC_NS_MANAGEMENT: spdk_nvme_admin_opcode = 13;
pub const spdk_nvme_admin_opcode_SPDK_NVME_OPC_FIRMWARE_COMMIT: spdk_nvme_admin_opcode = 16;
pub const spdk_nvme_admin_opcode_SPDK_NVME_OPC_FIRMWARE_IMAGE_DOWNLOAD: spdk_nvme_admin_opcode = 17;
pub const spdk_nvme_admin_opcode_SPDK_NVME_OPC_DEVICE_SELF_TEST: spdk_nvme_admin_opcode = 20;
pub const spdk_nvme_admin_opcode_SPDK_NVME_OPC_NS_ATTACHMENT: spdk_nvme_admin_opcode = 21;
pub const spdk_nvme_admin_opcode_SPDK_NVME_OPC_KEEP_ALIVE: spdk_nvme_admin_opcode = 24;
pub const spdk_nvme_admin_opcode_SPDK_NVME_OPC_DIRECTIVE_SEND: spdk_nvme_admin_opcode = 25;
pub const spdk_nvme_admin_opcode_SPDK_NVME_OPC_DIRECTIVE_RECEIVE: spdk_nvme_admin_opcode = 26;
pub const spdk_nvme_admin_opcode_SPDK_NVME_OPC_VIRTUALIZATION_MANAGEMENT: spdk_nvme_admin_opcode =
    28;
pub const spdk_nvme_admin_opcode_SPDK_NVME_OPC_NVME_MI_SEND: spdk_nvme_admin_opcode = 29;
pub const spdk_nvme_admin_opcode_SPDK_NVME_OPC_NVME_MI_RECEIVE: spdk_nvme_admin_opcode = 30;
pub const spdk_nvme_admin_opcode_SPDK_NVME_OPC_DOORBELL_BUFFER_CONFIG: spdk_nvme_admin_opcode = 124;
pub const spdk_nvme_admin_opcode_SPDK_NVME_OPC_FORMAT_NVM: spdk_nvme_admin_opcode = 128;
pub const spdk_nvme_admin_opcode_SPDK_NVME_OPC_SECURITY_SEND: spdk_nvme_admin_opcode = 129;
pub const spdk_nvme_admin_opcode_SPDK_NVME_OPC_SECURITY_RECEIVE: spdk_nvme_admin_opcode = 130;
pub const spdk_nvme_admin_opcode_SPDK_NVME_OPC_SANITIZE: spdk_nvme_admin_opcode = 132;
pub type spdk_nvme_admin_opcode = u32;
pub const spdk_nvme_nvm_opcode_SPDK_NVME_OPC_FLUSH: spdk_nvme_nvm_opcode = 0;
pub const spdk_nvme_nvm_opcode_SPDK_NVME_OPC_WRITE: spdk_nvme_nvm_opcode = 1;
pub const spdk_nvme_nvm_opcode_SPDK_NVME_OPC_READ: spdk_nvme_nvm_opcode = 2;
pub const spdk_nvme_nvm_opcode_SPDK_NVME_OPC_WRITE_UNCORRECTABLE: spdk_nvme_nvm_opcode = 4;
pub const spdk_nvme_nvm_opcode_SPDK_NVME_OPC_COMPARE: spdk_nvme_nvm_opcode = 5;
pub const spdk_nvme_nvm_opcode_SPDK_NVME_OPC_WRITE_ZEROES: spdk_nvme_nvm_opcode = 8;
pub const spdk_nvme_nvm_opcode_SPDK_NVME_OPC_DATASET_MANAGEMENT: spdk_nvme_nvm_opcode = 9;
pub const spdk_nvme_nvm_opcode_SPDK_NVME_OPC_RESERVATION_REGISTER: spdk_nvme_nvm_opcode = 13;
pub const spdk_nvme_nvm_opcode_SPDK_NVME_OPC_RESERVATION_REPORT: spdk_nvme_nvm_opcode = 14;
pub const spdk_nvme_nvm_opcode_SPDK_NVME_OPC_RESERVATION_ACQUIRE: spdk_nvme_nvm_opcode = 17;
pub const spdk_nvme_nvm_opcode_SPDK_NVME_OPC_RESERVATION_RELEASE: spdk_nvme_nvm_opcode = 21;
pub type spdk_nvme_nvm_opcode = u32;
pub const spdk_nvme_data_transfer_SPDK_NVME_DATA_NONE: spdk_nvme_data_transfer = 0;
pub const spdk_nvme_data_transfer_SPDK_NVME_DATA_HOST_TO_CONTROLLER: spdk_nvme_data_transfer = 1;
pub const spdk_nvme_data_transfer_SPDK_NVME_DATA_CONTROLLER_TO_HOST: spdk_nvme_data_transfer = 2;
pub const spdk_nvme_data_transfer_SPDK_NVME_DATA_BIDIRECTIONAL: spdk_nvme_data_transfer = 3;
pub type spdk_nvme_data_transfer = u32;
pub const spdk_nvme_feat_SPDK_NVME_FEAT_ARBITRATION: spdk_nvme_feat = 1;
pub const spdk_nvme_feat_SPDK_NVME_FEAT_POWER_MANAGEMENT: spdk_nvme_feat = 2;
pub const spdk_nvme_feat_SPDK_NVME_FEAT_LBA_RANGE_TYPE: spdk_nvme_feat = 3;
pub const spdk_nvme_feat_SPDK_NVME_FEAT_TEMPERATURE_THRESHOLD: spdk_nvme_feat = 4;
pub const spdk_nvme_feat_SPDK_NVME_FEAT_ERROR_RECOVERY: spdk_nvme_feat = 5;
pub const spdk_nvme_feat_SPDK_NVME_FEAT_VOLATILE_WRITE_CACHE: spdk_nvme_feat = 6;
pub const spdk_nvme_feat_SPDK_NVME_FEAT_NUMBER_OF_QUEUES: spdk_nvme_feat = 7;
pub const spdk_nvme_feat_SPDK_NVME_FEAT_INTERRUPT_COALESCING: spdk_nvme_feat = 8;
pub const spdk_nvme_feat_SPDK_NVME_FEAT_INTERRUPT_VECTOR_CONFIGURATION: spdk_nvme_feat = 9;
pub const spdk_nvme_feat_SPDK_NVME_FEAT_WRITE_ATOMICITY: spdk_nvme_feat = 10;
pub const spdk_nvme_feat_SPDK_NVME_FEAT_ASYNC_EVENT_CONFIGURATION: spdk_nvme_feat = 11;
pub const spdk_nvme_feat_SPDK_NVME_FEAT_AUTONOMOUS_POWER_STATE_TRANSITION: spdk_nvme_feat = 12;
pub const spdk_nvme_feat_SPDK_NVME_FEAT_HOST_MEM_BUFFER: spdk_nvme_feat = 13;
pub const spdk_nvme_feat_SPDK_NVME_FEAT_TIMESTAMP: spdk_nvme_feat = 14;
pub const spdk_nvme_feat_SPDK_NVME_FEAT_KEEP_ALIVE_TIMER: spdk_nvme_feat = 15;
pub const spdk_nvme_feat_SPDK_NVME_FEAT_HOST_CONTROLLED_THERMAL_MANAGEMENT: spdk_nvme_feat = 16;
pub const spdk_nvme_feat_SPDK_NVME_FEAT_NON_OPERATIONAL_POWER_STATE_CONFIG: spdk_nvme_feat = 17;
pub const spdk_nvme_feat_SPDK_NVME_FEAT_SOFTWARE_PROGRESS_MARKER: spdk_nvme_feat = 128;
pub const spdk_nvme_feat_SPDK_NVME_FEAT_HOST_IDENTIFIER: spdk_nvme_feat = 129;
pub const spdk_nvme_feat_SPDK_NVME_FEAT_HOST_RESERVE_MASK: spdk_nvme_feat = 130;
pub const spdk_nvme_feat_SPDK_NVME_FEAT_HOST_RESERVE_PERSIST: spdk_nvme_feat = 131;
pub type spdk_nvme_feat = u32;
pub const spdk_nvme_dsm_attribute_SPDK_NVME_DSM_ATTR_INTEGRAL_READ: spdk_nvme_dsm_attribute = 1;
pub const spdk_nvme_dsm_attribute_SPDK_NVME_DSM_ATTR_INTEGRAL_WRITE: spdk_nvme_dsm_attribute = 2;
pub const spdk_nvme_dsm_attribute_SPDK_NVME_DSM_ATTR_DEALLOCATE: spdk_nvme_dsm_attribute = 4;
pub type spdk_nvme_dsm_attribute = u32;
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct spdk_nvme_power_state {
    pub mp: u16,
    pub reserved1: u8,
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 1usize], u8>,
    pub enlat: u32,
    pub exlat: u32,
    pub _bitfield_2: __BindgenBitfieldUnit<[u8; 4usize], u8>,
    pub reserved7: [u8; 16usize],
}
#[test]
fn bindgen_test_layout_spdk_nvme_power_state() {
    assert_eq!(
        ::std::mem::size_of::<spdk_nvme_power_state>(),
        32usize,
        concat!("Size of: ", stringify!(spdk_nvme_power_state))
    );
    assert_eq!(
        ::std::mem::align_of::<spdk_nvme_power_state>(),
        4usize,
        concat!("Alignment of ", stringify!(spdk_nvme_power_state))
    );
}
impl spdk_nvme_power_state {
    #[inline]
    pub fn mps(&self) -> u8 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_mps(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn nops(&self) -> u8 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(1usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_nops(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::std::mem::transmute(val);
            self._bitfield_1.set(1usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn reserved2(&self) -> u8 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(2usize, 6u8) as u8) }
    }
    #[inline]
    pub fn set_reserved2(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::std::mem::transmute(val);
            self._bitfield_1.set(2usize, 6u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        mps: u8,
        nops: u8,
        reserved2: u8,
    ) -> __BindgenBitfieldUnit<[u8; 1usize], u8> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize], u8> =
            Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let mps: u8 = unsafe { ::std::mem::transmute(mps) };
            mps as u64
        });
        __bindgen_bitfield_unit.set(1usize, 1u8, {
            let nops: u8 = unsafe { ::std::mem::transmute(nops) };
            nops as u64
        });
        __bindgen_bitfield_unit.set(2usize, 6u8, {
            let reserved2: u8 = unsafe { ::std::mem::transmute(reserved2) };
            reserved2 as u64
        });
        __bindgen_bitfield_unit
    }
    #[inline]
    pub fn rrt(&self) -> u8 {
        unsafe { ::std::mem::transmute(self._bitfield_2.get(0usize, 5u8) as u8) }
    }
    #[inline]
    pub fn set_rrt(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::std::mem::transmute(val);
            self._bitfield_2.set(0usize, 5u8, val as u64)
        }
    }
    #[inline]
    pub fn reserved3(&self) -> u8 {
        unsafe { ::std::mem::transmute(self._bitfield_2.get(5usize, 3u8) as u8) }
    }
    #[inline]
    pub fn set_reserved3(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::std::mem::transmute(val);
            self._bitfield_2.set(5usize, 3u8, val as u64)
        }
    }
    #[inline]
    pub fn rrl(&self) -> u8 {
        unsafe { ::std::mem::transmute(self._bitfield_2.get(8usize, 5u8) as u8) }
    }
    #[inline]
    pub fn set_rrl(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::std::mem::transmute(val);
            self._bitfield_2.set(8usize, 5u8, val as u64)
        }
    }
    #[inline]
    pub fn reserved4(&self) -> u8 {
        unsafe { ::std::mem::transmute(self._bitfield_2.get(13usize, 3u8) as u8) }
    }
    #[inline]
    pub fn set_reserved4(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::std::mem::transmute(val);
            self._bitfield_2.set(13usize, 3u8, val as u64)
        }
    }
    #[inline]
    pub fn rwt(&self) -> u8 {
        unsafe { ::std::mem::transmute(self._bitfield_2.get(16usize, 5u8) as u8) }
    }
    #[inline]
    pub fn set_rwt(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::std::mem::transmute(val);
            self._bitfield_2.set(16usize, 5u8, val as u64)
        }
    }
    #[inline]
    pub fn reserved5(&self) -> u8 {
        unsafe { ::std::mem::transmute(self._bitfield_2.get(21usize, 3u8) as u8) }
    }
    #[inline]
    pub fn set_reserved5(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::std::mem::transmute(val);
            self._bitfield_2.set(21usize, 3u8, val as u64)
        }
    }
    #[inline]
    pub fn rwl(&self) -> u8 {
        unsafe { ::std::mem::transmute(self._bitfield_2.get(24usize, 5u8) as u8) }
    }
    #[inline]
    pub fn set_rwl(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::std::mem::transmute(val);
            self._bitfield_2.set(24usize, 5u8, val as u64)
        }
    }
    #[inline]
    pub fn reserved6(&self) -> u8 {
        unsafe { ::std::mem::transmute(self._bitfield_2.get(29usize, 3u8) as u8) }
    }
    #[inline]
    pub fn set_reserved6(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::std::mem::transmute(val);
            self._bitfield_2.set(29usize, 3u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_2(
        rrt: u8,
        reserved3: u8,
        rrl: u8,
        reserved4: u8,
        rwt: u8,
        reserved5: u8,
        rwl: u8,
        reserved6: u8,
    ) -> __BindgenBitfieldUnit<[u8; 4usize], u8> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 4usize], u8> =
            Default::default();
        __bindgen_bitfield_unit.set(0usize, 5u8, {
            let rrt: u8 = unsafe { ::std::mem::transmute(rrt) };
            rrt as u64
        });
        __bindgen_bitfield_unit.set(5usize, 3u8, {
            let reserved3: u8 = unsafe { ::std::mem::transmute(reserved3) };
            reserved3 as u64
        });
        __bindgen_bitfield_unit.set(8usize, 5u8, {
            let rrl: u8 = unsafe { ::std::mem::transmute(rrl) };
            rrl as u64
        });
        __bindgen_bitfield_unit.set(13usize, 3u8, {
            let reserved4: u8 = unsafe { ::std::mem::transmute(reserved4) };
            reserved4 as u64
        });
        __bindgen_bitfield_unit.set(16usize, 5u8, {
            let rwt: u8 = unsafe { ::std::mem::transmute(rwt) };
            rwt as u64
        });
        __bindgen_bitfield_unit.set(21usize, 3u8, {
            let reserved5: u8 = unsafe { ::std::mem::transmute(reserved5) };
            reserved5 as u64
        });
        __bindgen_bitfield_unit.set(24usize, 5u8, {
            let rwl: u8 = unsafe { ::std::mem::transmute(rwl) };
            rwl as u64
        });
        __bindgen_bitfield_unit.set(29usize, 3u8, {
            let reserved6: u8 = unsafe { ::std::mem::transmute(reserved6) };
            reserved6 as u64
        });
        __bindgen_bitfield_unit
    }
}
pub const spdk_nvme_identify_cns_SPDK_NVME_IDENTIFY_NS: spdk_nvme_identify_cns = 0;
pub const spdk_nvme_identify_cns_SPDK_NVME_IDENTIFY_CTRLR: spdk_nvme_identify_cns = 1;
pub const spdk_nvme_identify_cns_SPDK_NVME_IDENTIFY_ACTIVE_NS_LIST: spdk_nvme_identify_cns = 2;
pub const spdk_nvme_identify_cns_SPDK_NVME_IDENTIFY_NS_ID_DESCRIPTOR_LIST: spdk_nvme_identify_cns =
    3;
pub const spdk_nvme_identify_cns_SPDK_NVME_IDENTIFY_ALLOCATED_NS_LIST: spdk_nvme_identify_cns = 16;
pub const spdk_nvme_identify_cns_SPDK_NVME_IDENTIFY_NS_ALLOCATED: spdk_nvme_identify_cns = 17;
pub const spdk_nvme_identify_cns_SPDK_NVME_IDENTIFY_NS_ATTACHED_CTRLR_LIST: spdk_nvme_identify_cns =
    18;
pub const spdk_nvme_identify_cns_SPDK_NVME_IDENTIFY_CTRLR_LIST: spdk_nvme_identify_cns = 19;
pub const spdk_nvme_identify_cns_SPDK_NVME_IDENTIFY_PRIMARY_CTRLR_CAP: spdk_nvme_identify_cns = 20;
pub const spdk_nvme_identify_cns_SPDK_NVME_IDENTIFY_SECONDARY_CTRLR_LIST: spdk_nvme_identify_cns =
    21;
pub type spdk_nvme_identify_cns = u32;
pub const spdk_nvme_sgls_supported_SPDK_NVME_SGLS_NOT_SUPPORTED: spdk_nvme_sgls_supported = 0;
pub const spdk_nvme_sgls_supported_SPDK_NVME_SGLS_SUPPORTED: spdk_nvme_sgls_supported = 1;
pub const spdk_nvme_sgls_supported_SPDK_NVME_SGLS_SUPPORTED_DWORD_ALIGNED:
    spdk_nvme_sgls_supported = 2;
pub type spdk_nvme_sgls_supported = u32;
pub const spdk_nvme_flush_broadcast_SPDK_NVME_FLUSH_BROADCAST_NOT_INDICATED:
    spdk_nvme_flush_broadcast = 0;
pub const spdk_nvme_flush_broadcast_SPDK_NVME_FLUSH_BROADCAST_NOT_SUPPORTED:
    spdk_nvme_flush_broadcast = 2;
pub const spdk_nvme_flush_broadcast_SPDK_NVME_FLUSH_BROADCAST_SUPPORTED: spdk_nvme_flush_broadcast =
    3;
pub type spdk_nvme_flush_broadcast = u32;
#[repr(C, packed)]
#[derive(Copy, Clone)]
pub struct spdk_nvme_ctrlr_data {
    pub vid: u16,
    pub ssvid: u16,
    pub sn: [i8; 20usize],
    pub mn: [i8; 40usize],
    pub fr: [u8; 8usize],
    pub rab: u8,
    pub ieee: [u8; 3usize],
    pub cmic: spdk_nvme_ctrlr_data__bindgen_ty_1,
    pub mdts: u8,
    pub cntlid: u16,
    pub ver: spdk_nvme_vs_register,
    pub rtd3r: u32,
    pub rtd3e: u32,
    pub oaes: spdk_nvme_ctrlr_data__bindgen_ty_2,
    pub ctratt: spdk_nvme_ctrlr_data__bindgen_ty_3,
    pub reserved_100: [u8; 12usize],
    pub fguid: [u8; 16usize],
    pub reserved_128: [u8; 128usize],
    pub oacs: spdk_nvme_ctrlr_data__bindgen_ty_4,
    pub acl: u8,
    pub aerl: u8,
    pub frmw: spdk_nvme_ctrlr_data__bindgen_ty_5,
    pub lpa: spdk_nvme_ctrlr_data__bindgen_ty_6,
    pub elpe: u8,
    pub npss: u8,
    pub avscc: spdk_nvme_ctrlr_data__bindgen_ty_7,
    pub apsta: spdk_nvme_ctrlr_data__bindgen_ty_8,
    pub wctemp: u16,
    pub cctemp: u16,
    pub mtfa: u16,
    pub hmpre: u32,
    pub hmmin: u32,
    pub tnvmcap: [u64; 2usize],
    pub unvmcap: [u64; 2usize],
    pub rpmbs: spdk_nvme_ctrlr_data__bindgen_ty_9,
    pub edstt: u16,
    pub dsto: spdk_nvme_ctrlr_data__bindgen_ty_10,
    pub fwug: u8,
    pub kas: u16,
    pub hctma: spdk_nvme_ctrlr_data__bindgen_ty_11,
    pub mntmt: u16,
    pub mxtmt: u16,
    pub sanicap: spdk_nvme_ctrlr_data__bindgen_ty_12,
    pub reserved3: [u8; 180usize],
    pub sqes: spdk_nvme_ctrlr_data__bindgen_ty_13,
    pub cqes: spdk_nvme_ctrlr_data__bindgen_ty_14,
    pub maxcmd: u16,
    pub nn: u32,
    pub oncs: spdk_nvme_ctrlr_data__bindgen_ty_15,
    pub fuses: u16,
    pub fna: spdk_nvme_ctrlr_data__bindgen_ty_16,
    pub vwc: spdk_nvme_ctrlr_data__bindgen_ty_17,
    pub awun: u16,
    pub awupf: u16,
    pub nvscc: u8,
    pub reserved531: u8,
    pub acwu: u16,
    pub reserved534: u16,
    pub sgls: spdk_nvme_ctrlr_data__bindgen_ty_18,
    pub reserved4: [u8; 228usize],
    pub subnqn: [u8; 256usize],
    pub reserved5: [u8; 768usize],
    pub nvmf_specific: spdk_nvme_ctrlr_data__bindgen_ty_19,
    pub psd: [spdk_nvme_power_state; 32usize],
    pub vs: [u8; 1024usize],
}
#[repr(C, packed)]
#[derive(Debug, Default, Copy, Clone)]
pub struct spdk_nvme_ctrlr_data__bindgen_ty_1 {
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 1usize], u8>,
}
#[test]
fn bindgen_test_layout_spdk_nvme_ctrlr_data__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<spdk_nvme_ctrlr_data__bindgen_ty_1>(),
        1usize,
        concat!("Size of: ", stringify!(spdk_nvme_ctrlr_data__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<spdk_nvme_ctrlr_data__bindgen_ty_1>(),
        1usize,
        concat!(
            "Alignment of ",
            stringify!(spdk_nvme_ctrlr_data__bindgen_ty_1)
        )
    );
}
impl spdk_nvme_ctrlr_data__bindgen_ty_1 {
    #[inline]
    pub fn multi_port(&self) -> u8 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_multi_port(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn multi_host(&self) -> u8 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(1usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_multi_host(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::std::mem::transmute(val);
            self._bitfield_1.set(1usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn sr_iov(&self) -> u8 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(2usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_sr_iov(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::std::mem::transmute(val);
            self._bitfield_1.set(2usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn reserved(&self) -> u8 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(3usize, 5u8) as u8) }
    }
    #[inline]
    pub fn set_reserved(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::std::mem::transmute(val);
            self._bitfield_1.set(3usize, 5u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        multi_port: u8,
        multi_host: u8,
        sr_iov: u8,
        reserved: u8,
    ) -> __BindgenBitfieldUnit<[u8; 1usize], u8> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize], u8> =
            Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let multi_port: u8 = unsafe { ::std::mem::transmute(multi_port) };
            multi_port as u64
        });
        __bindgen_bitfield_unit.set(1usize, 1u8, {
            let multi_host: u8 = unsafe { ::std::mem::transmute(multi_host) };
            multi_host as u64
        });
        __bindgen_bitfield_unit.set(2usize, 1u8, {
            let sr_iov: u8 = unsafe { ::std::mem::transmute(sr_iov) };
            sr_iov as u64
        });
        __bindgen_bitfield_unit.set(3usize, 5u8, {
            let reserved: u8 = unsafe { ::std::mem::transmute(reserved) };
            reserved as u64
        });
        __bindgen_bitfield_unit
    }
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct spdk_nvme_ctrlr_data__bindgen_ty_2 {
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 4usize], u32>,
    pub __bindgen_align: [u32; 0usize],
}
#[test]
fn bindgen_test_layout_spdk_nvme_ctrlr_data__bindgen_ty_2() {
    assert_eq!(
        ::std::mem::size_of::<spdk_nvme_ctrlr_data__bindgen_ty_2>(),
        4usize,
        concat!("Size of: ", stringify!(spdk_nvme_ctrlr_data__bindgen_ty_2))
    );
    assert_eq!(
        ::std::mem::align_of::<spdk_nvme_ctrlr_data__bindgen_ty_2>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(spdk_nvme_ctrlr_data__bindgen_ty_2)
        )
    );
}
impl spdk_nvme_ctrlr_data__bindgen_ty_2 {
    #[inline]
    pub fn reserved1(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 8u8) as u32) }
    }
    #[inline]
    pub fn set_reserved1(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 8u8, val as u64)
        }
    }
    #[inline]
    pub fn ns_attribute_notices(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(8usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_ns_attribute_notices(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(8usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn fw_activation_notices(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(9usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_fw_activation_notices(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(9usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn reserved2(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(10usize, 22u8) as u32) }
    }
    #[inline]
    pub fn set_reserved2(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(10usize, 22u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        reserved1: u32,
        ns_attribute_notices: u32,
        fw_activation_notices: u32,
        reserved2: u32,
    ) -> __BindgenBitfieldUnit<[u8; 4usize], u32> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 4usize], u32> =
            Default::default();
        __bindgen_bitfield_unit.set(0usize, 8u8, {
            let reserved1: u32 = unsafe { ::std::mem::transmute(reserved1) };
            reserved1 as u64
        });
        __bindgen_bitfield_unit.set(8usize, 1u8, {
            let ns_attribute_notices: u32 = unsafe { ::std::mem::transmute(ns_attribute_notices) };
            ns_attribute_notices as u64
        });
        __bindgen_bitfield_unit.set(9usize, 1u8, {
            let fw_activation_notices: u32 =
                unsafe { ::std::mem::transmute(fw_activation_notices) };
            fw_activation_notices as u64
        });
        __bindgen_bitfield_unit.set(10usize, 22u8, {
            let reserved2: u32 = unsafe { ::std::mem::transmute(reserved2) };
            reserved2 as u64
        });
        __bindgen_bitfield_unit
    }
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct spdk_nvme_ctrlr_data__bindgen_ty_3 {
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 4usize], u32>,
    pub __bindgen_align: [u32; 0usize],
}
#[test]
fn bindgen_test_layout_spdk_nvme_ctrlr_data__bindgen_ty_3() {
    assert_eq!(
        ::std::mem::size_of::<spdk_nvme_ctrlr_data__bindgen_ty_3>(),
        4usize,
        concat!("Size of: ", stringify!(spdk_nvme_ctrlr_data__bindgen_ty_3))
    );
    assert_eq!(
        ::std::mem::align_of::<spdk_nvme_ctrlr_data__bindgen_ty_3>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(spdk_nvme_ctrlr_data__bindgen_ty_3)
        )
    );
}
impl spdk_nvme_ctrlr_data__bindgen_ty_3 {
    #[inline]
    pub fn host_id_exhid_supported(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_host_id_exhid_supported(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn non_operational_power_state_permissive_mode(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(1usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_non_operational_power_state_permissive_mode(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(1usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn reserved(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(2usize, 30u8) as u32) }
    }
    #[inline]
    pub fn set_reserved(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(2usize, 30u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        host_id_exhid_supported: u32,
        non_operational_power_state_permissive_mode: u32,
        reserved: u32,
    ) -> __BindgenBitfieldUnit<[u8; 4usize], u32> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 4usize], u32> =
            Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let host_id_exhid_supported: u32 =
                unsafe { ::std::mem::transmute(host_id_exhid_supported) };
            host_id_exhid_supported as u64
        });
        __bindgen_bitfield_unit.set(1usize, 1u8, {
            let non_operational_power_state_permissive_mode: u32 =
                unsafe { ::std::mem::transmute(non_operational_power_state_permissive_mode) };
            non_operational_power_state_permissive_mode as u64
        });
        __bindgen_bitfield_unit.set(2usize, 30u8, {
            let reserved: u32 = unsafe { ::std::mem::transmute(reserved) };
            reserved as u64
        });
        __bindgen_bitfield_unit
    }
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct spdk_nvme_ctrlr_data__bindgen_ty_4 {
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 2usize], u8>,
    pub __bindgen_align: [u16; 0usize],
}
#[test]
fn bindgen_test_layout_spdk_nvme_ctrlr_data__bindgen_ty_4() {
    assert_eq!(
        ::std::mem::size_of::<spdk_nvme_ctrlr_data__bindgen_ty_4>(),
        2usize,
        concat!("Size of: ", stringify!(spdk_nvme_ctrlr_data__bindgen_ty_4))
    );
    assert_eq!(
        ::std::mem::align_of::<spdk_nvme_ctrlr_data__bindgen_ty_4>(),
        2usize,
        concat!(
            "Alignment of ",
            stringify!(spdk_nvme_ctrlr_data__bindgen_ty_4)
        )
    );
}
impl spdk_nvme_ctrlr_data__bindgen_ty_4 {
    #[inline]
    pub fn security(&self) -> u16 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set_security(&mut self, val: u16) {
        unsafe {
            let val: u16 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn format(&self) -> u16 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(1usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set_format(&mut self, val: u16) {
        unsafe {
            let val: u16 = ::std::mem::transmute(val);
            self._bitfield_1.set(1usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn firmware(&self) -> u16 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(2usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set_firmware(&mut self, val: u16) {
        unsafe {
            let val: u16 = ::std::mem::transmute(val);
            self._bitfield_1.set(2usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn ns_manage(&self) -> u16 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(3usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set_ns_manage(&mut self, val: u16) {
        unsafe {
            let val: u16 = ::std::mem::transmute(val);
            self._bitfield_1.set(3usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn device_self_test(&self) -> u16 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(4usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set_device_self_test(&mut self, val: u16) {
        unsafe {
            let val: u16 = ::std::mem::transmute(val);
            self._bitfield_1.set(4usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn directives(&self) -> u16 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(5usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set_directives(&mut self, val: u16) {
        unsafe {
            let val: u16 = ::std::mem::transmute(val);
            self._bitfield_1.set(5usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn nvme_mi(&self) -> u16 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(6usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set_nvme_mi(&mut self, val: u16) {
        unsafe {
            let val: u16 = ::std::mem::transmute(val);
            self._bitfield_1.set(6usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn virtualization_management(&self) -> u16 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(7usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set_virtualization_management(&mut self, val: u16) {
        unsafe {
            let val: u16 = ::std::mem::transmute(val);
            self._bitfield_1.set(7usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn doorbell_buffer_config(&self) -> u16 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(8usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set_doorbell_buffer_config(&mut self, val: u16) {
        unsafe {
            let val: u16 = ::std::mem::transmute(val);
            self._bitfield_1.set(8usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn oacs_rsvd(&self) -> u16 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(9usize, 7u8) as u16) }
    }
    #[inline]
    pub fn set_oacs_rsvd(&mut self, val: u16) {
        unsafe {
            let val: u16 = ::std::mem::transmute(val);
            self._bitfield_1.set(9usize, 7u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        security: u16,
        format: u16,
        firmware: u16,
        ns_manage: u16,
        device_self_test: u16,
        directives: u16,
        nvme_mi: u16,
        virtualization_management: u16,
        doorbell_buffer_config: u16,
        oacs_rsvd: u16,
    ) -> __BindgenBitfieldUnit<[u8; 2usize], u8> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 2usize], u8> =
            Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let security: u16 = unsafe { ::std::mem::transmute(security) };
            security as u64
        });
        __bindgen_bitfield_unit.set(1usize, 1u8, {
            let format: u16 = unsafe { ::std::mem::transmute(format) };
            format as u64
        });
        __bindgen_bitfield_unit.set(2usize, 1u8, {
            let firmware: u16 = unsafe { ::std::mem::transmute(firmware) };
            firmware as u64
        });
        __bindgen_bitfield_unit.set(3usize, 1u8, {
            let ns_manage: u16 = unsafe { ::std::mem::transmute(ns_manage) };
            ns_manage as u64
        });
        __bindgen_bitfield_unit.set(4usize, 1u8, {
            let device_self_test: u16 = unsafe { ::std::mem::transmute(device_self_test) };
            device_self_test as u64
        });
        __bindgen_bitfield_unit.set(5usize, 1u8, {
            let directives: u16 = unsafe { ::std::mem::transmute(directives) };
            directives as u64
        });
        __bindgen_bitfield_unit.set(6usize, 1u8, {
            let nvme_mi: u16 = unsafe { ::std::mem::transmute(nvme_mi) };
            nvme_mi as u64
        });
        __bindgen_bitfield_unit.set(7usize, 1u8, {
            let virtualization_management: u16 =
                unsafe { ::std::mem::transmute(virtualization_management) };
            virtualization_management as u64
        });
        __bindgen_bitfield_unit.set(8usize, 1u8, {
            let doorbell_buffer_config: u16 =
                unsafe { ::std::mem::transmute(doorbell_buffer_config) };
            doorbell_buffer_config as u64
        });
        __bindgen_bitfield_unit.set(9usize, 7u8, {
            let oacs_rsvd: u16 = unsafe { ::std::mem::transmute(oacs_rsvd) };
            oacs_rsvd as u64
        });
        __bindgen_bitfield_unit
    }
}
#[repr(C, packed)]
#[derive(Debug, Default, Copy, Clone)]
pub struct spdk_nvme_ctrlr_data__bindgen_ty_5 {
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 1usize], u8>,
}
#[test]
fn bindgen_test_layout_spdk_nvme_ctrlr_data__bindgen_ty_5() {
    assert_eq!(
        ::std::mem::size_of::<spdk_nvme_ctrlr_data__bindgen_ty_5>(),
        1usize,
        concat!("Size of: ", stringify!(spdk_nvme_ctrlr_data__bindgen_ty_5))
    );
    assert_eq!(
        ::std::mem::align_of::<spdk_nvme_ctrlr_data__bindgen_ty_5>(),
        1usize,
        concat!(
            "Alignment of ",
            stringify!(spdk_nvme_ctrlr_data__bindgen_ty_5)
        )
    );
}
impl spdk_nvme_ctrlr_data__bindgen_ty_5 {
    #[inline]
    pub fn slot1_ro(&self) -> u8 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_slot1_ro(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn num_slots(&self) -> u8 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(1usize, 3u8) as u8) }
    }
    #[inline]
    pub fn set_num_slots(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::std::mem::transmute(val);
            self._bitfield_1.set(1usize, 3u8, val as u64)
        }
    }
    #[inline]
    pub fn activation_without_reset(&self) -> u8 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(4usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_activation_without_reset(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::std::mem::transmute(val);
            self._bitfield_1.set(4usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn frmw_rsvd(&self) -> u8 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(5usize, 3u8) as u8) }
    }
    #[inline]
    pub fn set_frmw_rsvd(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::std::mem::transmute(val);
            self._bitfield_1.set(5usize, 3u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        slot1_ro: u8,
        num_slots: u8,
        activation_without_reset: u8,
        frmw_rsvd: u8,
    ) -> __BindgenBitfieldUnit<[u8; 1usize], u8> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize], u8> =
            Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let slot1_ro: u8 = unsafe { ::std::mem::transmute(slot1_ro) };
            slot1_ro as u64
        });
        __bindgen_bitfield_unit.set(1usize, 3u8, {
            let num_slots: u8 = unsafe { ::std::mem::transmute(num_slots) };
            num_slots as u64
        });
        __bindgen_bitfield_unit.set(4usize, 1u8, {
            let activation_without_reset: u8 =
                unsafe { ::std::mem::transmute(activation_without_reset) };
            activation_without_reset as u64
        });
        __bindgen_bitfield_unit.set(5usize, 3u8, {
            let frmw_rsvd: u8 = unsafe { ::std::mem::transmute(frmw_rsvd) };
            frmw_rsvd as u64
        });
        __bindgen_bitfield_unit
    }
}
#[repr(C, packed)]
#[derive(Debug, Default, Copy, Clone)]
pub struct spdk_nvme_ctrlr_data__bindgen_ty_6 {
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 1usize], u8>,
}
#[test]
fn bindgen_test_layout_spdk_nvme_ctrlr_data__bindgen_ty_6() {
    assert_eq!(
        ::std::mem::size_of::<spdk_nvme_ctrlr_data__bindgen_ty_6>(),
        1usize,
        concat!("Size of: ", stringify!(spdk_nvme_ctrlr_data__bindgen_ty_6))
    );
    assert_eq!(
        ::std::mem::align_of::<spdk_nvme_ctrlr_data__bindgen_ty_6>(),
        1usize,
        concat!(
            "Alignment of ",
            stringify!(spdk_nvme_ctrlr_data__bindgen_ty_6)
        )
    );
}
impl spdk_nvme_ctrlr_data__bindgen_ty_6 {
    #[inline]
    pub fn ns_smart(&self) -> u8 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_ns_smart(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn celp(&self) -> u8 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(1usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_celp(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::std::mem::transmute(val);
            self._bitfield_1.set(1usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn edlp(&self) -> u8 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(2usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_edlp(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::std::mem::transmute(val);
            self._bitfield_1.set(2usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn telemetry(&self) -> u8 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(3usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_telemetry(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::std::mem::transmute(val);
            self._bitfield_1.set(3usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn lpa_rsvd(&self) -> u8 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(4usize, 4u8) as u8) }
    }
    #[inline]
    pub fn set_lpa_rsvd(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::std::mem::transmute(val);
            self._bitfield_1.set(4usize, 4u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        ns_smart: u8,
        celp: u8,
        edlp: u8,
        telemetry: u8,
        lpa_rsvd: u8,
    ) -> __BindgenBitfieldUnit<[u8; 1usize], u8> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize], u8> =
            Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let ns_smart: u8 = unsafe { ::std::mem::transmute(ns_smart) };
            ns_smart as u64
        });
        __bindgen_bitfield_unit.set(1usize, 1u8, {
            let celp: u8 = unsafe { ::std::mem::transmute(celp) };
            celp as u64
        });
        __bindgen_bitfield_unit.set(2usize, 1u8, {
            let edlp: u8 = unsafe { ::std::mem::transmute(edlp) };
            edlp as u64
        });
        __bindgen_bitfield_unit.set(3usize, 1u8, {
            let telemetry: u8 = unsafe { ::std::mem::transmute(telemetry) };
            telemetry as u64
        });
        __bindgen_bitfield_unit.set(4usize, 4u8, {
            let lpa_rsvd: u8 = unsafe { ::std::mem::transmute(lpa_rsvd) };
            lpa_rsvd as u64
        });
        __bindgen_bitfield_unit
    }
}
#[repr(C, packed)]
#[derive(Debug, Default, Copy, Clone)]
pub struct spdk_nvme_ctrlr_data__bindgen_ty_7 {
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 1usize], u8>,
}
#[test]
fn bindgen_test_layout_spdk_nvme_ctrlr_data__bindgen_ty_7() {
    assert_eq!(
        ::std::mem::size_of::<spdk_nvme_ctrlr_data__bindgen_ty_7>(),
        1usize,
        concat!("Size of: ", stringify!(spdk_nvme_ctrlr_data__bindgen_ty_7))
    );
    assert_eq!(
        ::std::mem::align_of::<spdk_nvme_ctrlr_data__bindgen_ty_7>(),
        1usize,
        concat!(
            "Alignment of ",
            stringify!(spdk_nvme_ctrlr_data__bindgen_ty_7)
        )
    );
}
impl spdk_nvme_ctrlr_data__bindgen_ty_7 {
    #[inline]
    pub fn spec_format(&self) -> u8 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_spec_format(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn avscc_rsvd(&self) -> u8 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(1usize, 7u8) as u8) }
    }
    #[inline]
    pub fn set_avscc_rsvd(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::std::mem::transmute(val);
            self._bitfield_1.set(1usize, 7u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        spec_format: u8,
        avscc_rsvd: u8,
    ) -> __BindgenBitfieldUnit<[u8; 1usize], u8> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize], u8> =
            Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let spec_format: u8 = unsafe { ::std::mem::transmute(spec_format) };
            spec_format as u64
        });
        __bindgen_bitfield_unit.set(1usize, 7u8, {
            let avscc_rsvd: u8 = unsafe { ::std::mem::transmute(avscc_rsvd) };
            avscc_rsvd as u64
        });
        __bindgen_bitfield_unit
    }
}
#[repr(C, packed)]
#[derive(Debug, Default, Copy, Clone)]
pub struct spdk_nvme_ctrlr_data__bindgen_ty_8 {
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 1usize], u8>,
}
#[test]
fn bindgen_test_layout_spdk_nvme_ctrlr_data__bindgen_ty_8() {
    assert_eq!(
        ::std::mem::size_of::<spdk_nvme_ctrlr_data__bindgen_ty_8>(),
        1usize,
        concat!("Size of: ", stringify!(spdk_nvme_ctrlr_data__bindgen_ty_8))
    );
    assert_eq!(
        ::std::mem::align_of::<spdk_nvme_ctrlr_data__bindgen_ty_8>(),
        1usize,
        concat!(
            "Alignment of ",
            stringify!(spdk_nvme_ctrlr_data__bindgen_ty_8)
        )
    );
}
impl spdk_nvme_ctrlr_data__bindgen_ty_8 {
    #[inline]
    pub fn supported(&self) -> u8 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_supported(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn apsta_rsvd(&self) -> u8 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(1usize, 7u8) as u8) }
    }
    #[inline]
    pub fn set_apsta_rsvd(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::std::mem::transmute(val);
            self._bitfield_1.set(1usize, 7u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        supported: u8,
        apsta_rsvd: u8,
    ) -> __BindgenBitfieldUnit<[u8; 1usize], u8> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize], u8> =
            Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let supported: u8 = unsafe { ::std::mem::transmute(supported) };
            supported as u64
        });
        __bindgen_bitfield_unit.set(1usize, 7u8, {
            let apsta_rsvd: u8 = unsafe { ::std::mem::transmute(apsta_rsvd) };
            apsta_rsvd as u64
        });
        __bindgen_bitfield_unit
    }
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct spdk_nvme_ctrlr_data__bindgen_ty_9 {
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 1usize], u8>,
    pub reserved2: u8,
    pub total_size: u8,
    pub access_size: u8,
}
#[test]
fn bindgen_test_layout_spdk_nvme_ctrlr_data__bindgen_ty_9() {
    assert_eq!(
        ::std::mem::size_of::<spdk_nvme_ctrlr_data__bindgen_ty_9>(),
        4usize,
        concat!("Size of: ", stringify!(spdk_nvme_ctrlr_data__bindgen_ty_9))
    );
    assert_eq!(
        ::std::mem::align_of::<spdk_nvme_ctrlr_data__bindgen_ty_9>(),
        1usize,
        concat!(
            "Alignment of ",
            stringify!(spdk_nvme_ctrlr_data__bindgen_ty_9)
        )
    );
}
impl spdk_nvme_ctrlr_data__bindgen_ty_9 {
    #[inline]
    pub fn num_rpmb_units(&self) -> u8 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 3u8) as u8) }
    }
    #[inline]
    pub fn set_num_rpmb_units(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 3u8, val as u64)
        }
    }
    #[inline]
    pub fn auth_method(&self) -> u8 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(3usize, 3u8) as u8) }
    }
    #[inline]
    pub fn set_auth_method(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::std::mem::transmute(val);
            self._bitfield_1.set(3usize, 3u8, val as u64)
        }
    }
    #[inline]
    pub fn reserved1(&self) -> u8 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(6usize, 2u8) as u8) }
    }
    #[inline]
    pub fn set_reserved1(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::std::mem::transmute(val);
            self._bitfield_1.set(6usize, 2u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        num_rpmb_units: u8,
        auth_method: u8,
        reserved1: u8,
    ) -> __BindgenBitfieldUnit<[u8; 1usize], u8> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize], u8> =
            Default::default();
        __bindgen_bitfield_unit.set(0usize, 3u8, {
            let num_rpmb_units: u8 = unsafe { ::std::mem::transmute(num_rpmb_units) };
            num_rpmb_units as u64
        });
        __bindgen_bitfield_unit.set(3usize, 3u8, {
            let auth_method: u8 = unsafe { ::std::mem::transmute(auth_method) };
            auth_method as u64
        });
        __bindgen_bitfield_unit.set(6usize, 2u8, {
            let reserved1: u8 = unsafe { ::std::mem::transmute(reserved1) };
            reserved1 as u64
        });
        __bindgen_bitfield_unit
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union spdk_nvme_ctrlr_data__bindgen_ty_10 {
    pub raw: u8,
    pub bits: spdk_nvme_ctrlr_data__bindgen_ty_10__bindgen_ty_1,
    _bindgen_union_align: u8,
}
#[repr(C, packed)]
#[derive(Debug, Default, Copy, Clone)]
pub struct spdk_nvme_ctrlr_data__bindgen_ty_10__bindgen_ty_1 {
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 1usize], u8>,
}
#[test]
fn bindgen_test_layout_spdk_nvme_ctrlr_data__bindgen_ty_10__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<spdk_nvme_ctrlr_data__bindgen_ty_10__bindgen_ty_1>(),
        1usize,
        concat!(
            "Size of: ",
            stringify!(spdk_nvme_ctrlr_data__bindgen_ty_10__bindgen_ty_1)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<spdk_nvme_ctrlr_data__bindgen_ty_10__bindgen_ty_1>(),
        1usize,
        concat!(
            "Alignment of ",
            stringify!(spdk_nvme_ctrlr_data__bindgen_ty_10__bindgen_ty_1)
        )
    );
}
impl spdk_nvme_ctrlr_data__bindgen_ty_10__bindgen_ty_1 {
    #[inline]
    pub fn one_only(&self) -> u8 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_one_only(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn reserved(&self) -> u8 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(1usize, 7u8) as u8) }
    }
    #[inline]
    pub fn set_reserved(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::std::mem::transmute(val);
            self._bitfield_1.set(1usize, 7u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(one_only: u8, reserved: u8) -> __BindgenBitfieldUnit<[u8; 1usize], u8> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize], u8> =
            Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let one_only: u8 = unsafe { ::std::mem::transmute(one_only) };
            one_only as u64
        });
        __bindgen_bitfield_unit.set(1usize, 7u8, {
            let reserved: u8 = unsafe { ::std::mem::transmute(reserved) };
            reserved as u64
        });
        __bindgen_bitfield_unit
    }
}
#[test]
fn bindgen_test_layout_spdk_nvme_ctrlr_data__bindgen_ty_10() {
    assert_eq!(
        ::std::mem::size_of::<spdk_nvme_ctrlr_data__bindgen_ty_10>(),
        1usize,
        concat!("Size of: ", stringify!(spdk_nvme_ctrlr_data__bindgen_ty_10))
    );
    assert_eq!(
        ::std::mem::align_of::<spdk_nvme_ctrlr_data__bindgen_ty_10>(),
        1usize,
        concat!(
            "Alignment of ",
            stringify!(spdk_nvme_ctrlr_data__bindgen_ty_10)
        )
    );
}
impl Default for spdk_nvme_ctrlr_data__bindgen_ty_10 {
    fn default() -> Self {
        unsafe { ::std::mem::zeroed() }
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union spdk_nvme_ctrlr_data__bindgen_ty_11 {
    pub raw: u16,
    pub bits: spdk_nvme_ctrlr_data__bindgen_ty_11__bindgen_ty_1,
    _bindgen_union_align: u16,
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct spdk_nvme_ctrlr_data__bindgen_ty_11__bindgen_ty_1 {
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 2usize], u16>,
    pub __bindgen_align: [u16; 0usize],
}
#[test]
fn bindgen_test_layout_spdk_nvme_ctrlr_data__bindgen_ty_11__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<spdk_nvme_ctrlr_data__bindgen_ty_11__bindgen_ty_1>(),
        2usize,
        concat!(
            "Size of: ",
            stringify!(spdk_nvme_ctrlr_data__bindgen_ty_11__bindgen_ty_1)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<spdk_nvme_ctrlr_data__bindgen_ty_11__bindgen_ty_1>(),
        2usize,
        concat!(
            "Alignment of ",
            stringify!(spdk_nvme_ctrlr_data__bindgen_ty_11__bindgen_ty_1)
        )
    );
}
impl spdk_nvme_ctrlr_data__bindgen_ty_11__bindgen_ty_1 {
    #[inline]
    pub fn supported(&self) -> u16 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set_supported(&mut self, val: u16) {
        unsafe {
            let val: u16 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn reserved(&self) -> u16 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(1usize, 15u8) as u16) }
    }
    #[inline]
    pub fn set_reserved(&mut self, val: u16) {
        unsafe {
            let val: u16 = ::std::mem::transmute(val);
            self._bitfield_1.set(1usize, 15u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        supported: u16,
        reserved: u16,
    ) -> __BindgenBitfieldUnit<[u8; 2usize], u16> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 2usize], u16> =
            Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let supported: u16 = unsafe { ::std::mem::transmute(supported) };
            supported as u64
        });
        __bindgen_bitfield_unit.set(1usize, 15u8, {
            let reserved: u16 = unsafe { ::std::mem::transmute(reserved) };
            reserved as u64
        });
        __bindgen_bitfield_unit
    }
}
#[test]
fn bindgen_test_layout_spdk_nvme_ctrlr_data__bindgen_ty_11() {
    assert_eq!(
        ::std::mem::size_of::<spdk_nvme_ctrlr_data__bindgen_ty_11>(),
        2usize,
        concat!("Size of: ", stringify!(spdk_nvme_ctrlr_data__bindgen_ty_11))
    );
    assert_eq!(
        ::std::mem::align_of::<spdk_nvme_ctrlr_data__bindgen_ty_11>(),
        2usize,
        concat!(
            "Alignment of ",
            stringify!(spdk_nvme_ctrlr_data__bindgen_ty_11)
        )
    );
}
impl Default for spdk_nvme_ctrlr_data__bindgen_ty_11 {
    fn default() -> Self {
        unsafe { ::std::mem::zeroed() }
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union spdk_nvme_ctrlr_data__bindgen_ty_12 {
    pub raw: u32,
    pub bits: spdk_nvme_ctrlr_data__bindgen_ty_12__bindgen_ty_1,
    _bindgen_union_align: u32,
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct spdk_nvme_ctrlr_data__bindgen_ty_12__bindgen_ty_1 {
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 4usize], u32>,
    pub __bindgen_align: [u32; 0usize],
}
#[test]
fn bindgen_test_layout_spdk_nvme_ctrlr_data__bindgen_ty_12__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<spdk_nvme_ctrlr_data__bindgen_ty_12__bindgen_ty_1>(),
        4usize,
        concat!(
            "Size of: ",
            stringify!(spdk_nvme_ctrlr_data__bindgen_ty_12__bindgen_ty_1)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<spdk_nvme_ctrlr_data__bindgen_ty_12__bindgen_ty_1>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(spdk_nvme_ctrlr_data__bindgen_ty_12__bindgen_ty_1)
        )
    );
}
impl spdk_nvme_ctrlr_data__bindgen_ty_12__bindgen_ty_1 {
    #[inline]
    pub fn crypto_erase(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_crypto_erase(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn block_erase(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(1usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_block_erase(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(1usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn overwrite(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(2usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_overwrite(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(2usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn reserved(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(3usize, 29u8) as u32) }
    }
    #[inline]
    pub fn set_reserved(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(3usize, 29u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        crypto_erase: u32,
        block_erase: u32,
        overwrite: u32,
        reserved: u32,
    ) -> __BindgenBitfieldUnit<[u8; 4usize], u32> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 4usize], u32> =
            Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let crypto_erase: u32 = unsafe { ::std::mem::transmute(crypto_erase) };
            crypto_erase as u64
        });
        __bindgen_bitfield_unit.set(1usize, 1u8, {
            let block_erase: u32 = unsafe { ::std::mem::transmute(block_erase) };
            block_erase as u64
        });
        __bindgen_bitfield_unit.set(2usize, 1u8, {
            let overwrite: u32 = unsafe { ::std::mem::transmute(overwrite) };
            overwrite as u64
        });
        __bindgen_bitfield_unit.set(3usize, 29u8, {
            let reserved: u32 = unsafe { ::std::mem::transmute(reserved) };
            reserved as u64
        });
        __bindgen_bitfield_unit
    }
}
#[test]
fn bindgen_test_layout_spdk_nvme_ctrlr_data__bindgen_ty_12() {
    assert_eq!(
        ::std::mem::size_of::<spdk_nvme_ctrlr_data__bindgen_ty_12>(),
        4usize,
        concat!("Size of: ", stringify!(spdk_nvme_ctrlr_data__bindgen_ty_12))
    );
    assert_eq!(
        ::std::mem::align_of::<spdk_nvme_ctrlr_data__bindgen_ty_12>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(spdk_nvme_ctrlr_data__bindgen_ty_12)
        )
    );
}
impl Default for spdk_nvme_ctrlr_data__bindgen_ty_12 {
    fn default() -> Self {
        unsafe { ::std::mem::zeroed() }
    }
}
#[repr(C, packed)]
#[derive(Debug, Default, Copy, Clone)]
pub struct spdk_nvme_ctrlr_data__bindgen_ty_13 {
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 1usize], u8>,
}
#[test]
fn bindgen_test_layout_spdk_nvme_ctrlr_data__bindgen_ty_13() {
    assert_eq!(
        ::std::mem::size_of::<spdk_nvme_ctrlr_data__bindgen_ty_13>(),
        1usize,
        concat!("Size of: ", stringify!(spdk_nvme_ctrlr_data__bindgen_ty_13))
    );
    assert_eq!(
        ::std::mem::align_of::<spdk_nvme_ctrlr_data__bindgen_ty_13>(),
        1usize,
        concat!(
            "Alignment of ",
            stringify!(spdk_nvme_ctrlr_data__bindgen_ty_13)
        )
    );
}
impl spdk_nvme_ctrlr_data__bindgen_ty_13 {
    #[inline]
    pub fn min(&self) -> u8 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 4u8) as u8) }
    }
    #[inline]
    pub fn set_min(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 4u8, val as u64)
        }
    }
    #[inline]
    pub fn max(&self) -> u8 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(4usize, 4u8) as u8) }
    }
    #[inline]
    pub fn set_max(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::std::mem::transmute(val);
            self._bitfield_1.set(4usize, 4u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(min: u8, max: u8) -> __BindgenBitfieldUnit<[u8; 1usize], u8> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize], u8> =
            Default::default();
        __bindgen_bitfield_unit.set(0usize, 4u8, {
            let min: u8 = unsafe { ::std::mem::transmute(min) };
            min as u64
        });
        __bindgen_bitfield_unit.set(4usize, 4u8, {
            let max: u8 = unsafe { ::std::mem::transmute(max) };
            max as u64
        });
        __bindgen_bitfield_unit
    }
}
#[repr(C, packed)]
#[derive(Debug, Default, Copy, Clone)]
pub struct spdk_nvme_ctrlr_data__bindgen_ty_14 {
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 1usize], u8>,
}
#[test]
fn bindgen_test_layout_spdk_nvme_ctrlr_data__bindgen_ty_14() {
    assert_eq!(
        ::std::mem::size_of::<spdk_nvme_ctrlr_data__bindgen_ty_14>(),
        1usize,
        concat!("Size of: ", stringify!(spdk_nvme_ctrlr_data__bindgen_ty_14))
    );
    assert_eq!(
        ::std::mem::align_of::<spdk_nvme_ctrlr_data__bindgen_ty_14>(),
        1usize,
        concat!(
            "Alignment of ",
            stringify!(spdk_nvme_ctrlr_data__bindgen_ty_14)
        )
    );
}
impl spdk_nvme_ctrlr_data__bindgen_ty_14 {
    #[inline]
    pub fn min(&self) -> u8 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 4u8) as u8) }
    }
    #[inline]
    pub fn set_min(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 4u8, val as u64)
        }
    }
    #[inline]
    pub fn max(&self) -> u8 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(4usize, 4u8) as u8) }
    }
    #[inline]
    pub fn set_max(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::std::mem::transmute(val);
            self._bitfield_1.set(4usize, 4u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(min: u8, max: u8) -> __BindgenBitfieldUnit<[u8; 1usize], u8> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize], u8> =
            Default::default();
        __bindgen_bitfield_unit.set(0usize, 4u8, {
            let min: u8 = unsafe { ::std::mem::transmute(min) };
            min as u64
        });
        __bindgen_bitfield_unit.set(4usize, 4u8, {
            let max: u8 = unsafe { ::std::mem::transmute(max) };
            max as u64
        });
        __bindgen_bitfield_unit
    }
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct spdk_nvme_ctrlr_data__bindgen_ty_15 {
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 2usize], u16>,
    pub __bindgen_align: [u16; 0usize],
}
#[test]
fn bindgen_test_layout_spdk_nvme_ctrlr_data__bindgen_ty_15() {
    assert_eq!(
        ::std::mem::size_of::<spdk_nvme_ctrlr_data__bindgen_ty_15>(),
        2usize,
        concat!("Size of: ", stringify!(spdk_nvme_ctrlr_data__bindgen_ty_15))
    );
    assert_eq!(
        ::std::mem::align_of::<spdk_nvme_ctrlr_data__bindgen_ty_15>(),
        2usize,
        concat!(
            "Alignment of ",
            stringify!(spdk_nvme_ctrlr_data__bindgen_ty_15)
        )
    );
}
impl spdk_nvme_ctrlr_data__bindgen_ty_15 {
    #[inline]
    pub fn compare(&self) -> u16 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set_compare(&mut self, val: u16) {
        unsafe {
            let val: u16 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn write_unc(&self) -> u16 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(1usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set_write_unc(&mut self, val: u16) {
        unsafe {
            let val: u16 = ::std::mem::transmute(val);
            self._bitfield_1.set(1usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn dsm(&self) -> u16 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(2usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set_dsm(&mut self, val: u16) {
        unsafe {
            let val: u16 = ::std::mem::transmute(val);
            self._bitfield_1.set(2usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn write_zeroes(&self) -> u16 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(3usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set_write_zeroes(&mut self, val: u16) {
        unsafe {
            let val: u16 = ::std::mem::transmute(val);
            self._bitfield_1.set(3usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn set_features_save(&self) -> u16 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(4usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set_set_features_save(&mut self, val: u16) {
        unsafe {
            let val: u16 = ::std::mem::transmute(val);
            self._bitfield_1.set(4usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn reservations(&self) -> u16 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(5usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set_reservations(&mut self, val: u16) {
        unsafe {
            let val: u16 = ::std::mem::transmute(val);
            self._bitfield_1.set(5usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn timestamp(&self) -> u16 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(6usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set_timestamp(&mut self, val: u16) {
        unsafe {
            let val: u16 = ::std::mem::transmute(val);
            self._bitfield_1.set(6usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn reserved(&self) -> u16 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(7usize, 9u8) as u16) }
    }
    #[inline]
    pub fn set_reserved(&mut self, val: u16) {
        unsafe {
            let val: u16 = ::std::mem::transmute(val);
            self._bitfield_1.set(7usize, 9u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        compare: u16,
        write_unc: u16,
        dsm: u16,
        write_zeroes: u16,
        set_features_save: u16,
        reservations: u16,
        timestamp: u16,
        reserved: u16,
    ) -> __BindgenBitfieldUnit<[u8; 2usize], u16> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 2usize], u16> =
            Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let compare: u16 = unsafe { ::std::mem::transmute(compare) };
            compare as u64
        });
        __bindgen_bitfield_unit.set(1usize, 1u8, {
            let write_unc: u16 = unsafe { ::std::mem::transmute(write_unc) };
            write_unc as u64
        });
        __bindgen_bitfield_unit.set(2usize, 1u8, {
            let dsm: u16 = unsafe { ::std::mem::transmute(dsm) };
            dsm as u64
        });
        __bindgen_bitfield_unit.set(3usize, 1u8, {
            let write_zeroes: u16 = unsafe { ::std::mem::transmute(write_zeroes) };
            write_zeroes as u64
        });
        __bindgen_bitfield_unit.set(4usize, 1u8, {
            let set_features_save: u16 = unsafe { ::std::mem::transmute(set_features_save) };
            set_features_save as u64
        });
        __bindgen_bitfield_unit.set(5usize, 1u8, {
            let reservations: u16 = unsafe { ::std::mem::transmute(reservations) };
            reservations as u64
        });
        __bindgen_bitfield_unit.set(6usize, 1u8, {
            let timestamp: u16 = unsafe { ::std::mem::transmute(timestamp) };
            timestamp as u64
        });
        __bindgen_bitfield_unit.set(7usize, 9u8, {
            let reserved: u16 = unsafe { ::std::mem::transmute(reserved) };
            reserved as u64
        });
        __bindgen_bitfield_unit
    }
}
#[repr(C, packed)]
#[derive(Debug, Default, Copy, Clone)]
pub struct spdk_nvme_ctrlr_data__bindgen_ty_16 {
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 1usize], u8>,
}
#[test]
fn bindgen_test_layout_spdk_nvme_ctrlr_data__bindgen_ty_16() {
    assert_eq!(
        ::std::mem::size_of::<spdk_nvme_ctrlr_data__bindgen_ty_16>(),
        1usize,
        concat!("Size of: ", stringify!(spdk_nvme_ctrlr_data__bindgen_ty_16))
    );
    assert_eq!(
        ::std::mem::align_of::<spdk_nvme_ctrlr_data__bindgen_ty_16>(),
        1usize,
        concat!(
            "Alignment of ",
            stringify!(spdk_nvme_ctrlr_data__bindgen_ty_16)
        )
    );
}
impl spdk_nvme_ctrlr_data__bindgen_ty_16 {
    #[inline]
    pub fn format_all_ns(&self) -> u8 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_format_all_ns(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn erase_all_ns(&self) -> u8 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(1usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_erase_all_ns(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::std::mem::transmute(val);
            self._bitfield_1.set(1usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn crypto_erase_supported(&self) -> u8 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(2usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_crypto_erase_supported(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::std::mem::transmute(val);
            self._bitfield_1.set(2usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn reserved(&self) -> u8 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(3usize, 5u8) as u8) }
    }
    #[inline]
    pub fn set_reserved(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::std::mem::transmute(val);
            self._bitfield_1.set(3usize, 5u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        format_all_ns: u8,
        erase_all_ns: u8,
        crypto_erase_supported: u8,
        reserved: u8,
    ) -> __BindgenBitfieldUnit<[u8; 1usize], u8> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize], u8> =
            Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let format_all_ns: u8 = unsafe { ::std::mem::transmute(format_all_ns) };
            format_all_ns as u64
        });
        __bindgen_bitfield_unit.set(1usize, 1u8, {
            let erase_all_ns: u8 = unsafe { ::std::mem::transmute(erase_all_ns) };
            erase_all_ns as u64
        });
        __bindgen_bitfield_unit.set(2usize, 1u8, {
            let crypto_erase_supported: u8 =
                unsafe { ::std::mem::transmute(crypto_erase_supported) };
            crypto_erase_supported as u64
        });
        __bindgen_bitfield_unit.set(3usize, 5u8, {
            let reserved: u8 = unsafe { ::std::mem::transmute(reserved) };
            reserved as u64
        });
        __bindgen_bitfield_unit
    }
}
#[repr(C, packed)]
#[derive(Debug, Default, Copy, Clone)]
pub struct spdk_nvme_ctrlr_data__bindgen_ty_17 {
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 1usize], u8>,
}
#[test]
fn bindgen_test_layout_spdk_nvme_ctrlr_data__bindgen_ty_17() {
    assert_eq!(
        ::std::mem::size_of::<spdk_nvme_ctrlr_data__bindgen_ty_17>(),
        1usize,
        concat!("Size of: ", stringify!(spdk_nvme_ctrlr_data__bindgen_ty_17))
    );
    assert_eq!(
        ::std::mem::align_of::<spdk_nvme_ctrlr_data__bindgen_ty_17>(),
        1usize,
        concat!(
            "Alignment of ",
            stringify!(spdk_nvme_ctrlr_data__bindgen_ty_17)
        )
    );
}
impl spdk_nvme_ctrlr_data__bindgen_ty_17 {
    #[inline]
    pub fn present(&self) -> u8 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_present(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn flush_broadcast(&self) -> u8 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(1usize, 2u8) as u8) }
    }
    #[inline]
    pub fn set_flush_broadcast(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::std::mem::transmute(val);
            self._bitfield_1.set(1usize, 2u8, val as u64)
        }
    }
    #[inline]
    pub fn reserved(&self) -> u8 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(3usize, 5u8) as u8) }
    }
    #[inline]
    pub fn set_reserved(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::std::mem::transmute(val);
            self._bitfield_1.set(3usize, 5u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        present: u8,
        flush_broadcast: u8,
        reserved: u8,
    ) -> __BindgenBitfieldUnit<[u8; 1usize], u8> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize], u8> =
            Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let present: u8 = unsafe { ::std::mem::transmute(present) };
            present as u64
        });
        __bindgen_bitfield_unit.set(1usize, 2u8, {
            let flush_broadcast: u8 = unsafe { ::std::mem::transmute(flush_broadcast) };
            flush_broadcast as u64
        });
        __bindgen_bitfield_unit.set(3usize, 5u8, {
            let reserved: u8 = unsafe { ::std::mem::transmute(reserved) };
            reserved as u64
        });
        __bindgen_bitfield_unit
    }
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct spdk_nvme_ctrlr_data__bindgen_ty_18 {
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 4usize], u16>,
    pub __bindgen_align: [u32; 0usize],
}
#[test]
fn bindgen_test_layout_spdk_nvme_ctrlr_data__bindgen_ty_18() {
    assert_eq!(
        ::std::mem::size_of::<spdk_nvme_ctrlr_data__bindgen_ty_18>(),
        4usize,
        concat!("Size of: ", stringify!(spdk_nvme_ctrlr_data__bindgen_ty_18))
    );
    assert_eq!(
        ::std::mem::align_of::<spdk_nvme_ctrlr_data__bindgen_ty_18>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(spdk_nvme_ctrlr_data__bindgen_ty_18)
        )
    );
}
impl spdk_nvme_ctrlr_data__bindgen_ty_18 {
    #[inline]
    pub fn supported(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 2u8) as u32) }
    }
    #[inline]
    pub fn set_supported(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 2u8, val as u64)
        }
    }
    #[inline]
    pub fn keyed_sgl(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(2usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_keyed_sgl(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(2usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn reserved1(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(3usize, 13u8) as u32) }
    }
    #[inline]
    pub fn set_reserved1(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(3usize, 13u8, val as u64)
        }
    }
    #[inline]
    pub fn bit_bucket_descriptor(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(16usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_bit_bucket_descriptor(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(16usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn metadata_pointer(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(17usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_metadata_pointer(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(17usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn oversized_sgl(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(18usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_oversized_sgl(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(18usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn metadata_address(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(19usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_metadata_address(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(19usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn sgl_offset(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(20usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_sgl_offset(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(20usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn transport_sgl(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(21usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_transport_sgl(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(21usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn reserved2(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(22usize, 10u8) as u32) }
    }
    #[inline]
    pub fn set_reserved2(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(22usize, 10u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        supported: u32,
        keyed_sgl: u32,
        reserved1: u32,
        bit_bucket_descriptor: u32,
        metadata_pointer: u32,
        oversized_sgl: u32,
        metadata_address: u32,
        sgl_offset: u32,
        transport_sgl: u32,
        reserved2: u32,
    ) -> __BindgenBitfieldUnit<[u8; 4usize], u16> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 4usize], u16> =
            Default::default();
        __bindgen_bitfield_unit.set(0usize, 2u8, {
            let supported: u32 = unsafe { ::std::mem::transmute(supported) };
            supported as u64
        });
        __bindgen_bitfield_unit.set(2usize, 1u8, {
            let keyed_sgl: u32 = unsafe { ::std::mem::transmute(keyed_sgl) };
            keyed_sgl as u64
        });
        __bindgen_bitfield_unit.set(3usize, 13u8, {
            let reserved1: u32 = unsafe { ::std::mem::transmute(reserved1) };
            reserved1 as u64
        });
        __bindgen_bitfield_unit.set(16usize, 1u8, {
            let bit_bucket_descriptor: u32 =
                unsafe { ::std::mem::transmute(bit_bucket_descriptor) };
            bit_bucket_descriptor as u64
        });
        __bindgen_bitfield_unit.set(17usize, 1u8, {
            let metadata_pointer: u32 = unsafe { ::std::mem::transmute(metadata_pointer) };
            metadata_pointer as u64
        });
        __bindgen_bitfield_unit.set(18usize, 1u8, {
            let oversized_sgl: u32 = unsafe { ::std::mem::transmute(oversized_sgl) };
            oversized_sgl as u64
        });
        __bindgen_bitfield_unit.set(19usize, 1u8, {
            let metadata_address: u32 = unsafe { ::std::mem::transmute(metadata_address) };
            metadata_address as u64
        });
        __bindgen_bitfield_unit.set(20usize, 1u8, {
            let sgl_offset: u32 = unsafe { ::std::mem::transmute(sgl_offset) };
            sgl_offset as u64
        });
        __bindgen_bitfield_unit.set(21usize, 1u8, {
            let transport_sgl: u32 = unsafe { ::std::mem::transmute(transport_sgl) };
            transport_sgl as u64
        });
        __bindgen_bitfield_unit.set(22usize, 10u8, {
            let reserved2: u32 = unsafe { ::std::mem::transmute(reserved2) };
            reserved2 as u64
        });
        __bindgen_bitfield_unit
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct spdk_nvme_ctrlr_data__bindgen_ty_19 {
    pub ioccsz: u32,
    pub iorcsz: u32,
    pub icdoff: u16,
    pub ctrattr: spdk_nvme_ctrlr_data__bindgen_ty_19__bindgen_ty_1,
    pub msdbd: u8,
    pub reserved: [u8; 244usize],
}
#[repr(C, packed)]
#[derive(Debug, Default, Copy, Clone)]
pub struct spdk_nvme_ctrlr_data__bindgen_ty_19__bindgen_ty_1 {
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 1usize], u8>,
}
#[test]
fn bindgen_test_layout_spdk_nvme_ctrlr_data__bindgen_ty_19__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<spdk_nvme_ctrlr_data__bindgen_ty_19__bindgen_ty_1>(),
        1usize,
        concat!(
            "Size of: ",
            stringify!(spdk_nvme_ctrlr_data__bindgen_ty_19__bindgen_ty_1)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<spdk_nvme_ctrlr_data__bindgen_ty_19__bindgen_ty_1>(),
        1usize,
        concat!(
            "Alignment of ",
            stringify!(spdk_nvme_ctrlr_data__bindgen_ty_19__bindgen_ty_1)
        )
    );
}
impl spdk_nvme_ctrlr_data__bindgen_ty_19__bindgen_ty_1 {
    #[inline]
    pub fn ctrlr_model(&self) -> u8 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_ctrlr_model(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn reserved(&self) -> u8 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(1usize, 7u8) as u8) }
    }
    #[inline]
    pub fn set_reserved(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::std::mem::transmute(val);
            self._bitfield_1.set(1usize, 7u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        ctrlr_model: u8,
        reserved: u8,
    ) -> __BindgenBitfieldUnit<[u8; 1usize], u8> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize], u8> =
            Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let ctrlr_model: u8 = unsafe { ::std::mem::transmute(ctrlr_model) };
            ctrlr_model as u64
        });
        __bindgen_bitfield_unit.set(1usize, 7u8, {
            let reserved: u8 = unsafe { ::std::mem::transmute(reserved) };
            reserved as u64
        });
        __bindgen_bitfield_unit
    }
}
#[test]
fn bindgen_test_layout_spdk_nvme_ctrlr_data__bindgen_ty_19() {
    assert_eq!(
        ::std::mem::size_of::<spdk_nvme_ctrlr_data__bindgen_ty_19>(),
        256usize,
        concat!("Size of: ", stringify!(spdk_nvme_ctrlr_data__bindgen_ty_19))
    );
    assert_eq!(
        ::std::mem::align_of::<spdk_nvme_ctrlr_data__bindgen_ty_19>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(spdk_nvme_ctrlr_data__bindgen_ty_19)
        )
    );
}
impl Default for spdk_nvme_ctrlr_data__bindgen_ty_19 {
    fn default() -> Self {
        unsafe { ::std::mem::zeroed() }
    }
}
#[test]
fn bindgen_test_layout_spdk_nvme_ctrlr_data() {
    assert_eq!(
        ::std::mem::size_of::<spdk_nvme_ctrlr_data>(),
        4096usize,
        concat!("Size of: ", stringify!(spdk_nvme_ctrlr_data))
    );
    assert_eq!(
        ::std::mem::align_of::<spdk_nvme_ctrlr_data>(),
        1usize,
        concat!("Alignment of ", stringify!(spdk_nvme_ctrlr_data))
    );
}
impl Default for spdk_nvme_ctrlr_data {
    fn default() -> Self {
        unsafe { ::std::mem::zeroed() }
    }
}
#[repr(C, packed)]
#[derive(Copy, Clone)]
pub struct spdk_nvme_primary_ctrl_capabilities {
    pub cntlid: u16,
    pub portid: u16,
    pub crt: spdk_nvme_primary_ctrl_capabilities__bindgen_ty_1,
    pub reserved: [u8; 27usize],
    pub vqfrt: u32,
    pub vqrfa: u32,
    pub vqrfap: u16,
    pub vqprt: u16,
    pub vqfrsm: u16,
    pub vqgran: u16,
    pub reserved1: [u8; 16usize],
    pub vifrt: u32,
    pub virfa: u32,
    pub virfap: u16,
    pub viprt: u16,
    pub vifrsm: u16,
    pub vigran: u16,
    pub reserved2: [u8; 4016usize],
}
#[repr(C, packed)]
#[derive(Debug, Default, Copy, Clone)]
pub struct spdk_nvme_primary_ctrl_capabilities__bindgen_ty_1 {
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 1usize], u8>,
}
#[test]
fn bindgen_test_layout_spdk_nvme_primary_ctrl_capabilities__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<spdk_nvme_primary_ctrl_capabilities__bindgen_ty_1>(),
        1usize,
        concat!(
            "Size of: ",
            stringify!(spdk_nvme_primary_ctrl_capabilities__bindgen_ty_1)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<spdk_nvme_primary_ctrl_capabilities__bindgen_ty_1>(),
        1usize,
        concat!(
            "Alignment of ",
            stringify!(spdk_nvme_primary_ctrl_capabilities__bindgen_ty_1)
        )
    );
}
impl spdk_nvme_primary_ctrl_capabilities__bindgen_ty_1 {
    #[inline]
    pub fn vq_supported(&self) -> u8 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_vq_supported(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn vi_supported(&self) -> u8 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(1usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_vi_supported(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::std::mem::transmute(val);
            self._bitfield_1.set(1usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn reserved(&self) -> u8 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(2usize, 6u8) as u8) }
    }
    #[inline]
    pub fn set_reserved(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::std::mem::transmute(val);
            self._bitfield_1.set(2usize, 6u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        vq_supported: u8,
        vi_supported: u8,
        reserved: u8,
    ) -> __BindgenBitfieldUnit<[u8; 1usize], u8> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize], u8> =
            Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let vq_supported: u8 = unsafe { ::std::mem::transmute(vq_supported) };
            vq_supported as u64
        });
        __bindgen_bitfield_unit.set(1usize, 1u8, {
            let vi_supported: u8 = unsafe { ::std::mem::transmute(vi_supported) };
            vi_supported as u64
        });
        __bindgen_bitfield_unit.set(2usize, 6u8, {
            let reserved: u8 = unsafe { ::std::mem::transmute(reserved) };
            reserved as u64
        });
        __bindgen_bitfield_unit
    }
}
#[test]
fn bindgen_test_layout_spdk_nvme_primary_ctrl_capabilities() {
    assert_eq!(
        ::std::mem::size_of::<spdk_nvme_primary_ctrl_capabilities>(),
        4096usize,
        concat!("Size of: ", stringify!(spdk_nvme_primary_ctrl_capabilities))
    );
    assert_eq!(
        ::std::mem::align_of::<spdk_nvme_primary_ctrl_capabilities>(),
        1usize,
        concat!(
            "Alignment of ",
            stringify!(spdk_nvme_primary_ctrl_capabilities)
        )
    );
}
impl Default for spdk_nvme_primary_ctrl_capabilities {
    fn default() -> Self {
        unsafe { ::std::mem::zeroed() }
    }
}
#[repr(C, packed)]
#[derive(Debug, Default, Copy, Clone)]
pub struct spdk_nvme_secondary_ctrl_entry {
    pub scid: u16,
    pub pcid: u16,
    pub scs: spdk_nvme_secondary_ctrl_entry__bindgen_ty_1,
    pub reserved: [u8; 3usize],
    pub vfn: u16,
    pub nvq: u16,
    pub nvi: u16,
    pub reserved1: [u8; 18usize],
}
#[repr(C, packed)]
#[derive(Debug, Default, Copy, Clone)]
pub struct spdk_nvme_secondary_ctrl_entry__bindgen_ty_1 {
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 1usize], u8>,
}
#[test]
fn bindgen_test_layout_spdk_nvme_secondary_ctrl_entry__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<spdk_nvme_secondary_ctrl_entry__bindgen_ty_1>(),
        1usize,
        concat!(
            "Size of: ",
            stringify!(spdk_nvme_secondary_ctrl_entry__bindgen_ty_1)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<spdk_nvme_secondary_ctrl_entry__bindgen_ty_1>(),
        1usize,
        concat!(
            "Alignment of ",
            stringify!(spdk_nvme_secondary_ctrl_entry__bindgen_ty_1)
        )
    );
}
impl spdk_nvme_secondary_ctrl_entry__bindgen_ty_1 {
    #[inline]
    pub fn is_online(&self) -> u8 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_is_online(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn reserved(&self) -> u8 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(1usize, 7u8) as u8) }
    }
    #[inline]
    pub fn set_reserved(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::std::mem::transmute(val);
            self._bitfield_1.set(1usize, 7u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(is_online: u8, reserved: u8) -> __BindgenBitfieldUnit<[u8; 1usize], u8> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize], u8> =
            Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let is_online: u8 = unsafe { ::std::mem::transmute(is_online) };
            is_online as u64
        });
        __bindgen_bitfield_unit.set(1usize, 7u8, {
            let reserved: u8 = unsafe { ::std::mem::transmute(reserved) };
            reserved as u64
        });
        __bindgen_bitfield_unit
    }
}
#[test]
fn bindgen_test_layout_spdk_nvme_secondary_ctrl_entry() {
    assert_eq!(
        ::std::mem::size_of::<spdk_nvme_secondary_ctrl_entry>(),
        32usize,
        concat!("Size of: ", stringify!(spdk_nvme_secondary_ctrl_entry))
    );
    assert_eq!(
        ::std::mem::align_of::<spdk_nvme_secondary_ctrl_entry>(),
        1usize,
        concat!("Alignment of ", stringify!(spdk_nvme_secondary_ctrl_entry))
    );
}
#[repr(C, packed)]
#[derive(Copy, Clone)]
pub struct spdk_nvme_secondary_ctrl_list {
    pub number: u8,
    pub reserved: [u8; 31usize],
    pub entries: [spdk_nvme_secondary_ctrl_entry; 127usize],
}
#[test]
fn bindgen_test_layout_spdk_nvme_secondary_ctrl_list() {
    assert_eq!(
        ::std::mem::size_of::<spdk_nvme_secondary_ctrl_list>(),
        4096usize,
        concat!("Size of: ", stringify!(spdk_nvme_secondary_ctrl_list))
    );
    assert_eq!(
        ::std::mem::align_of::<spdk_nvme_secondary_ctrl_list>(),
        1usize,
        concat!("Alignment of ", stringify!(spdk_nvme_secondary_ctrl_list))
    );
}
impl Default for spdk_nvme_secondary_ctrl_list {
    fn default() -> Self {
        unsafe { ::std::mem::zeroed() }
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct spdk_nvme_ns_data {
    pub nsze: u64,
    pub ncap: u64,
    pub nuse: u64,
    pub nsfeat: spdk_nvme_ns_data__bindgen_ty_1,
    pub nlbaf: u8,
    pub flbas: spdk_nvme_ns_data__bindgen_ty_2,
    pub mc: spdk_nvme_ns_data__bindgen_ty_3,
    pub dpc: spdk_nvme_ns_data__bindgen_ty_4,
    pub dps: spdk_nvme_ns_data__bindgen_ty_5,
    pub nmic: spdk_nvme_ns_data__bindgen_ty_6,
    pub nsrescap: spdk_nvme_ns_data__bindgen_ty_7,
    pub fpi: spdk_nvme_ns_data__bindgen_ty_8,
    pub dlfeat: spdk_nvme_ns_data__bindgen_ty_9,
    pub nawun: u16,
    pub nawupf: u16,
    pub nacwu: u16,
    pub nabsn: u16,
    pub nabo: u16,
    pub nabspf: u16,
    pub noiob: u16,
    pub nvmcap: [u64; 2usize],
    pub reserved64: [u8; 40usize],
    pub nguid: [u8; 16usize],
    pub eui64: u64,
    pub lbaf: [spdk_nvme_ns_data__bindgen_ty_10; 16usize],
    pub reserved6: [u8; 192usize],
    pub vendor_specific: [u8; 3712usize],
}
#[repr(C, packed)]
#[derive(Debug, Default, Copy, Clone)]
pub struct spdk_nvme_ns_data__bindgen_ty_1 {
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 1usize], u8>,
}
#[test]
fn bindgen_test_layout_spdk_nvme_ns_data__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<spdk_nvme_ns_data__bindgen_ty_1>(),
        1usize,
        concat!("Size of: ", stringify!(spdk_nvme_ns_data__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<spdk_nvme_ns_data__bindgen_ty_1>(),
        1usize,
        concat!("Alignment of ", stringify!(spdk_nvme_ns_data__bindgen_ty_1))
    );
}
impl spdk_nvme_ns_data__bindgen_ty_1 {
    #[inline]
    pub fn thin_prov(&self) -> u8 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_thin_prov(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn ns_atomic_write_unit(&self) -> u8 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(1usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_ns_atomic_write_unit(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::std::mem::transmute(val);
            self._bitfield_1.set(1usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn dealloc_or_unwritten_error(&self) -> u8 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(2usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_dealloc_or_unwritten_error(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::std::mem::transmute(val);
            self._bitfield_1.set(2usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn guid_never_reused(&self) -> u8 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(3usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_guid_never_reused(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::std::mem::transmute(val);
            self._bitfield_1.set(3usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn reserved1(&self) -> u8 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(4usize, 4u8) as u8) }
    }
    #[inline]
    pub fn set_reserved1(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::std::mem::transmute(val);
            self._bitfield_1.set(4usize, 4u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        thin_prov: u8,
        ns_atomic_write_unit: u8,
        dealloc_or_unwritten_error: u8,
        guid_never_reused: u8,
        reserved1: u8,
    ) -> __BindgenBitfieldUnit<[u8; 1usize], u8> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize], u8> =
            Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let thin_prov: u8 = unsafe { ::std::mem::transmute(thin_prov) };
            thin_prov as u64
        });
        __bindgen_bitfield_unit.set(1usize, 1u8, {
            let ns_atomic_write_unit: u8 = unsafe { ::std::mem::transmute(ns_atomic_write_unit) };
            ns_atomic_write_unit as u64
        });
        __bindgen_bitfield_unit.set(2usize, 1u8, {
            let dealloc_or_unwritten_error: u8 =
                unsafe { ::std::mem::transmute(dealloc_or_unwritten_error) };
            dealloc_or_unwritten_error as u64
        });
        __bindgen_bitfield_unit.set(3usize, 1u8, {
            let guid_never_reused: u8 = unsafe { ::std::mem::transmute(guid_never_reused) };
            guid_never_reused as u64
        });
        __bindgen_bitfield_unit.set(4usize, 4u8, {
            let reserved1: u8 = unsafe { ::std::mem::transmute(reserved1) };
            reserved1 as u64
        });
        __bindgen_bitfield_unit
    }
}
#[repr(C, packed)]
#[derive(Debug, Default, Copy, Clone)]
pub struct spdk_nvme_ns_data__bindgen_ty_2 {
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 1usize], u8>,
}
#[test]
fn bindgen_test_layout_spdk_nvme_ns_data__bindgen_ty_2() {
    assert_eq!(
        ::std::mem::size_of::<spdk_nvme_ns_data__bindgen_ty_2>(),
        1usize,
        concat!("Size of: ", stringify!(spdk_nvme_ns_data__bindgen_ty_2))
    );
    assert_eq!(
        ::std::mem::align_of::<spdk_nvme_ns_data__bindgen_ty_2>(),
        1usize,
        concat!("Alignment of ", stringify!(spdk_nvme_ns_data__bindgen_ty_2))
    );
}
impl spdk_nvme_ns_data__bindgen_ty_2 {
    #[inline]
    pub fn format(&self) -> u8 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 4u8) as u8) }
    }
    #[inline]
    pub fn set_format(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 4u8, val as u64)
        }
    }
    #[inline]
    pub fn extended(&self) -> u8 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(4usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_extended(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::std::mem::transmute(val);
            self._bitfield_1.set(4usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn reserved2(&self) -> u8 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(5usize, 3u8) as u8) }
    }
    #[inline]
    pub fn set_reserved2(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::std::mem::transmute(val);
            self._bitfield_1.set(5usize, 3u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        format: u8,
        extended: u8,
        reserved2: u8,
    ) -> __BindgenBitfieldUnit<[u8; 1usize], u8> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize], u8> =
            Default::default();
        __bindgen_bitfield_unit.set(0usize, 4u8, {
            let format: u8 = unsafe { ::std::mem::transmute(format) };
            format as u64
        });
        __bindgen_bitfield_unit.set(4usize, 1u8, {
            let extended: u8 = unsafe { ::std::mem::transmute(extended) };
            extended as u64
        });
        __bindgen_bitfield_unit.set(5usize, 3u8, {
            let reserved2: u8 = unsafe { ::std::mem::transmute(reserved2) };
            reserved2 as u64
        });
        __bindgen_bitfield_unit
    }
}
#[repr(C, packed)]
#[derive(Debug, Default, Copy, Clone)]
pub struct spdk_nvme_ns_data__bindgen_ty_3 {
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 1usize], u8>,
}
#[test]
fn bindgen_test_layout_spdk_nvme_ns_data__bindgen_ty_3() {
    assert_eq!(
        ::std::mem::size_of::<spdk_nvme_ns_data__bindgen_ty_3>(),
        1usize,
        concat!("Size of: ", stringify!(spdk_nvme_ns_data__bindgen_ty_3))
    );
    assert_eq!(
        ::std::mem::align_of::<spdk_nvme_ns_data__bindgen_ty_3>(),
        1usize,
        concat!("Alignment of ", stringify!(spdk_nvme_ns_data__bindgen_ty_3))
    );
}
impl spdk_nvme_ns_data__bindgen_ty_3 {
    #[inline]
    pub fn extended(&self) -> u8 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_extended(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn pointer(&self) -> u8 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(1usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_pointer(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::std::mem::transmute(val);
            self._bitfield_1.set(1usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn reserved3(&self) -> u8 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(2usize, 6u8) as u8) }
    }
    #[inline]
    pub fn set_reserved3(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::std::mem::transmute(val);
            self._bitfield_1.set(2usize, 6u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        extended: u8,
        pointer: u8,
        reserved3: u8,
    ) -> __BindgenBitfieldUnit<[u8; 1usize], u8> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize], u8> =
            Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let extended: u8 = unsafe { ::std::mem::transmute(extended) };
            extended as u64
        });
        __bindgen_bitfield_unit.set(1usize, 1u8, {
            let pointer: u8 = unsafe { ::std::mem::transmute(pointer) };
            pointer as u64
        });
        __bindgen_bitfield_unit.set(2usize, 6u8, {
            let reserved3: u8 = unsafe { ::std::mem::transmute(reserved3) };
            reserved3 as u64
        });
        __bindgen_bitfield_unit
    }
}
#[repr(C, packed)]
#[derive(Debug, Default, Copy, Clone)]
pub struct spdk_nvme_ns_data__bindgen_ty_4 {
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 1usize], u8>,
}
#[test]
fn bindgen_test_layout_spdk_nvme_ns_data__bindgen_ty_4() {
    assert_eq!(
        ::std::mem::size_of::<spdk_nvme_ns_data__bindgen_ty_4>(),
        1usize,
        concat!("Size of: ", stringify!(spdk_nvme_ns_data__bindgen_ty_4))
    );
    assert_eq!(
        ::std::mem::align_of::<spdk_nvme_ns_data__bindgen_ty_4>(),
        1usize,
        concat!("Alignment of ", stringify!(spdk_nvme_ns_data__bindgen_ty_4))
    );
}
impl spdk_nvme_ns_data__bindgen_ty_4 {
    #[inline]
    pub fn pit1(&self) -> u8 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_pit1(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn pit2(&self) -> u8 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(1usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_pit2(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::std::mem::transmute(val);
            self._bitfield_1.set(1usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn pit3(&self) -> u8 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(2usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_pit3(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::std::mem::transmute(val);
            self._bitfield_1.set(2usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn md_start(&self) -> u8 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(3usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_md_start(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::std::mem::transmute(val);
            self._bitfield_1.set(3usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn md_end(&self) -> u8 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(4usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_md_end(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::std::mem::transmute(val);
            self._bitfield_1.set(4usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        pit1: u8,
        pit2: u8,
        pit3: u8,
        md_start: u8,
        md_end: u8,
    ) -> __BindgenBitfieldUnit<[u8; 1usize], u8> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize], u8> =
            Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let pit1: u8 = unsafe { ::std::mem::transmute(pit1) };
            pit1 as u64
        });
        __bindgen_bitfield_unit.set(1usize, 1u8, {
            let pit2: u8 = unsafe { ::std::mem::transmute(pit2) };
            pit2 as u64
        });
        __bindgen_bitfield_unit.set(2usize, 1u8, {
            let pit3: u8 = unsafe { ::std::mem::transmute(pit3) };
            pit3 as u64
        });
        __bindgen_bitfield_unit.set(3usize, 1u8, {
            let md_start: u8 = unsafe { ::std::mem::transmute(md_start) };
            md_start as u64
        });
        __bindgen_bitfield_unit.set(4usize, 1u8, {
            let md_end: u8 = unsafe { ::std::mem::transmute(md_end) };
            md_end as u64
        });
        __bindgen_bitfield_unit
    }
}
#[repr(C, packed)]
#[derive(Debug, Default, Copy, Clone)]
pub struct spdk_nvme_ns_data__bindgen_ty_5 {
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 1usize], u8>,
}
#[test]
fn bindgen_test_layout_spdk_nvme_ns_data__bindgen_ty_5() {
    assert_eq!(
        ::std::mem::size_of::<spdk_nvme_ns_data__bindgen_ty_5>(),
        1usize,
        concat!("Size of: ", stringify!(spdk_nvme_ns_data__bindgen_ty_5))
    );
    assert_eq!(
        ::std::mem::align_of::<spdk_nvme_ns_data__bindgen_ty_5>(),
        1usize,
        concat!("Alignment of ", stringify!(spdk_nvme_ns_data__bindgen_ty_5))
    );
}
impl spdk_nvme_ns_data__bindgen_ty_5 {
    #[inline]
    pub fn pit(&self) -> u8 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 3u8) as u8) }
    }
    #[inline]
    pub fn set_pit(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 3u8, val as u64)
        }
    }
    #[inline]
    pub fn md_start(&self) -> u8 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(3usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_md_start(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::std::mem::transmute(val);
            self._bitfield_1.set(3usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn reserved4(&self) -> u8 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(4usize, 4u8) as u8) }
    }
    #[inline]
    pub fn set_reserved4(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::std::mem::transmute(val);
            self._bitfield_1.set(4usize, 4u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        pit: u8,
        md_start: u8,
        reserved4: u8,
    ) -> __BindgenBitfieldUnit<[u8; 1usize], u8> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize], u8> =
            Default::default();
        __bindgen_bitfield_unit.set(0usize, 3u8, {
            let pit: u8 = unsafe { ::std::mem::transmute(pit) };
            pit as u64
        });
        __bindgen_bitfield_unit.set(3usize, 1u8, {
            let md_start: u8 = unsafe { ::std::mem::transmute(md_start) };
            md_start as u64
        });
        __bindgen_bitfield_unit.set(4usize, 4u8, {
            let reserved4: u8 = unsafe { ::std::mem::transmute(reserved4) };
            reserved4 as u64
        });
        __bindgen_bitfield_unit
    }
}
#[repr(C, packed)]
#[derive(Debug, Default, Copy, Clone)]
pub struct spdk_nvme_ns_data__bindgen_ty_6 {
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 1usize], u8>,
}
#[test]
fn bindgen_test_layout_spdk_nvme_ns_data__bindgen_ty_6() {
    assert_eq!(
        ::std::mem::size_of::<spdk_nvme_ns_data__bindgen_ty_6>(),
        1usize,
        concat!("Size of: ", stringify!(spdk_nvme_ns_data__bindgen_ty_6))
    );
    assert_eq!(
        ::std::mem::align_of::<spdk_nvme_ns_data__bindgen_ty_6>(),
        1usize,
        concat!("Alignment of ", stringify!(spdk_nvme_ns_data__bindgen_ty_6))
    );
}
impl spdk_nvme_ns_data__bindgen_ty_6 {
    #[inline]
    pub fn can_share(&self) -> u8 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_can_share(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn reserved(&self) -> u8 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(1usize, 7u8) as u8) }
    }
    #[inline]
    pub fn set_reserved(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::std::mem::transmute(val);
            self._bitfield_1.set(1usize, 7u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(can_share: u8, reserved: u8) -> __BindgenBitfieldUnit<[u8; 1usize], u8> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize], u8> =
            Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let can_share: u8 = unsafe { ::std::mem::transmute(can_share) };
            can_share as u64
        });
        __bindgen_bitfield_unit.set(1usize, 7u8, {
            let reserved: u8 = unsafe { ::std::mem::transmute(reserved) };
            reserved as u64
        });
        __bindgen_bitfield_unit
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union spdk_nvme_ns_data__bindgen_ty_7 {
    pub rescap: spdk_nvme_ns_data__bindgen_ty_7__bindgen_ty_1,
    pub raw: u8,
    _bindgen_union_align: u8,
}
#[repr(C, packed)]
#[derive(Debug, Default, Copy, Clone)]
pub struct spdk_nvme_ns_data__bindgen_ty_7__bindgen_ty_1 {
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 1usize], u8>,
}
#[test]
fn bindgen_test_layout_spdk_nvme_ns_data__bindgen_ty_7__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<spdk_nvme_ns_data__bindgen_ty_7__bindgen_ty_1>(),
        1usize,
        concat!(
            "Size of: ",
            stringify!(spdk_nvme_ns_data__bindgen_ty_7__bindgen_ty_1)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<spdk_nvme_ns_data__bindgen_ty_7__bindgen_ty_1>(),
        1usize,
        concat!(
            "Alignment of ",
            stringify!(spdk_nvme_ns_data__bindgen_ty_7__bindgen_ty_1)
        )
    );
}
impl spdk_nvme_ns_data__bindgen_ty_7__bindgen_ty_1 {
    #[inline]
    pub fn persist(&self) -> u8 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_persist(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn write_exclusive(&self) -> u8 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(1usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_write_exclusive(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::std::mem::transmute(val);
            self._bitfield_1.set(1usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn exclusive_access(&self) -> u8 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(2usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_exclusive_access(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::std::mem::transmute(val);
            self._bitfield_1.set(2usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn write_exclusive_reg_only(&self) -> u8 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(3usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_write_exclusive_reg_only(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::std::mem::transmute(val);
            self._bitfield_1.set(3usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn exclusive_access_reg_only(&self) -> u8 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(4usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_exclusive_access_reg_only(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::std::mem::transmute(val);
            self._bitfield_1.set(4usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn write_exclusive_all_reg(&self) -> u8 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(5usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_write_exclusive_all_reg(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::std::mem::transmute(val);
            self._bitfield_1.set(5usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn exclusive_access_all_reg(&self) -> u8 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(6usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_exclusive_access_all_reg(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::std::mem::transmute(val);
            self._bitfield_1.set(6usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn ignore_existing_key(&self) -> u8 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(7usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_ignore_existing_key(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::std::mem::transmute(val);
            self._bitfield_1.set(7usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        persist: u8,
        write_exclusive: u8,
        exclusive_access: u8,
        write_exclusive_reg_only: u8,
        exclusive_access_reg_only: u8,
        write_exclusive_all_reg: u8,
        exclusive_access_all_reg: u8,
        ignore_existing_key: u8,
    ) -> __BindgenBitfieldUnit<[u8; 1usize], u8> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize], u8> =
            Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let persist: u8 = unsafe { ::std::mem::transmute(persist) };
            persist as u64
        });
        __bindgen_bitfield_unit.set(1usize, 1u8, {
            let write_exclusive: u8 = unsafe { ::std::mem::transmute(write_exclusive) };
            write_exclusive as u64
        });
        __bindgen_bitfield_unit.set(2usize, 1u8, {
            let exclusive_access: u8 = unsafe { ::std::mem::transmute(exclusive_access) };
            exclusive_access as u64
        });
        __bindgen_bitfield_unit.set(3usize, 1u8, {
            let write_exclusive_reg_only: u8 =
                unsafe { ::std::mem::transmute(write_exclusive_reg_only) };
            write_exclusive_reg_only as u64
        });
        __bindgen_bitfield_unit.set(4usize, 1u8, {
            let exclusive_access_reg_only: u8 =
                unsafe { ::std::mem::transmute(exclusive_access_reg_only) };
            exclusive_access_reg_only as u64
        });
        __bindgen_bitfield_unit.set(5usize, 1u8, {
            let write_exclusive_all_reg: u8 =
                unsafe { ::std::mem::transmute(write_exclusive_all_reg) };
            write_exclusive_all_reg as u64
        });
        __bindgen_bitfield_unit.set(6usize, 1u8, {
            let exclusive_access_all_reg: u8 =
                unsafe { ::std::mem::transmute(exclusive_access_all_reg) };
            exclusive_access_all_reg as u64
        });
        __bindgen_bitfield_unit.set(7usize, 1u8, {
            let ignore_existing_key: u8 = unsafe { ::std::mem::transmute(ignore_existing_key) };
            ignore_existing_key as u64
        });
        __bindgen_bitfield_unit
    }
}
#[test]
fn bindgen_test_layout_spdk_nvme_ns_data__bindgen_ty_7() {
    assert_eq!(
        ::std::mem::size_of::<spdk_nvme_ns_data__bindgen_ty_7>(),
        1usize,
        concat!("Size of: ", stringify!(spdk_nvme_ns_data__bindgen_ty_7))
    );
    assert_eq!(
        ::std::mem::align_of::<spdk_nvme_ns_data__bindgen_ty_7>(),
        1usize,
        concat!("Alignment of ", stringify!(spdk_nvme_ns_data__bindgen_ty_7))
    );
}
impl Default for spdk_nvme_ns_data__bindgen_ty_7 {
    fn default() -> Self {
        unsafe { ::std::mem::zeroed() }
    }
}
#[repr(C, packed)]
#[derive(Debug, Default, Copy, Clone)]
pub struct spdk_nvme_ns_data__bindgen_ty_8 {
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 1usize], u8>,
}
#[test]
fn bindgen_test_layout_spdk_nvme_ns_data__bindgen_ty_8() {
    assert_eq!(
        ::std::mem::size_of::<spdk_nvme_ns_data__bindgen_ty_8>(),
        1usize,
        concat!("Size of: ", stringify!(spdk_nvme_ns_data__bindgen_ty_8))
    );
    assert_eq!(
        ::std::mem::align_of::<spdk_nvme_ns_data__bindgen_ty_8>(),
        1usize,
        concat!("Alignment of ", stringify!(spdk_nvme_ns_data__bindgen_ty_8))
    );
}
impl spdk_nvme_ns_data__bindgen_ty_8 {
    #[inline]
    pub fn percentage_remaining(&self) -> u8 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 7u8) as u8) }
    }
    #[inline]
    pub fn set_percentage_remaining(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 7u8, val as u64)
        }
    }
    #[inline]
    pub fn fpi_supported(&self) -> u8 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(7usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_fpi_supported(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::std::mem::transmute(val);
            self._bitfield_1.set(7usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        percentage_remaining: u8,
        fpi_supported: u8,
    ) -> __BindgenBitfieldUnit<[u8; 1usize], u8> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize], u8> =
            Default::default();
        __bindgen_bitfield_unit.set(0usize, 7u8, {
            let percentage_remaining: u8 = unsafe { ::std::mem::transmute(percentage_remaining) };
            percentage_remaining as u64
        });
        __bindgen_bitfield_unit.set(7usize, 1u8, {
            let fpi_supported: u8 = unsafe { ::std::mem::transmute(fpi_supported) };
            fpi_supported as u64
        });
        __bindgen_bitfield_unit
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union spdk_nvme_ns_data__bindgen_ty_9 {
    pub raw: u8,
    pub bits: spdk_nvme_ns_data__bindgen_ty_9__bindgen_ty_1,
    _bindgen_union_align: u8,
}
#[repr(C, packed)]
#[derive(Debug, Default, Copy, Clone)]
pub struct spdk_nvme_ns_data__bindgen_ty_9__bindgen_ty_1 {
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 1usize], u8>,
}
#[test]
fn bindgen_test_layout_spdk_nvme_ns_data__bindgen_ty_9__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<spdk_nvme_ns_data__bindgen_ty_9__bindgen_ty_1>(),
        1usize,
        concat!(
            "Size of: ",
            stringify!(spdk_nvme_ns_data__bindgen_ty_9__bindgen_ty_1)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<spdk_nvme_ns_data__bindgen_ty_9__bindgen_ty_1>(),
        1usize,
        concat!(
            "Alignment of ",
            stringify!(spdk_nvme_ns_data__bindgen_ty_9__bindgen_ty_1)
        )
    );
}
impl spdk_nvme_ns_data__bindgen_ty_9__bindgen_ty_1 {
    #[inline]
    pub fn read_value(&self) -> u8 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 3u8) as u8) }
    }
    #[inline]
    pub fn set_read_value(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 3u8, val as u64)
        }
    }
    #[inline]
    pub fn write_zero_deallocate(&self) -> u8 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(3usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_write_zero_deallocate(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::std::mem::transmute(val);
            self._bitfield_1.set(3usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn guard_value(&self) -> u8 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(4usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_guard_value(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::std::mem::transmute(val);
            self._bitfield_1.set(4usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn reserved(&self) -> u8 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(5usize, 3u8) as u8) }
    }
    #[inline]
    pub fn set_reserved(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::std::mem::transmute(val);
            self._bitfield_1.set(5usize, 3u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        read_value: u8,
        write_zero_deallocate: u8,
        guard_value: u8,
        reserved: u8,
    ) -> __BindgenBitfieldUnit<[u8; 1usize], u8> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize], u8> =
            Default::default();
        __bindgen_bitfield_unit.set(0usize, 3u8, {
            let read_value: u8 = unsafe { ::std::mem::transmute(read_value) };
            read_value as u64
        });
        __bindgen_bitfield_unit.set(3usize, 1u8, {
            let write_zero_deallocate: u8 = unsafe { ::std::mem::transmute(write_zero_deallocate) };
            write_zero_deallocate as u64
        });
        __bindgen_bitfield_unit.set(4usize, 1u8, {
            let guard_value: u8 = unsafe { ::std::mem::transmute(guard_value) };
            guard_value as u64
        });
        __bindgen_bitfield_unit.set(5usize, 3u8, {
            let reserved: u8 = unsafe { ::std::mem::transmute(reserved) };
            reserved as u64
        });
        __bindgen_bitfield_unit
    }
}
#[test]
fn bindgen_test_layout_spdk_nvme_ns_data__bindgen_ty_9() {
    assert_eq!(
        ::std::mem::size_of::<spdk_nvme_ns_data__bindgen_ty_9>(),
        1usize,
        concat!("Size of: ", stringify!(spdk_nvme_ns_data__bindgen_ty_9))
    );
    assert_eq!(
        ::std::mem::align_of::<spdk_nvme_ns_data__bindgen_ty_9>(),
        1usize,
        concat!("Alignment of ", stringify!(spdk_nvme_ns_data__bindgen_ty_9))
    );
}
impl Default for spdk_nvme_ns_data__bindgen_ty_9 {
    fn default() -> Self {
        unsafe { ::std::mem::zeroed() }
    }
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct spdk_nvme_ns_data__bindgen_ty_10 {
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 4usize], u16>,
    pub __bindgen_align: [u32; 0usize],
}
#[test]
fn bindgen_test_layout_spdk_nvme_ns_data__bindgen_ty_10() {
    assert_eq!(
        ::std::mem::size_of::<spdk_nvme_ns_data__bindgen_ty_10>(),
        4usize,
        concat!("Size of: ", stringify!(spdk_nvme_ns_data__bindgen_ty_10))
    );
    assert_eq!(
        ::std::mem::align_of::<spdk_nvme_ns_data__bindgen_ty_10>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(spdk_nvme_ns_data__bindgen_ty_10)
        )
    );
}
impl spdk_nvme_ns_data__bindgen_ty_10 {
    #[inline]
    pub fn ms(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 16u8) as u32) }
    }
    #[inline]
    pub fn set_ms(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 16u8, val as u64)
        }
    }
    #[inline]
    pub fn lbads(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(16usize, 8u8) as u32) }
    }
    #[inline]
    pub fn set_lbads(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(16usize, 8u8, val as u64)
        }
    }
    #[inline]
    pub fn rp(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(24usize, 2u8) as u32) }
    }
    #[inline]
    pub fn set_rp(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(24usize, 2u8, val as u64)
        }
    }
    #[inline]
    pub fn reserved6(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(26usize, 6u8) as u32) }
    }
    #[inline]
    pub fn set_reserved6(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(26usize, 6u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        ms: u32,
        lbads: u32,
        rp: u32,
        reserved6: u32,
    ) -> __BindgenBitfieldUnit<[u8; 4usize], u16> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 4usize], u16> =
            Default::default();
        __bindgen_bitfield_unit.set(0usize, 16u8, {
            let ms: u32 = unsafe { ::std::mem::transmute(ms) };
            ms as u64
        });
        __bindgen_bitfield_unit.set(16usize, 8u8, {
            let lbads: u32 = unsafe { ::std::mem::transmute(lbads) };
            lbads as u64
        });
        __bindgen_bitfield_unit.set(24usize, 2u8, {
            let rp: u32 = unsafe { ::std::mem::transmute(rp) };
            rp as u64
        });
        __bindgen_bitfield_unit.set(26usize, 6u8, {
            let reserved6: u32 = unsafe { ::std::mem::transmute(reserved6) };
            reserved6 as u64
        });
        __bindgen_bitfield_unit
    }
}
#[test]
fn bindgen_test_layout_spdk_nvme_ns_data() {
    assert_eq!(
        ::std::mem::size_of::<spdk_nvme_ns_data>(),
        4096usize,
        concat!("Size of: ", stringify!(spdk_nvme_ns_data))
    );
    assert_eq!(
        ::std::mem::align_of::<spdk_nvme_ns_data>(),
        8usize,
        concat!("Alignment of ", stringify!(spdk_nvme_ns_data))
    );
}
impl Default for spdk_nvme_ns_data {
    fn default() -> Self {
        unsafe { ::std::mem::zeroed() }
    }
}
pub const spdk_nvme_dealloc_logical_block_read_value_SPDK_NVME_DEALLOC_NOT_REPORTED:
    spdk_nvme_dealloc_logical_block_read_value = 0;
pub const spdk_nvme_dealloc_logical_block_read_value_SPDK_NVME_DEALLOC_READ_00:
    spdk_nvme_dealloc_logical_block_read_value = 1;
pub const spdk_nvme_dealloc_logical_block_read_value_SPDK_NVME_DEALLOC_READ_FF:
    spdk_nvme_dealloc_logical_block_read_value = 2;
pub type spdk_nvme_dealloc_logical_block_read_value = u32;
pub const spdk_nvme_reservation_type_SPDK_NVME_RESERVE_WRITE_EXCLUSIVE: spdk_nvme_reservation_type =
    1;
pub const spdk_nvme_reservation_type_SPDK_NVME_RESERVE_EXCLUSIVE_ACCESS:
    spdk_nvme_reservation_type = 2;
pub const spdk_nvme_reservation_type_SPDK_NVME_RESERVE_WRITE_EXCLUSIVE_REG_ONLY:
    spdk_nvme_reservation_type = 3;
pub const spdk_nvme_reservation_type_SPDK_NVME_RESERVE_EXCLUSIVE_ACCESS_REG_ONLY:
    spdk_nvme_reservation_type = 4;
pub const spdk_nvme_reservation_type_SPDK_NVME_RESERVE_WRITE_EXCLUSIVE_ALL_REGS:
    spdk_nvme_reservation_type = 5;
pub const spdk_nvme_reservation_type_SPDK_NVME_RESERVE_EXCLUSIVE_ACCESS_ALL_REGS:
    spdk_nvme_reservation_type = 6;
pub type spdk_nvme_reservation_type = u32;
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct spdk_nvme_reservation_acquire_data {
    pub crkey: u64,
    pub prkey: u64,
}
#[test]
fn bindgen_test_layout_spdk_nvme_reservation_acquire_data() {
    assert_eq!(
        ::std::mem::size_of::<spdk_nvme_reservation_acquire_data>(),
        16usize,
        concat!("Size of: ", stringify!(spdk_nvme_reservation_acquire_data))
    );
    assert_eq!(
        ::std::mem::align_of::<spdk_nvme_reservation_acquire_data>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(spdk_nvme_reservation_acquire_data)
        )
    );
}
pub const spdk_nvme_reservation_acquire_action_SPDK_NVME_RESERVE_ACQUIRE:
    spdk_nvme_reservation_acquire_action = 0;
pub const spdk_nvme_reservation_acquire_action_SPDK_NVME_RESERVE_PREEMPT:
    spdk_nvme_reservation_acquire_action = 1;
pub const spdk_nvme_reservation_acquire_action_SPDK_NVME_RESERVE_PREEMPT_ABORT:
    spdk_nvme_reservation_acquire_action = 2;
pub type spdk_nvme_reservation_acquire_action = u32;
#[repr(C, packed)]
#[derive(Debug, Default, Copy, Clone)]
pub struct spdk_nvme_reservation_status_data {
    pub generation: u32,
    pub type_: u8,
    pub nr_regctl: u16,
    pub reserved1: u16,
    pub ptpl_state: u8,
    pub reserved: [u8; 14usize],
}
#[test]
fn bindgen_test_layout_spdk_nvme_reservation_status_data() {
    assert_eq!(
        ::std::mem::size_of::<spdk_nvme_reservation_status_data>(),
        24usize,
        concat!("Size of: ", stringify!(spdk_nvme_reservation_status_data))
    );
    assert_eq!(
        ::std::mem::align_of::<spdk_nvme_reservation_status_data>(),
        1usize,
        concat!(
            "Alignment of ",
            stringify!(spdk_nvme_reservation_status_data)
        )
    );
}
#[repr(C, packed)]
#[derive(Debug, Default, Copy, Clone)]
pub struct spdk_nvme_reservation_ctrlr_data {
    pub ctrlr_id: u16,
    pub rcsts: spdk_nvme_reservation_ctrlr_data__bindgen_ty_1,
    pub reserved2: [u8; 5usize],
    pub host_id: u64,
    pub key: u64,
}
#[repr(C, packed)]
#[derive(Debug, Default, Copy, Clone)]
pub struct spdk_nvme_reservation_ctrlr_data__bindgen_ty_1 {
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 1usize], u8>,
}
#[test]
fn bindgen_test_layout_spdk_nvme_reservation_ctrlr_data__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<spdk_nvme_reservation_ctrlr_data__bindgen_ty_1>(),
        1usize,
        concat!(
            "Size of: ",
            stringify!(spdk_nvme_reservation_ctrlr_data__bindgen_ty_1)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<spdk_nvme_reservation_ctrlr_data__bindgen_ty_1>(),
        1usize,
        concat!(
            "Alignment of ",
            stringify!(spdk_nvme_reservation_ctrlr_data__bindgen_ty_1)
        )
    );
}
impl spdk_nvme_reservation_ctrlr_data__bindgen_ty_1 {
    #[inline]
    pub fn status(&self) -> u8 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_status(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn reserved1(&self) -> u8 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(1usize, 7u8) as u8) }
    }
    #[inline]
    pub fn set_reserved1(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::std::mem::transmute(val);
            self._bitfield_1.set(1usize, 7u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(status: u8, reserved1: u8) -> __BindgenBitfieldUnit<[u8; 1usize], u8> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize], u8> =
            Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let status: u8 = unsafe { ::std::mem::transmute(status) };
            status as u64
        });
        __bindgen_bitfield_unit.set(1usize, 7u8, {
            let reserved1: u8 = unsafe { ::std::mem::transmute(reserved1) };
            reserved1 as u64
        });
        __bindgen_bitfield_unit
    }
}
#[test]
fn bindgen_test_layout_spdk_nvme_reservation_ctrlr_data() {
    assert_eq!(
        ::std::mem::size_of::<spdk_nvme_reservation_ctrlr_data>(),
        24usize,
        concat!("Size of: ", stringify!(spdk_nvme_reservation_ctrlr_data))
    );
    assert_eq!(
        ::std::mem::align_of::<spdk_nvme_reservation_ctrlr_data>(),
        1usize,
        concat!(
            "Alignment of ",
            stringify!(spdk_nvme_reservation_ctrlr_data)
        )
    );
}
pub const spdk_nvme_reservation_register_cptpl_SPDK_NVME_RESERVE_PTPL_NO_CHANGES:
    spdk_nvme_reservation_register_cptpl = 0;
pub const spdk_nvme_reservation_register_cptpl_SPDK_NVME_RESERVE_PTPL_CLEAR_POWER_ON:
    spdk_nvme_reservation_register_cptpl = 2;
pub const spdk_nvme_reservation_register_cptpl_SPDK_NVME_RESERVE_PTPL_PERSIST_POWER_LOSS:
    spdk_nvme_reservation_register_cptpl = 3;
pub type spdk_nvme_reservation_register_cptpl = u32;
pub const spdk_nvme_reservation_register_action_SPDK_NVME_RESERVE_REGISTER_KEY:
    spdk_nvme_reservation_register_action = 0;
pub const spdk_nvme_reservation_register_action_SPDK_NVME_RESERVE_UNREGISTER_KEY:
    spdk_nvme_reservation_register_action = 1;
pub const spdk_nvme_reservation_register_action_SPDK_NVME_RESERVE_REPLACE_KEY:
    spdk_nvme_reservation_register_action = 2;
pub type spdk_nvme_reservation_register_action = u32;
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct spdk_nvme_reservation_register_data {
    pub crkey: u64,
    pub nrkey: u64,
}
#[test]
fn bindgen_test_layout_spdk_nvme_reservation_register_data() {
    assert_eq!(
        ::std::mem::size_of::<spdk_nvme_reservation_register_data>(),
        16usize,
        concat!("Size of: ", stringify!(spdk_nvme_reservation_register_data))
    );
    assert_eq!(
        ::std::mem::align_of::<spdk_nvme_reservation_register_data>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(spdk_nvme_reservation_register_data)
        )
    );
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct spdk_nvme_reservation_key_data {
    pub crkey: u64,
}
#[test]
fn bindgen_test_layout_spdk_nvme_reservation_key_data() {
    assert_eq!(
        ::std::mem::size_of::<spdk_nvme_reservation_key_data>(),
        8usize,
        concat!("Size of: ", stringify!(spdk_nvme_reservation_key_data))
    );
    assert_eq!(
        ::std::mem::align_of::<spdk_nvme_reservation_key_data>(),
        8usize,
        concat!("Alignment of ", stringify!(spdk_nvme_reservation_key_data))
    );
}
pub const spdk_nvme_reservation_release_action_SPDK_NVME_RESERVE_RELEASE:
    spdk_nvme_reservation_release_action = 0;
pub const spdk_nvme_reservation_release_action_SPDK_NVME_RESERVE_CLEAR:
    spdk_nvme_reservation_release_action = 1;
pub type spdk_nvme_reservation_release_action = u32;
pub const spdk_nvme_log_page_SPDK_NVME_LOG_ERROR: spdk_nvme_log_page = 1;
pub const spdk_nvme_log_page_SPDK_NVME_LOG_HEALTH_INFORMATION: spdk_nvme_log_page = 2;
pub const spdk_nvme_log_page_SPDK_NVME_LOG_FIRMWARE_SLOT: spdk_nvme_log_page = 3;
pub const spdk_nvme_log_page_SPDK_NVME_LOG_CHANGED_NS_LIST: spdk_nvme_log_page = 4;
pub const spdk_nvme_log_page_SPDK_NVME_LOG_COMMAND_EFFECTS_LOG: spdk_nvme_log_page = 5;
pub const spdk_nvme_log_page_SPDK_NVME_LOG_DISCOVERY: spdk_nvme_log_page = 112;
pub const spdk_nvme_log_page_SPDK_NVME_LOG_RESERVATION_NOTIFICATION: spdk_nvme_log_page = 128;
pub type spdk_nvme_log_page = u32;
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct spdk_nvme_error_information_entry {
    pub error_count: u64,
    pub sqid: u16,
    pub cid: u16,
    pub status: spdk_nvme_status,
    pub error_location: u16,
    pub lba: u64,
    pub nsid: u32,
    pub vendor_specific: u8,
    pub trtype: u8,
    pub reserved30: [u8; 2usize],
    pub command_specific: u64,
    pub trtype_specific: u16,
    pub reserved42: [u8; 22usize],
}
#[test]
fn bindgen_test_layout_spdk_nvme_error_information_entry() {
    assert_eq!(
        ::std::mem::size_of::<spdk_nvme_error_information_entry>(),
        64usize,
        concat!("Size of: ", stringify!(spdk_nvme_error_information_entry))
    );
    assert_eq!(
        ::std::mem::align_of::<spdk_nvme_error_information_entry>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(spdk_nvme_error_information_entry)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union spdk_nvme_critical_warning_state {
    pub raw: u8,
    pub bits: spdk_nvme_critical_warning_state__bindgen_ty_1,
    _bindgen_union_align: u8,
}
#[repr(C, packed)]
#[derive(Debug, Default, Copy, Clone)]
pub struct spdk_nvme_critical_warning_state__bindgen_ty_1 {
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 1usize], u8>,
}
#[test]
fn bindgen_test_layout_spdk_nvme_critical_warning_state__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<spdk_nvme_critical_warning_state__bindgen_ty_1>(),
        1usize,
        concat!(
            "Size of: ",
            stringify!(spdk_nvme_critical_warning_state__bindgen_ty_1)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<spdk_nvme_critical_warning_state__bindgen_ty_1>(),
        1usize,
        concat!(
            "Alignment of ",
            stringify!(spdk_nvme_critical_warning_state__bindgen_ty_1)
        )
    );
}
impl spdk_nvme_critical_warning_state__bindgen_ty_1 {
    #[inline]
    pub fn available_spare(&self) -> u8 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_available_spare(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn temperature(&self) -> u8 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(1usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_temperature(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::std::mem::transmute(val);
            self._bitfield_1.set(1usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn device_reliability(&self) -> u8 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(2usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_device_reliability(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::std::mem::transmute(val);
            self._bitfield_1.set(2usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn read_only(&self) -> u8 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(3usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_read_only(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::std::mem::transmute(val);
            self._bitfield_1.set(3usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn volatile_memory_backup(&self) -> u8 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(4usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_volatile_memory_backup(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::std::mem::transmute(val);
            self._bitfield_1.set(4usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn reserved(&self) -> u8 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(5usize, 3u8) as u8) }
    }
    #[inline]
    pub fn set_reserved(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::std::mem::transmute(val);
            self._bitfield_1.set(5usize, 3u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        available_spare: u8,
        temperature: u8,
        device_reliability: u8,
        read_only: u8,
        volatile_memory_backup: u8,
        reserved: u8,
    ) -> __BindgenBitfieldUnit<[u8; 1usize], u8> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize], u8> =
            Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let available_spare: u8 = unsafe { ::std::mem::transmute(available_spare) };
            available_spare as u64
        });
        __bindgen_bitfield_unit.set(1usize, 1u8, {
            let temperature: u8 = unsafe { ::std::mem::transmute(temperature) };
            temperature as u64
        });
        __bindgen_bitfield_unit.set(2usize, 1u8, {
            let device_reliability: u8 = unsafe { ::std::mem::transmute(device_reliability) };
            device_reliability as u64
        });
        __bindgen_bitfield_unit.set(3usize, 1u8, {
            let read_only: u8 = unsafe { ::std::mem::transmute(read_only) };
            read_only as u64
        });
        __bindgen_bitfield_unit.set(4usize, 1u8, {
            let volatile_memory_backup: u8 =
                unsafe { ::std::mem::transmute(volatile_memory_backup) };
            volatile_memory_backup as u64
        });
        __bindgen_bitfield_unit.set(5usize, 3u8, {
            let reserved: u8 = unsafe { ::std::mem::transmute(reserved) };
            reserved as u64
        });
        __bindgen_bitfield_unit
    }
}
#[test]
fn bindgen_test_layout_spdk_nvme_critical_warning_state() {
    assert_eq!(
        ::std::mem::size_of::<spdk_nvme_critical_warning_state>(),
        1usize,
        concat!("Size of: ", stringify!(spdk_nvme_critical_warning_state))
    );
    assert_eq!(
        ::std::mem::align_of::<spdk_nvme_critical_warning_state>(),
        1usize,
        concat!(
            "Alignment of ",
            stringify!(spdk_nvme_critical_warning_state)
        )
    );
}
impl Default for spdk_nvme_critical_warning_state {
    fn default() -> Self {
        unsafe { ::std::mem::zeroed() }
    }
}
#[repr(C, packed)]
#[derive(Copy, Clone)]
pub struct spdk_nvme_health_information_page {
    pub critical_warning: spdk_nvme_critical_warning_state,
    pub temperature: u16,
    pub available_spare: u8,
    pub available_spare_threshold: u8,
    pub percentage_used: u8,
    pub reserved: [u8; 26usize],
    pub data_units_read: [u64; 2usize],
    pub data_units_written: [u64; 2usize],
    pub host_read_commands: [u64; 2usize],
    pub host_write_commands: [u64; 2usize],
    pub controller_busy_time: [u64; 2usize],
    pub power_cycles: [u64; 2usize],
    pub power_on_hours: [u64; 2usize],
    pub unsafe_shutdowns: [u64; 2usize],
    pub media_errors: [u64; 2usize],
    pub num_error_info_log_entries: [u64; 2usize],
    pub warning_temp_time: u32,
    pub critical_temp_time: u32,
    pub temp_sensor: [u16; 8usize],
    pub reserved2: [u8; 296usize],
}
#[test]
fn bindgen_test_layout_spdk_nvme_health_information_page() {
    assert_eq!(
        ::std::mem::size_of::<spdk_nvme_health_information_page>(),
        512usize,
        concat!("Size of: ", stringify!(spdk_nvme_health_information_page))
    );
    assert_eq!(
        ::std::mem::align_of::<spdk_nvme_health_information_page>(),
        1usize,
        concat!(
            "Alignment of ",
            stringify!(spdk_nvme_health_information_page)
        )
    );
}
impl Default for spdk_nvme_health_information_page {
    fn default() -> Self {
        unsafe { ::std::mem::zeroed() }
    }
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct spdk_nvme_cmds_and_effect_entry {
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 4usize], u16>,
    pub __bindgen_align: [u16; 0usize],
}
#[test]
fn bindgen_test_layout_spdk_nvme_cmds_and_effect_entry() {
    assert_eq!(
        ::std::mem::size_of::<spdk_nvme_cmds_and_effect_entry>(),
        4usize,
        concat!("Size of: ", stringify!(spdk_nvme_cmds_and_effect_entry))
    );
    assert_eq!(
        ::std::mem::align_of::<spdk_nvme_cmds_and_effect_entry>(),
        2usize,
        concat!("Alignment of ", stringify!(spdk_nvme_cmds_and_effect_entry))
    );
}
impl spdk_nvme_cmds_and_effect_entry {
    #[inline]
    pub fn csupp(&self) -> u16 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set_csupp(&mut self, val: u16) {
        unsafe {
            let val: u16 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn lbcc(&self) -> u16 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(1usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set_lbcc(&mut self, val: u16) {
        unsafe {
            let val: u16 = ::std::mem::transmute(val);
            self._bitfield_1.set(1usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn ncc(&self) -> u16 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(2usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set_ncc(&mut self, val: u16) {
        unsafe {
            let val: u16 = ::std::mem::transmute(val);
            self._bitfield_1.set(2usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn nic(&self) -> u16 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(3usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set_nic(&mut self, val: u16) {
        unsafe {
            let val: u16 = ::std::mem::transmute(val);
            self._bitfield_1.set(3usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn ccc(&self) -> u16 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(4usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set_ccc(&mut self, val: u16) {
        unsafe {
            let val: u16 = ::std::mem::transmute(val);
            self._bitfield_1.set(4usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn reserved1(&self) -> u16 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(5usize, 11u8) as u16) }
    }
    #[inline]
    pub fn set_reserved1(&mut self, val: u16) {
        unsafe {
            let val: u16 = ::std::mem::transmute(val);
            self._bitfield_1.set(5usize, 11u8, val as u64)
        }
    }
    #[inline]
    pub fn cse(&self) -> u16 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(16usize, 3u8) as u16) }
    }
    #[inline]
    pub fn set_cse(&mut self, val: u16) {
        unsafe {
            let val: u16 = ::std::mem::transmute(val);
            self._bitfield_1.set(16usize, 3u8, val as u64)
        }
    }
    #[inline]
    pub fn reserved2(&self) -> u16 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(19usize, 13u8) as u16) }
    }
    #[inline]
    pub fn set_reserved2(&mut self, val: u16) {
        unsafe {
            let val: u16 = ::std::mem::transmute(val);
            self._bitfield_1.set(19usize, 13u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        csupp: u16,
        lbcc: u16,
        ncc: u16,
        nic: u16,
        ccc: u16,
        reserved1: u16,
        cse: u16,
        reserved2: u16,
    ) -> __BindgenBitfieldUnit<[u8; 4usize], u16> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 4usize], u16> =
            Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let csupp: u16 = unsafe { ::std::mem::transmute(csupp) };
            csupp as u64
        });
        __bindgen_bitfield_unit.set(1usize, 1u8, {
            let lbcc: u16 = unsafe { ::std::mem::transmute(lbcc) };
            lbcc as u64
        });
        __bindgen_bitfield_unit.set(2usize, 1u8, {
            let ncc: u16 = unsafe { ::std::mem::transmute(ncc) };
            ncc as u64
        });
        __bindgen_bitfield_unit.set(3usize, 1u8, {
            let nic: u16 = unsafe { ::std::mem::transmute(nic) };
            nic as u64
        });
        __bindgen_bitfield_unit.set(4usize, 1u8, {
            let ccc: u16 = unsafe { ::std::mem::transmute(ccc) };
            ccc as u64
        });
        __bindgen_bitfield_unit.set(5usize, 11u8, {
            let reserved1: u16 = unsafe { ::std::mem::transmute(reserved1) };
            reserved1 as u64
        });
        __bindgen_bitfield_unit.set(16usize, 3u8, {
            let cse: u16 = unsafe { ::std::mem::transmute(cse) };
            cse as u64
        });
        __bindgen_bitfield_unit.set(19usize, 13u8, {
            let reserved2: u16 = unsafe { ::std::mem::transmute(reserved2) };
            reserved2 as u64
        });
        __bindgen_bitfield_unit
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct spdk_nvme_cmds_and_effect_log_page {
    pub admin_cmds_supported: [spdk_nvme_cmds_and_effect_entry; 256usize],
    pub io_cmds_supported: [spdk_nvme_cmds_and_effect_entry; 256usize],
    pub reserved0: [u8; 2048usize],
}
#[test]
fn bindgen_test_layout_spdk_nvme_cmds_and_effect_log_page() {
    assert_eq!(
        ::std::mem::size_of::<spdk_nvme_cmds_and_effect_log_page>(),
        4096usize,
        concat!("Size of: ", stringify!(spdk_nvme_cmds_and_effect_log_page))
    );
    assert_eq!(
        ::std::mem::align_of::<spdk_nvme_cmds_and_effect_log_page>(),
        2usize,
        concat!(
            "Alignment of ",
            stringify!(spdk_nvme_cmds_and_effect_log_page)
        )
    );
}
impl Default for spdk_nvme_cmds_and_effect_log_page {
    fn default() -> Self {
        unsafe { ::std::mem::zeroed() }
    }
}
pub const spdk_nvme_async_event_type_SPDK_NVME_ASYNC_EVENT_TYPE_ERROR: spdk_nvme_async_event_type =
    0;
pub const spdk_nvme_async_event_type_SPDK_NVME_ASYNC_EVENT_TYPE_SMART: spdk_nvme_async_event_type =
    1;
pub const spdk_nvme_async_event_type_SPDK_NVME_ASYNC_EVENT_TYPE_NOTICE: spdk_nvme_async_event_type =
    2;
pub const spdk_nvme_async_event_type_SPDK_NVME_ASYNC_EVENT_TYPE_IO: spdk_nvme_async_event_type = 6;
pub const spdk_nvme_async_event_type_SPDK_NVME_ASYNC_EVENT_TYPE_VENDOR: spdk_nvme_async_event_type =
    7;
pub type spdk_nvme_async_event_type = u32;
pub const spdk_nvme_async_event_info_error_SPDK_NVME_ASYNC_EVENT_WRITE_INVALID_DB:
    spdk_nvme_async_event_info_error = 0;
pub const spdk_nvme_async_event_info_error_SPDK_NVME_ASYNC_EVENT_INVALID_DB_WRITE:
    spdk_nvme_async_event_info_error = 1;
pub const spdk_nvme_async_event_info_error_SPDK_NVME_ASYNC_EVENT_DIAGNOSTIC_FAILURE:
    spdk_nvme_async_event_info_error = 2;
pub const spdk_nvme_async_event_info_error_SPDK_NVME_ASYNC_EVENT_PERSISTENT_INTERNAL:
    spdk_nvme_async_event_info_error = 3;
pub const spdk_nvme_async_event_info_error_SPDK_NVME_ASYNC_EVENT_TRANSIENT_INTERNAL:
    spdk_nvme_async_event_info_error = 4;
pub const spdk_nvme_async_event_info_error_SPDK_NVME_ASYNC_EVENT_FW_IMAGE_LOAD:
    spdk_nvme_async_event_info_error = 5;
pub type spdk_nvme_async_event_info_error = u32;
pub const spdk_nvme_async_event_info_smart_SPDK_NVME_ASYNC_EVENT_SUBSYSTEM_RELIABILITY:
    spdk_nvme_async_event_info_smart = 0;
pub const spdk_nvme_async_event_info_smart_SPDK_NVME_ASYNC_EVENT_TEMPERATURE_THRESHOLD:
    spdk_nvme_async_event_info_smart = 1;
pub const spdk_nvme_async_event_info_smart_SPDK_NVME_ASYNC_EVENT_SPARE_BELOW_THRESHOLD:
    spdk_nvme_async_event_info_smart = 2;
pub type spdk_nvme_async_event_info_smart = u32;
pub const spdk_nvme_async_event_info_notice_SPDK_NVME_ASYNC_EVENT_NS_ATTR_CHANGED:
    spdk_nvme_async_event_info_notice = 0;
pub const spdk_nvme_async_event_info_notice_SPDK_NVME_ASYNC_EVENT_FW_ACTIVATION_START:
    spdk_nvme_async_event_info_notice = 1;
pub const spdk_nvme_async_event_info_notice_SPDK_NVME_ASYNC_EVENT_TELEMETRY_LOG_CHANGED:
    spdk_nvme_async_event_info_notice = 2;
pub type spdk_nvme_async_event_info_notice = u32;
pub const spdk_nvme_async_event_info_nvm_command_set_SPDK_NVME_ASYNC_EVENT_RESERVATION_LOG_AVAIL:
    spdk_nvme_async_event_info_nvm_command_set = 0;
pub const spdk_nvme_async_event_info_nvm_command_set_SPDK_NVME_ASYNC_EVENT_SANITIZE_COMPLETED:
    spdk_nvme_async_event_info_nvm_command_set = 1;
pub type spdk_nvme_async_event_info_nvm_command_set = u32;
#[repr(C)]
#[derive(Copy, Clone)]
pub union spdk_nvme_async_event_completion {
    pub raw: u32,
    pub bits: spdk_nvme_async_event_completion__bindgen_ty_1,
    _bindgen_union_align: u32,
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct spdk_nvme_async_event_completion__bindgen_ty_1 {
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 4usize], u8>,
    pub __bindgen_align: [u32; 0usize],
}
#[test]
fn bindgen_test_layout_spdk_nvme_async_event_completion__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<spdk_nvme_async_event_completion__bindgen_ty_1>(),
        4usize,
        concat!(
            "Size of: ",
            stringify!(spdk_nvme_async_event_completion__bindgen_ty_1)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<spdk_nvme_async_event_completion__bindgen_ty_1>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(spdk_nvme_async_event_completion__bindgen_ty_1)
        )
    );
}
impl spdk_nvme_async_event_completion__bindgen_ty_1 {
    #[inline]
    pub fn async_event_type(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 3u8) as u32) }
    }
    #[inline]
    pub fn set_async_event_type(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 3u8, val as u64)
        }
    }
    #[inline]
    pub fn reserved1(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(3usize, 5u8) as u32) }
    }
    #[inline]
    pub fn set_reserved1(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(3usize, 5u8, val as u64)
        }
    }
    #[inline]
    pub fn async_event_info(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(8usize, 8u8) as u32) }
    }
    #[inline]
    pub fn set_async_event_info(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(8usize, 8u8, val as u64)
        }
    }
    #[inline]
    pub fn log_page_identifier(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(16usize, 8u8) as u32) }
    }
    #[inline]
    pub fn set_log_page_identifier(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(16usize, 8u8, val as u64)
        }
    }
    #[inline]
    pub fn reserved2(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(24usize, 8u8) as u32) }
    }
    #[inline]
    pub fn set_reserved2(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(24usize, 8u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        async_event_type: u32,
        reserved1: u32,
        async_event_info: u32,
        log_page_identifier: u32,
        reserved2: u32,
    ) -> __BindgenBitfieldUnit<[u8; 4usize], u8> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 4usize], u8> =
            Default::default();
        __bindgen_bitfield_unit.set(0usize, 3u8, {
            let async_event_type: u32 = unsafe { ::std::mem::transmute(async_event_type) };
            async_event_type as u64
        });
        __bindgen_bitfield_unit.set(3usize, 5u8, {
            let reserved1: u32 = unsafe { ::std::mem::transmute(reserved1) };
            reserved1 as u64
        });
        __bindgen_bitfield_unit.set(8usize, 8u8, {
            let async_event_info: u32 = unsafe { ::std::mem::transmute(async_event_info) };
            async_event_info as u64
        });
        __bindgen_bitfield_unit.set(16usize, 8u8, {
            let log_page_identifier: u32 = unsafe { ::std::mem::transmute(log_page_identifier) };
            log_page_identifier as u64
        });
        __bindgen_bitfield_unit.set(24usize, 8u8, {
            let reserved2: u32 = unsafe { ::std::mem::transmute(reserved2) };
            reserved2 as u64
        });
        __bindgen_bitfield_unit
    }
}
#[test]
fn bindgen_test_layout_spdk_nvme_async_event_completion() {
    assert_eq!(
        ::std::mem::size_of::<spdk_nvme_async_event_completion>(),
        4usize,
        concat!("Size of: ", stringify!(spdk_nvme_async_event_completion))
    );
    assert_eq!(
        ::std::mem::align_of::<spdk_nvme_async_event_completion>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(spdk_nvme_async_event_completion)
        )
    );
}
impl Default for spdk_nvme_async_event_completion {
    fn default() -> Self {
        unsafe { ::std::mem::zeroed() }
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union spdk_nvme_feat_arbitration {
    pub raw: u32,
    pub bits: spdk_nvme_feat_arbitration__bindgen_ty_1,
    _bindgen_union_align: u32,
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct spdk_nvme_feat_arbitration__bindgen_ty_1 {
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 4usize], u8>,
    pub __bindgen_align: [u32; 0usize],
}
#[test]
fn bindgen_test_layout_spdk_nvme_feat_arbitration__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<spdk_nvme_feat_arbitration__bindgen_ty_1>(),
        4usize,
        concat!(
            "Size of: ",
            stringify!(spdk_nvme_feat_arbitration__bindgen_ty_1)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<spdk_nvme_feat_arbitration__bindgen_ty_1>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(spdk_nvme_feat_arbitration__bindgen_ty_1)
        )
    );
}
impl spdk_nvme_feat_arbitration__bindgen_ty_1 {
    #[inline]
    pub fn ab(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 3u8) as u32) }
    }
    #[inline]
    pub fn set_ab(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 3u8, val as u64)
        }
    }
    #[inline]
    pub fn reserved(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(3usize, 5u8) as u32) }
    }
    #[inline]
    pub fn set_reserved(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(3usize, 5u8, val as u64)
        }
    }
    #[inline]
    pub fn lpw(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(8usize, 8u8) as u32) }
    }
    #[inline]
    pub fn set_lpw(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(8usize, 8u8, val as u64)
        }
    }
    #[inline]
    pub fn mpw(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(16usize, 8u8) as u32) }
    }
    #[inline]
    pub fn set_mpw(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(16usize, 8u8, val as u64)
        }
    }
    #[inline]
    pub fn hpw(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(24usize, 8u8) as u32) }
    }
    #[inline]
    pub fn set_hpw(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(24usize, 8u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        ab: u32,
        reserved: u32,
        lpw: u32,
        mpw: u32,
        hpw: u32,
    ) -> __BindgenBitfieldUnit<[u8; 4usize], u8> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 4usize], u8> =
            Default::default();
        __bindgen_bitfield_unit.set(0usize, 3u8, {
            let ab: u32 = unsafe { ::std::mem::transmute(ab) };
            ab as u64
        });
        __bindgen_bitfield_unit.set(3usize, 5u8, {
            let reserved: u32 = unsafe { ::std::mem::transmute(reserved) };
            reserved as u64
        });
        __bindgen_bitfield_unit.set(8usize, 8u8, {
            let lpw: u32 = unsafe { ::std::mem::transmute(lpw) };
            lpw as u64
        });
        __bindgen_bitfield_unit.set(16usize, 8u8, {
            let mpw: u32 = unsafe { ::std::mem::transmute(mpw) };
            mpw as u64
        });
        __bindgen_bitfield_unit.set(24usize, 8u8, {
            let hpw: u32 = unsafe { ::std::mem::transmute(hpw) };
            hpw as u64
        });
        __bindgen_bitfield_unit
    }
}
#[test]
fn bindgen_test_layout_spdk_nvme_feat_arbitration() {
    assert_eq!(
        ::std::mem::size_of::<spdk_nvme_feat_arbitration>(),
        4usize,
        concat!("Size of: ", stringify!(spdk_nvme_feat_arbitration))
    );
    assert_eq!(
        ::std::mem::align_of::<spdk_nvme_feat_arbitration>(),
        4usize,
        concat!("Alignment of ", stringify!(spdk_nvme_feat_arbitration))
    );
}
impl Default for spdk_nvme_feat_arbitration {
    fn default() -> Self {
        unsafe { ::std::mem::zeroed() }
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union spdk_nvme_feat_power_management {
    pub raw: u32,
    pub bits: spdk_nvme_feat_power_management__bindgen_ty_1,
    _bindgen_union_align: u32,
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct spdk_nvme_feat_power_management__bindgen_ty_1 {
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 4usize], u32>,
    pub __bindgen_align: [u32; 0usize],
}
#[test]
fn bindgen_test_layout_spdk_nvme_feat_power_management__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<spdk_nvme_feat_power_management__bindgen_ty_1>(),
        4usize,
        concat!(
            "Size of: ",
            stringify!(spdk_nvme_feat_power_management__bindgen_ty_1)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<spdk_nvme_feat_power_management__bindgen_ty_1>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(spdk_nvme_feat_power_management__bindgen_ty_1)
        )
    );
}
impl spdk_nvme_feat_power_management__bindgen_ty_1 {
    #[inline]
    pub fn ps(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 5u8) as u32) }
    }
    #[inline]
    pub fn set_ps(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 5u8, val as u64)
        }
    }
    #[inline]
    pub fn wh(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(5usize, 3u8) as u32) }
    }
    #[inline]
    pub fn set_wh(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(5usize, 3u8, val as u64)
        }
    }
    #[inline]
    pub fn reserved(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(8usize, 24u8) as u32) }
    }
    #[inline]
    pub fn set_reserved(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(8usize, 24u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        ps: u32,
        wh: u32,
        reserved: u32,
    ) -> __BindgenBitfieldUnit<[u8; 4usize], u32> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 4usize], u32> =
            Default::default();
        __bindgen_bitfield_unit.set(0usize, 5u8, {
            let ps: u32 = unsafe { ::std::mem::transmute(ps) };
            ps as u64
        });
        __bindgen_bitfield_unit.set(5usize, 3u8, {
            let wh: u32 = unsafe { ::std::mem::transmute(wh) };
            wh as u64
        });
        __bindgen_bitfield_unit.set(8usize, 24u8, {
            let reserved: u32 = unsafe { ::std::mem::transmute(reserved) };
            reserved as u64
        });
        __bindgen_bitfield_unit
    }
}
#[test]
fn bindgen_test_layout_spdk_nvme_feat_power_management() {
    assert_eq!(
        ::std::mem::size_of::<spdk_nvme_feat_power_management>(),
        4usize,
        concat!("Size of: ", stringify!(spdk_nvme_feat_power_management))
    );
    assert_eq!(
        ::std::mem::align_of::<spdk_nvme_feat_power_management>(),
        4usize,
        concat!("Alignment of ", stringify!(spdk_nvme_feat_power_management))
    );
}
impl Default for spdk_nvme_feat_power_management {
    fn default() -> Self {
        unsafe { ::std::mem::zeroed() }
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union spdk_nvme_feat_lba_range_type {
    pub raw: u32,
    pub bits: spdk_nvme_feat_lba_range_type__bindgen_ty_1,
    _bindgen_union_align: u32,
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct spdk_nvme_feat_lba_range_type__bindgen_ty_1 {
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 4usize], u32>,
    pub __bindgen_align: [u32; 0usize],
}
#[test]
fn bindgen_test_layout_spdk_nvme_feat_lba_range_type__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<spdk_nvme_feat_lba_range_type__bindgen_ty_1>(),
        4usize,
        concat!(
            "Size of: ",
            stringify!(spdk_nvme_feat_lba_range_type__bindgen_ty_1)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<spdk_nvme_feat_lba_range_type__bindgen_ty_1>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(spdk_nvme_feat_lba_range_type__bindgen_ty_1)
        )
    );
}
impl spdk_nvme_feat_lba_range_type__bindgen_ty_1 {
    #[inline]
    pub fn num(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 6u8) as u32) }
    }
    #[inline]
    pub fn set_num(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 6u8, val as u64)
        }
    }
    #[inline]
    pub fn reserved(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(6usize, 26u8) as u32) }
    }
    #[inline]
    pub fn set_reserved(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(6usize, 26u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(num: u32, reserved: u32) -> __BindgenBitfieldUnit<[u8; 4usize], u32> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 4usize], u32> =
            Default::default();
        __bindgen_bitfield_unit.set(0usize, 6u8, {
            let num: u32 = unsafe { ::std::mem::transmute(num) };
            num as u64
        });
        __bindgen_bitfield_unit.set(6usize, 26u8, {
            let reserved: u32 = unsafe { ::std::mem::transmute(reserved) };
            reserved as u64
        });
        __bindgen_bitfield_unit
    }
}
#[test]
fn bindgen_test_layout_spdk_nvme_feat_lba_range_type() {
    assert_eq!(
        ::std::mem::size_of::<spdk_nvme_feat_lba_range_type>(),
        4usize,
        concat!("Size of: ", stringify!(spdk_nvme_feat_lba_range_type))
    );
    assert_eq!(
        ::std::mem::align_of::<spdk_nvme_feat_lba_range_type>(),
        4usize,
        concat!("Alignment of ", stringify!(spdk_nvme_feat_lba_range_type))
    );
}
impl Default for spdk_nvme_feat_lba_range_type {
    fn default() -> Self {
        unsafe { ::std::mem::zeroed() }
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union spdk_nvme_feat_temperature_threshold {
    pub raw: u32,
    pub bits: spdk_nvme_feat_temperature_threshold__bindgen_ty_1,
    _bindgen_union_align: u32,
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct spdk_nvme_feat_temperature_threshold__bindgen_ty_1 {
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 4usize], u16>,
    pub __bindgen_align: [u32; 0usize],
}
#[test]
fn bindgen_test_layout_spdk_nvme_feat_temperature_threshold__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<spdk_nvme_feat_temperature_threshold__bindgen_ty_1>(),
        4usize,
        concat!(
            "Size of: ",
            stringify!(spdk_nvme_feat_temperature_threshold__bindgen_ty_1)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<spdk_nvme_feat_temperature_threshold__bindgen_ty_1>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(spdk_nvme_feat_temperature_threshold__bindgen_ty_1)
        )
    );
}
impl spdk_nvme_feat_temperature_threshold__bindgen_ty_1 {
    #[inline]
    pub fn tmpth(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 16u8) as u32) }
    }
    #[inline]
    pub fn set_tmpth(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 16u8, val as u64)
        }
    }
    #[inline]
    pub fn tmpsel(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(16usize, 4u8) as u32) }
    }
    #[inline]
    pub fn set_tmpsel(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(16usize, 4u8, val as u64)
        }
    }
    #[inline]
    pub fn thsel(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(20usize, 2u8) as u32) }
    }
    #[inline]
    pub fn set_thsel(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(20usize, 2u8, val as u64)
        }
    }
    #[inline]
    pub fn reserved(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(22usize, 10u8) as u32) }
    }
    #[inline]
    pub fn set_reserved(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(22usize, 10u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        tmpth: u32,
        tmpsel: u32,
        thsel: u32,
        reserved: u32,
    ) -> __BindgenBitfieldUnit<[u8; 4usize], u16> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 4usize], u16> =
            Default::default();
        __bindgen_bitfield_unit.set(0usize, 16u8, {
            let tmpth: u32 = unsafe { ::std::mem::transmute(tmpth) };
            tmpth as u64
        });
        __bindgen_bitfield_unit.set(16usize, 4u8, {
            let tmpsel: u32 = unsafe { ::std::mem::transmute(tmpsel) };
            tmpsel as u64
        });
        __bindgen_bitfield_unit.set(20usize, 2u8, {
            let thsel: u32 = unsafe { ::std::mem::transmute(thsel) };
            thsel as u64
        });
        __bindgen_bitfield_unit.set(22usize, 10u8, {
            let reserved: u32 = unsafe { ::std::mem::transmute(reserved) };
            reserved as u64
        });
        __bindgen_bitfield_unit
    }
}
#[test]
fn bindgen_test_layout_spdk_nvme_feat_temperature_threshold() {
    assert_eq!(
        ::std::mem::size_of::<spdk_nvme_feat_temperature_threshold>(),
        4usize,
        concat!(
            "Size of: ",
            stringify!(spdk_nvme_feat_temperature_threshold)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<spdk_nvme_feat_temperature_threshold>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(spdk_nvme_feat_temperature_threshold)
        )
    );
}
impl Default for spdk_nvme_feat_temperature_threshold {
    fn default() -> Self {
        unsafe { ::std::mem::zeroed() }
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union spdk_nvme_feat_error_recovery {
    pub raw: u32,
    pub bits: spdk_nvme_feat_error_recovery__bindgen_ty_1,
    _bindgen_union_align: u32,
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct spdk_nvme_feat_error_recovery__bindgen_ty_1 {
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 4usize], u16>,
    pub __bindgen_align: [u32; 0usize],
}
#[test]
fn bindgen_test_layout_spdk_nvme_feat_error_recovery__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<spdk_nvme_feat_error_recovery__bindgen_ty_1>(),
        4usize,
        concat!(
            "Size of: ",
            stringify!(spdk_nvme_feat_error_recovery__bindgen_ty_1)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<spdk_nvme_feat_error_recovery__bindgen_ty_1>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(spdk_nvme_feat_error_recovery__bindgen_ty_1)
        )
    );
}
impl spdk_nvme_feat_error_recovery__bindgen_ty_1 {
    #[inline]
    pub fn tler(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 16u8) as u32) }
    }
    #[inline]
    pub fn set_tler(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 16u8, val as u64)
        }
    }
    #[inline]
    pub fn dulbe(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(16usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_dulbe(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(16usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn reserved(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(17usize, 15u8) as u32) }
    }
    #[inline]
    pub fn set_reserved(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(17usize, 15u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        tler: u32,
        dulbe: u32,
        reserved: u32,
    ) -> __BindgenBitfieldUnit<[u8; 4usize], u16> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 4usize], u16> =
            Default::default();
        __bindgen_bitfield_unit.set(0usize, 16u8, {
            let tler: u32 = unsafe { ::std::mem::transmute(tler) };
            tler as u64
        });
        __bindgen_bitfield_unit.set(16usize, 1u8, {
            let dulbe: u32 = unsafe { ::std::mem::transmute(dulbe) };
            dulbe as u64
        });
        __bindgen_bitfield_unit.set(17usize, 15u8, {
            let reserved: u32 = unsafe { ::std::mem::transmute(reserved) };
            reserved as u64
        });
        __bindgen_bitfield_unit
    }
}
#[test]
fn bindgen_test_layout_spdk_nvme_feat_error_recovery() {
    assert_eq!(
        ::std::mem::size_of::<spdk_nvme_feat_error_recovery>(),
        4usize,
        concat!("Size of: ", stringify!(spdk_nvme_feat_error_recovery))
    );
    assert_eq!(
        ::std::mem::align_of::<spdk_nvme_feat_error_recovery>(),
        4usize,
        concat!("Alignment of ", stringify!(spdk_nvme_feat_error_recovery))
    );
}
impl Default for spdk_nvme_feat_error_recovery {
    fn default() -> Self {
        unsafe { ::std::mem::zeroed() }
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union spdk_nvme_feat_volatile_write_cache {
    pub raw: u32,
    pub bits: spdk_nvme_feat_volatile_write_cache__bindgen_ty_1,
    _bindgen_union_align: u32,
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct spdk_nvme_feat_volatile_write_cache__bindgen_ty_1 {
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 4usize], u32>,
    pub __bindgen_align: [u32; 0usize],
}
#[test]
fn bindgen_test_layout_spdk_nvme_feat_volatile_write_cache__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<spdk_nvme_feat_volatile_write_cache__bindgen_ty_1>(),
        4usize,
        concat!(
            "Size of: ",
            stringify!(spdk_nvme_feat_volatile_write_cache__bindgen_ty_1)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<spdk_nvme_feat_volatile_write_cache__bindgen_ty_1>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(spdk_nvme_feat_volatile_write_cache__bindgen_ty_1)
        )
    );
}
impl spdk_nvme_feat_volatile_write_cache__bindgen_ty_1 {
    #[inline]
    pub fn wce(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_wce(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn reserved(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(1usize, 31u8) as u32) }
    }
    #[inline]
    pub fn set_reserved(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(1usize, 31u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(wce: u32, reserved: u32) -> __BindgenBitfieldUnit<[u8; 4usize], u32> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 4usize], u32> =
            Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let wce: u32 = unsafe { ::std::mem::transmute(wce) };
            wce as u64
        });
        __bindgen_bitfield_unit.set(1usize, 31u8, {
            let reserved: u32 = unsafe { ::std::mem::transmute(reserved) };
            reserved as u64
        });
        __bindgen_bitfield_unit
    }
}
#[test]
fn bindgen_test_layout_spdk_nvme_feat_volatile_write_cache() {
    assert_eq!(
        ::std::mem::size_of::<spdk_nvme_feat_volatile_write_cache>(),
        4usize,
        concat!("Size of: ", stringify!(spdk_nvme_feat_volatile_write_cache))
    );
    assert_eq!(
        ::std::mem::align_of::<spdk_nvme_feat_volatile_write_cache>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(spdk_nvme_feat_volatile_write_cache)
        )
    );
}
impl Default for spdk_nvme_feat_volatile_write_cache {
    fn default() -> Self {
        unsafe { ::std::mem::zeroed() }
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union spdk_nvme_feat_number_of_queues {
    pub raw: u32,
    pub bits: spdk_nvme_feat_number_of_queues__bindgen_ty_1,
    _bindgen_union_align: u32,
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct spdk_nvme_feat_number_of_queues__bindgen_ty_1 {
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 4usize], u16>,
    pub __bindgen_align: [u32; 0usize],
}
#[test]
fn bindgen_test_layout_spdk_nvme_feat_number_of_queues__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<spdk_nvme_feat_number_of_queues__bindgen_ty_1>(),
        4usize,
        concat!(
            "Size of: ",
            stringify!(spdk_nvme_feat_number_of_queues__bindgen_ty_1)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<spdk_nvme_feat_number_of_queues__bindgen_ty_1>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(spdk_nvme_feat_number_of_queues__bindgen_ty_1)
        )
    );
}
impl spdk_nvme_feat_number_of_queues__bindgen_ty_1 {
    #[inline]
    pub fn nsqr(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 16u8) as u32) }
    }
    #[inline]
    pub fn set_nsqr(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 16u8, val as u64)
        }
    }
    #[inline]
    pub fn ncqr(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(16usize, 16u8) as u32) }
    }
    #[inline]
    pub fn set_ncqr(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(16usize, 16u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(nsqr: u32, ncqr: u32) -> __BindgenBitfieldUnit<[u8; 4usize], u16> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 4usize], u16> =
            Default::default();
        __bindgen_bitfield_unit.set(0usize, 16u8, {
            let nsqr: u32 = unsafe { ::std::mem::transmute(nsqr) };
            nsqr as u64
        });
        __bindgen_bitfield_unit.set(16usize, 16u8, {
            let ncqr: u32 = unsafe { ::std::mem::transmute(ncqr) };
            ncqr as u64
        });
        __bindgen_bitfield_unit
    }
}
#[test]
fn bindgen_test_layout_spdk_nvme_feat_number_of_queues() {
    assert_eq!(
        ::std::mem::size_of::<spdk_nvme_feat_number_of_queues>(),
        4usize,
        concat!("Size of: ", stringify!(spdk_nvme_feat_number_of_queues))
    );
    assert_eq!(
        ::std::mem::align_of::<spdk_nvme_feat_number_of_queues>(),
        4usize,
        concat!("Alignment of ", stringify!(spdk_nvme_feat_number_of_queues))
    );
}
impl Default for spdk_nvme_feat_number_of_queues {
    fn default() -> Self {
        unsafe { ::std::mem::zeroed() }
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union spdk_nvme_feat_interrupt_vector_configuration {
    pub raw: u32,
    pub bits: spdk_nvme_feat_interrupt_vector_configuration__bindgen_ty_1,
    _bindgen_union_align: u32,
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct spdk_nvme_feat_interrupt_vector_configuration__bindgen_ty_1 {
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 4usize], u16>,
    pub __bindgen_align: [u32; 0usize],
}
#[test]
fn bindgen_test_layout_spdk_nvme_feat_interrupt_vector_configuration__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<spdk_nvme_feat_interrupt_vector_configuration__bindgen_ty_1>(),
        4usize,
        concat!(
            "Size of: ",
            stringify!(spdk_nvme_feat_interrupt_vector_configuration__bindgen_ty_1)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<spdk_nvme_feat_interrupt_vector_configuration__bindgen_ty_1>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(spdk_nvme_feat_interrupt_vector_configuration__bindgen_ty_1)
        )
    );
}
impl spdk_nvme_feat_interrupt_vector_configuration__bindgen_ty_1 {
    #[inline]
    pub fn iv(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 16u8) as u32) }
    }
    #[inline]
    pub fn set_iv(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 16u8, val as u64)
        }
    }
    #[inline]
    pub fn cd(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(16usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_cd(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(16usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn reserved(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(17usize, 15u8) as u32) }
    }
    #[inline]
    pub fn set_reserved(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(17usize, 15u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        iv: u32,
        cd: u32,
        reserved: u32,
    ) -> __BindgenBitfieldUnit<[u8; 4usize], u16> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 4usize], u16> =
            Default::default();
        __bindgen_bitfield_unit.set(0usize, 16u8, {
            let iv: u32 = unsafe { ::std::mem::transmute(iv) };
            iv as u64
        });
        __bindgen_bitfield_unit.set(16usize, 1u8, {
            let cd: u32 = unsafe { ::std::mem::transmute(cd) };
            cd as u64
        });
        __bindgen_bitfield_unit.set(17usize, 15u8, {
            let reserved: u32 = unsafe { ::std::mem::transmute(reserved) };
            reserved as u64
        });
        __bindgen_bitfield_unit
    }
}
#[test]
fn bindgen_test_layout_spdk_nvme_feat_interrupt_vector_configuration() {
    assert_eq!(
        ::std::mem::size_of::<spdk_nvme_feat_interrupt_vector_configuration>(),
        4usize,
        concat!(
            "Size of: ",
            stringify!(spdk_nvme_feat_interrupt_vector_configuration)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<spdk_nvme_feat_interrupt_vector_configuration>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(spdk_nvme_feat_interrupt_vector_configuration)
        )
    );
}
impl Default for spdk_nvme_feat_interrupt_vector_configuration {
    fn default() -> Self {
        unsafe { ::std::mem::zeroed() }
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union spdk_nvme_feat_write_atomicity {
    pub raw: u32,
    pub bits: spdk_nvme_feat_write_atomicity__bindgen_ty_1,
    _bindgen_union_align: u32,
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct spdk_nvme_feat_write_atomicity__bindgen_ty_1 {
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 4usize], u32>,
    pub __bindgen_align: [u32; 0usize],
}
#[test]
fn bindgen_test_layout_spdk_nvme_feat_write_atomicity__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<spdk_nvme_feat_write_atomicity__bindgen_ty_1>(),
        4usize,
        concat!(
            "Size of: ",
            stringify!(spdk_nvme_feat_write_atomicity__bindgen_ty_1)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<spdk_nvme_feat_write_atomicity__bindgen_ty_1>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(spdk_nvme_feat_write_atomicity__bindgen_ty_1)
        )
    );
}
impl spdk_nvme_feat_write_atomicity__bindgen_ty_1 {
    #[inline]
    pub fn dn(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_dn(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn reserved(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(1usize, 31u8) as u32) }
    }
    #[inline]
    pub fn set_reserved(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(1usize, 31u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(dn: u32, reserved: u32) -> __BindgenBitfieldUnit<[u8; 4usize], u32> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 4usize], u32> =
            Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let dn: u32 = unsafe { ::std::mem::transmute(dn) };
            dn as u64
        });
        __bindgen_bitfield_unit.set(1usize, 31u8, {
            let reserved: u32 = unsafe { ::std::mem::transmute(reserved) };
            reserved as u64
        });
        __bindgen_bitfield_unit
    }
}
#[test]
fn bindgen_test_layout_spdk_nvme_feat_write_atomicity() {
    assert_eq!(
        ::std::mem::size_of::<spdk_nvme_feat_write_atomicity>(),
        4usize,
        concat!("Size of: ", stringify!(spdk_nvme_feat_write_atomicity))
    );
    assert_eq!(
        ::std::mem::align_of::<spdk_nvme_feat_write_atomicity>(),
        4usize,
        concat!("Alignment of ", stringify!(spdk_nvme_feat_write_atomicity))
    );
}
impl Default for spdk_nvme_feat_write_atomicity {
    fn default() -> Self {
        unsafe { ::std::mem::zeroed() }
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union spdk_nvme_feat_async_event_configuration {
    pub raw: u32,
    pub bits: spdk_nvme_feat_async_event_configuration__bindgen_ty_1,
    _bindgen_union_align: u32,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct spdk_nvme_feat_async_event_configuration__bindgen_ty_1 {
    pub crit_warn: spdk_nvme_critical_warning_state,
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 4usize], u32>,
    pub __bindgen_align: [u32; 0usize],
}
#[test]
fn bindgen_test_layout_spdk_nvme_feat_async_event_configuration__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<spdk_nvme_feat_async_event_configuration__bindgen_ty_1>(),
        4usize,
        concat!(
            "Size of: ",
            stringify!(spdk_nvme_feat_async_event_configuration__bindgen_ty_1)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<spdk_nvme_feat_async_event_configuration__bindgen_ty_1>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(spdk_nvme_feat_async_event_configuration__bindgen_ty_1)
        )
    );
}
impl Default for spdk_nvme_feat_async_event_configuration__bindgen_ty_1 {
    fn default() -> Self {
        unsafe { ::std::mem::zeroed() }
    }
}
impl spdk_nvme_feat_async_event_configuration__bindgen_ty_1 {
    #[inline]
    pub fn ns_attr_notice(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_ns_attr_notice(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn fw_activation_notice(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(1usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_fw_activation_notice(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(1usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn telemetry_log_notice(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(2usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_telemetry_log_notice(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(2usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn reserved(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(3usize, 21u8) as u32) }
    }
    #[inline]
    pub fn set_reserved(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(3usize, 21u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        ns_attr_notice: u32,
        fw_activation_notice: u32,
        telemetry_log_notice: u32,
        reserved: u32,
    ) -> __BindgenBitfieldUnit<[u8; 4usize], u32> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 4usize], u32> =
            Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let ns_attr_notice: u32 = unsafe { ::std::mem::transmute(ns_attr_notice) };
            ns_attr_notice as u64
        });
        __bindgen_bitfield_unit.set(1usize, 1u8, {
            let fw_activation_notice: u32 = unsafe { ::std::mem::transmute(fw_activation_notice) };
            fw_activation_notice as u64
        });
        __bindgen_bitfield_unit.set(2usize, 1u8, {
            let telemetry_log_notice: u32 = unsafe { ::std::mem::transmute(telemetry_log_notice) };
            telemetry_log_notice as u64
        });
        __bindgen_bitfield_unit.set(3usize, 21u8, {
            let reserved: u32 = unsafe { ::std::mem::transmute(reserved) };
            reserved as u64
        });
        __bindgen_bitfield_unit
    }
}
#[test]
fn bindgen_test_layout_spdk_nvme_feat_async_event_configuration() {
    assert_eq!(
        ::std::mem::size_of::<spdk_nvme_feat_async_event_configuration>(),
        4usize,
        concat!(
            "Size of: ",
            stringify!(spdk_nvme_feat_async_event_configuration)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<spdk_nvme_feat_async_event_configuration>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(spdk_nvme_feat_async_event_configuration)
        )
    );
}
impl Default for spdk_nvme_feat_async_event_configuration {
    fn default() -> Self {
        unsafe { ::std::mem::zeroed() }
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union spdk_nvme_feat_autonomous_power_state_transition {
    pub raw: u32,
    pub bits: spdk_nvme_feat_autonomous_power_state_transition__bindgen_ty_1,
    _bindgen_union_align: u32,
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct spdk_nvme_feat_autonomous_power_state_transition__bindgen_ty_1 {
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 4usize], u32>,
    pub __bindgen_align: [u32; 0usize],
}
#[test]
fn bindgen_test_layout_spdk_nvme_feat_autonomous_power_state_transition__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<spdk_nvme_feat_autonomous_power_state_transition__bindgen_ty_1>(),
        4usize,
        concat!(
            "Size of: ",
            stringify!(spdk_nvme_feat_autonomous_power_state_transition__bindgen_ty_1)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<spdk_nvme_feat_autonomous_power_state_transition__bindgen_ty_1>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(spdk_nvme_feat_autonomous_power_state_transition__bindgen_ty_1)
        )
    );
}
impl spdk_nvme_feat_autonomous_power_state_transition__bindgen_ty_1 {
    #[inline]
    pub fn apste(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_apste(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn reserved(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(1usize, 31u8) as u32) }
    }
    #[inline]
    pub fn set_reserved(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(1usize, 31u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(apste: u32, reserved: u32) -> __BindgenBitfieldUnit<[u8; 4usize], u32> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 4usize], u32> =
            Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let apste: u32 = unsafe { ::std::mem::transmute(apste) };
            apste as u64
        });
        __bindgen_bitfield_unit.set(1usize, 31u8, {
            let reserved: u32 = unsafe { ::std::mem::transmute(reserved) };
            reserved as u64
        });
        __bindgen_bitfield_unit
    }
}
#[test]
fn bindgen_test_layout_spdk_nvme_feat_autonomous_power_state_transition() {
    assert_eq!(
        ::std::mem::size_of::<spdk_nvme_feat_autonomous_power_state_transition>(),
        4usize,
        concat!(
            "Size of: ",
            stringify!(spdk_nvme_feat_autonomous_power_state_transition)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<spdk_nvme_feat_autonomous_power_state_transition>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(spdk_nvme_feat_autonomous_power_state_transition)
        )
    );
}
impl Default for spdk_nvme_feat_autonomous_power_state_transition {
    fn default() -> Self {
        unsafe { ::std::mem::zeroed() }
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union spdk_nvme_feat_host_mem_buffer {
    pub raw: u32,
    pub bits: spdk_nvme_feat_host_mem_buffer__bindgen_ty_1,
    _bindgen_union_align: u32,
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct spdk_nvme_feat_host_mem_buffer__bindgen_ty_1 {
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 4usize], u32>,
    pub __bindgen_align: [u32; 0usize],
}
#[test]
fn bindgen_test_layout_spdk_nvme_feat_host_mem_buffer__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<spdk_nvme_feat_host_mem_buffer__bindgen_ty_1>(),
        4usize,
        concat!(
            "Size of: ",
            stringify!(spdk_nvme_feat_host_mem_buffer__bindgen_ty_1)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<spdk_nvme_feat_host_mem_buffer__bindgen_ty_1>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(spdk_nvme_feat_host_mem_buffer__bindgen_ty_1)
        )
    );
}
impl spdk_nvme_feat_host_mem_buffer__bindgen_ty_1 {
    #[inline]
    pub fn ehm(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_ehm(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn mr(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(1usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_mr(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(1usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn reserved(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(2usize, 30u8) as u32) }
    }
    #[inline]
    pub fn set_reserved(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(2usize, 30u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        ehm: u32,
        mr: u32,
        reserved: u32,
    ) -> __BindgenBitfieldUnit<[u8; 4usize], u32> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 4usize], u32> =
            Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let ehm: u32 = unsafe { ::std::mem::transmute(ehm) };
            ehm as u64
        });
        __bindgen_bitfield_unit.set(1usize, 1u8, {
            let mr: u32 = unsafe { ::std::mem::transmute(mr) };
            mr as u64
        });
        __bindgen_bitfield_unit.set(2usize, 30u8, {
            let reserved: u32 = unsafe { ::std::mem::transmute(reserved) };
            reserved as u64
        });
        __bindgen_bitfield_unit
    }
}
#[test]
fn bindgen_test_layout_spdk_nvme_feat_host_mem_buffer() {
    assert_eq!(
        ::std::mem::size_of::<spdk_nvme_feat_host_mem_buffer>(),
        4usize,
        concat!("Size of: ", stringify!(spdk_nvme_feat_host_mem_buffer))
    );
    assert_eq!(
        ::std::mem::align_of::<spdk_nvme_feat_host_mem_buffer>(),
        4usize,
        concat!("Alignment of ", stringify!(spdk_nvme_feat_host_mem_buffer))
    );
}
impl Default for spdk_nvme_feat_host_mem_buffer {
    fn default() -> Self {
        unsafe { ::std::mem::zeroed() }
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union spdk_nvme_feat_keep_alive_timer {
    pub raw: u32,
    pub bits: spdk_nvme_feat_keep_alive_timer__bindgen_ty_1,
    _bindgen_union_align: u32,
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct spdk_nvme_feat_keep_alive_timer__bindgen_ty_1 {
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 4usize], u32>,
    pub __bindgen_align: [u32; 0usize],
}
#[test]
fn bindgen_test_layout_spdk_nvme_feat_keep_alive_timer__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<spdk_nvme_feat_keep_alive_timer__bindgen_ty_1>(),
        4usize,
        concat!(
            "Size of: ",
            stringify!(spdk_nvme_feat_keep_alive_timer__bindgen_ty_1)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<spdk_nvme_feat_keep_alive_timer__bindgen_ty_1>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(spdk_nvme_feat_keep_alive_timer__bindgen_ty_1)
        )
    );
}
impl spdk_nvme_feat_keep_alive_timer__bindgen_ty_1 {
    #[inline]
    pub fn kato(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 32u8) as u32) }
    }
    #[inline]
    pub fn set_kato(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 32u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(kato: u32) -> __BindgenBitfieldUnit<[u8; 4usize], u32> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 4usize], u32> =
            Default::default();
        __bindgen_bitfield_unit.set(0usize, 32u8, {
            let kato: u32 = unsafe { ::std::mem::transmute(kato) };
            kato as u64
        });
        __bindgen_bitfield_unit
    }
}
#[test]
fn bindgen_test_layout_spdk_nvme_feat_keep_alive_timer() {
    assert_eq!(
        ::std::mem::size_of::<spdk_nvme_feat_keep_alive_timer>(),
        4usize,
        concat!("Size of: ", stringify!(spdk_nvme_feat_keep_alive_timer))
    );
    assert_eq!(
        ::std::mem::align_of::<spdk_nvme_feat_keep_alive_timer>(),
        4usize,
        concat!("Alignment of ", stringify!(spdk_nvme_feat_keep_alive_timer))
    );
}
impl Default for spdk_nvme_feat_keep_alive_timer {
    fn default() -> Self {
        unsafe { ::std::mem::zeroed() }
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union spdk_nvme_feat_host_controlled_thermal_management {
    pub raw: u32,
    pub bits: spdk_nvme_feat_host_controlled_thermal_management__bindgen_ty_1,
    _bindgen_union_align: u32,
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct spdk_nvme_feat_host_controlled_thermal_management__bindgen_ty_1 {
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 4usize], u16>,
    pub __bindgen_align: [u32; 0usize],
}
#[test]
fn bindgen_test_layout_spdk_nvme_feat_host_controlled_thermal_management__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<spdk_nvme_feat_host_controlled_thermal_management__bindgen_ty_1>(),
        4usize,
        concat!(
            "Size of: ",
            stringify!(spdk_nvme_feat_host_controlled_thermal_management__bindgen_ty_1)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<spdk_nvme_feat_host_controlled_thermal_management__bindgen_ty_1>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(spdk_nvme_feat_host_controlled_thermal_management__bindgen_ty_1)
        )
    );
}
impl spdk_nvme_feat_host_controlled_thermal_management__bindgen_ty_1 {
    #[inline]
    pub fn tmt2(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 16u8) as u32) }
    }
    #[inline]
    pub fn set_tmt2(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 16u8, val as u64)
        }
    }
    #[inline]
    pub fn tmt1(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(16usize, 16u8) as u32) }
    }
    #[inline]
    pub fn set_tmt1(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(16usize, 16u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(tmt2: u32, tmt1: u32) -> __BindgenBitfieldUnit<[u8; 4usize], u16> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 4usize], u16> =
            Default::default();
        __bindgen_bitfield_unit.set(0usize, 16u8, {
            let tmt2: u32 = unsafe { ::std::mem::transmute(tmt2) };
            tmt2 as u64
        });
        __bindgen_bitfield_unit.set(16usize, 16u8, {
            let tmt1: u32 = unsafe { ::std::mem::transmute(tmt1) };
            tmt1 as u64
        });
        __bindgen_bitfield_unit
    }
}
#[test]
fn bindgen_test_layout_spdk_nvme_feat_host_controlled_thermal_management() {
    assert_eq!(
        ::std::mem::size_of::<spdk_nvme_feat_host_controlled_thermal_management>(),
        4usize,
        concat!(
            "Size of: ",
            stringify!(spdk_nvme_feat_host_controlled_thermal_management)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<spdk_nvme_feat_host_controlled_thermal_management>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(spdk_nvme_feat_host_controlled_thermal_management)
        )
    );
}
impl Default for spdk_nvme_feat_host_controlled_thermal_management {
    fn default() -> Self {
        unsafe { ::std::mem::zeroed() }
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union spdk_nvme_feat_non_operational_power_state_config {
    pub raw: u32,
    pub bits: spdk_nvme_feat_non_operational_power_state_config__bindgen_ty_1,
    _bindgen_union_align: u32,
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct spdk_nvme_feat_non_operational_power_state_config__bindgen_ty_1 {
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 4usize], u32>,
    pub __bindgen_align: [u32; 0usize],
}
#[test]
fn bindgen_test_layout_spdk_nvme_feat_non_operational_power_state_config__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<spdk_nvme_feat_non_operational_power_state_config__bindgen_ty_1>(),
        4usize,
        concat!(
            "Size of: ",
            stringify!(spdk_nvme_feat_non_operational_power_state_config__bindgen_ty_1)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<spdk_nvme_feat_non_operational_power_state_config__bindgen_ty_1>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(spdk_nvme_feat_non_operational_power_state_config__bindgen_ty_1)
        )
    );
}
impl spdk_nvme_feat_non_operational_power_state_config__bindgen_ty_1 {
    #[inline]
    pub fn noppme(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_noppme(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn reserved(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(1usize, 31u8) as u32) }
    }
    #[inline]
    pub fn set_reserved(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(1usize, 31u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(noppme: u32, reserved: u32) -> __BindgenBitfieldUnit<[u8; 4usize], u32> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 4usize], u32> =
            Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let noppme: u32 = unsafe { ::std::mem::transmute(noppme) };
            noppme as u64
        });
        __bindgen_bitfield_unit.set(1usize, 31u8, {
            let reserved: u32 = unsafe { ::std::mem::transmute(reserved) };
            reserved as u64
        });
        __bindgen_bitfield_unit
    }
}
#[test]
fn bindgen_test_layout_spdk_nvme_feat_non_operational_power_state_config() {
    assert_eq!(
        ::std::mem::size_of::<spdk_nvme_feat_non_operational_power_state_config>(),
        4usize,
        concat!(
            "Size of: ",
            stringify!(spdk_nvme_feat_non_operational_power_state_config)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<spdk_nvme_feat_non_operational_power_state_config>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(spdk_nvme_feat_non_operational_power_state_config)
        )
    );
}
impl Default for spdk_nvme_feat_non_operational_power_state_config {
    fn default() -> Self {
        unsafe { ::std::mem::zeroed() }
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union spdk_nvme_feat_software_progress_marker {
    pub raw: u32,
    pub bits: spdk_nvme_feat_software_progress_marker__bindgen_ty_1,
    _bindgen_union_align: u32,
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct spdk_nvme_feat_software_progress_marker__bindgen_ty_1 {
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 4usize], u32>,
    pub __bindgen_align: [u32; 0usize],
}
#[test]
fn bindgen_test_layout_spdk_nvme_feat_software_progress_marker__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<spdk_nvme_feat_software_progress_marker__bindgen_ty_1>(),
        4usize,
        concat!(
            "Size of: ",
            stringify!(spdk_nvme_feat_software_progress_marker__bindgen_ty_1)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<spdk_nvme_feat_software_progress_marker__bindgen_ty_1>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(spdk_nvme_feat_software_progress_marker__bindgen_ty_1)
        )
    );
}
impl spdk_nvme_feat_software_progress_marker__bindgen_ty_1 {
    #[inline]
    pub fn pbslc(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 8u8) as u32) }
    }
    #[inline]
    pub fn set_pbslc(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 8u8, val as u64)
        }
    }
    #[inline]
    pub fn reserved(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(8usize, 24u8) as u32) }
    }
    #[inline]
    pub fn set_reserved(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(8usize, 24u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(pbslc: u32, reserved: u32) -> __BindgenBitfieldUnit<[u8; 4usize], u32> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 4usize], u32> =
            Default::default();
        __bindgen_bitfield_unit.set(0usize, 8u8, {
            let pbslc: u32 = unsafe { ::std::mem::transmute(pbslc) };
            pbslc as u64
        });
        __bindgen_bitfield_unit.set(8usize, 24u8, {
            let reserved: u32 = unsafe { ::std::mem::transmute(reserved) };
            reserved as u64
        });
        __bindgen_bitfield_unit
    }
}
#[test]
fn bindgen_test_layout_spdk_nvme_feat_software_progress_marker() {
    assert_eq!(
        ::std::mem::size_of::<spdk_nvme_feat_software_progress_marker>(),
        4usize,
        concat!(
            "Size of: ",
            stringify!(spdk_nvme_feat_software_progress_marker)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<spdk_nvme_feat_software_progress_marker>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(spdk_nvme_feat_software_progress_marker)
        )
    );
}
impl Default for spdk_nvme_feat_software_progress_marker {
    fn default() -> Self {
        unsafe { ::std::mem::zeroed() }
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union spdk_nvme_feat_host_identifier {
    pub raw: u32,
    pub bits: spdk_nvme_feat_host_identifier__bindgen_ty_1,
    _bindgen_union_align: u32,
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct spdk_nvme_feat_host_identifier__bindgen_ty_1 {
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 4usize], u32>,
    pub __bindgen_align: [u32; 0usize],
}
#[test]
